{"status":{"0":"success","1":"success","2":"success","3":"success","4":"success","5":"success","6":"success","7":"success","8":"success","9":"success"},"totalResults":{"0":73,"1":73,"2":73,"3":73,"4":73,"5":73,"6":73,"7":73,"8":73,"9":73},"results":{"0":{"title":"Twitter can get you fired, cautions Elon Musk","link":"https:\/\/www.thehansindia.com\/technology\/tech-news\/twitter-can-get-you-fired-cautions-elon-musk-724960","keywords":["Tech,Tech News"],"creator":["Kahekashan"],"video_url":null,"description":"Often seen tweeting about cryptocurrency and artificial intelligence, Elon Musk doesn't shy away from sharing memes that most professionals pause in a strict corporate environment.","content":"Elon MuskElon MuskTesla CEO Elon Musk is famous for heading the most valuable electric vehicle (EV) company and for his rude comments on Twitter. So often seen tweeting about cryptocurrency and artificial intelligence, the 50-year-old billionaire doesn't shy away from sharing memes that most professionals pause in a strict corporate environment. It's no secret that posting something \"controversial\" on the microblogging platform could even get you fired. It's an old classic debate that old Internet users like to reiterate, 'talk without consequence.' Therefore, Musk has turned this fiasco into a meme with this clever phrase that some may even consider a warning.The latest meme he shared has a Twitter image with the text, \"get fired from your job in five to ten years.\" It also adds, \"say something you want.\" Although it's not easy to figure out, you might be reminded of the childhood lesson, \"think before you speak.\" What makes this tweet more interesting is Musk's own comment that he shares, \"Good thing I never tweet anything controversial.\"Good thing I never tweet anything controversial pic.twitter.com\/T7sD1q1hvd— Elon Musk (@elonmusk) January 16, 2022 According to a Twitter poll, it's a mockery as the CEO of Tesla recently got into trouble after he decided to sell some of his Tesla stock. Tesla investor David Wagner had sued Musk for allegedly violating agreements with the US securities regulator. The US regulator even sued him in 2018 after joking about Tesla's privatization. The accusations allege that Musk's tweets manipulate Tesla's share prices on the stock market.He also came under fire from some cryptocurrency enthusiasts after calling the new Internet buzzword 'Web3' 'BS.' In simple words, Web3 is the evolution of the 'world wide web,' which now includes blockchains. being mere audience or uploaders In his old tweet, he stated that Web3 is \"more of a marketing buzzword than reality right now.\" However, he seems to believe that Web3 will be a reality in the future, but we're not quite there yet.","pubDate":"2022-01-17 09:59:52","full_description":null,"image_url":"https:\/\/assets.thehansindia.com\/h-upload\/2022\/01\/17\/500x300_1195252-elon.jpg","source_id":"thehansindia"},"1":{"title":"This is the next big company with massive plans for the metaverse","link":"https:\/\/www.tweaktown.com\/news\/84031\/this-is-the-next-big-company-with-massive-plans-for-metaverse\/index.html","keywords":null,"creator":null,"video_url":null,"description":"There is a new company on the horizon that is preparing for a big step into the world of cryptocurrency and the Metaverse. Continue reading at TweakTown >","content":null,"pubDate":"2022-01-17 09:33:01","full_description":null,"image_url":"https:\/\/www.tweaktown.com\/images\/news\/8\/4\/84031_01_this-is-the-next-company-with-massive-plans-for-metaverse.jpg","source_id":"tweaktown"},"2":{"title":"Singapore Central Bank Issues Guidelines to Discourage Crypto Trading","link":"https:\/\/gadgets.ndtv.com\/cryptocurrency\/news\/cryptocurrency-trading-singapore-central-bank-monetary-authority-mas-public-2712489","keywords":null,"creator":null,"video_url":null,"description":"The Monetary Authority of Singapore (MAS) issued guidelines that limit cryptocurrency trading service providers from promoting their services to the general public, as part of a bid to shield retail...","content":null,"pubDate":"2022-01-17 08:55:28","full_description":"The Monetary Authority of Singapore (MAS) on Monday issued guidelines that limit cryptocurrency trading service providers from promoting their services to the general public, as part of a bid to shield retail investors from potential risks. Singapore is a popular location for cryptocurrency companies due to a comparatively clear regulatory and operating environment and is among the forerunners globally in developing a formal licensing framework. But the city-state's authorities have repeatedly warned that trading in digital payment tokens (DPT), or cryptocurrency, is highly risky and not suitable for the general public, as they are subject to sharp speculative swings. The new guidelines clarify the expectations of MAS that companies should not engage in marketing or advertising of DPT services in public areas in Singapore or through the engagement of third parties, such as social media influencers, to promote DPT services to the general public. They can only market or advertise on their own corporate websites, mobile applications or official social media accounts. \"MAS strongly encourages the development of blockchain technology and innovative application of crypto tokens in value-adding use cases,\" Loo Siew Yee, MAS Assistant Managing Director (Policy, Payments and Financial Crime), said in a statement. \"But the trading of cryptocurrencies is highly risky and not suitable for the general public. DPT service providers should therefore not portray the trading of DPTs in a manner that trivialises the high risks of trading in DPTs, nor engage in marketing activities that target the general public.\" © Thomson Reuters 2022 .embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }","image_url":"https:\/\/i.gadgets360cdn.com\/large\/bitcoin_crypto_marlet_cap_pexels_small_1639375288384.jpg","source_id":"ndtv"},"3":{"title":"Homegrown TikTok rival Chingari raises $15 million in new funding","link":"https:\/\/www.techradar.com\/news\/homegrown-tiktok-rival-chingari-raises-dollar15-million-in-new-funding\/","keywords":null,"creator":null,"video_url":null,"description":"The Bengaluru-based short video platform Chingari said the funds will be used, among others, to strengthen the backend technology team, as well as boost its marketing initiatives for 2022.","content":"<article> <p><a href=\"https:\/\/www.techradar.com\/in\/news\/regional-content-drives-indian-short-form-video-apps-to-tiktok-levels\">Chingari<\/a>, which claims to have 32 million active users making it the most popular social media app in the country, has announced that it has raised $15 million in a Series A extension round. <\/p><p>Seen as India's answer to the now banned TikTok, the short video platform Chingari said it would use the funds to launch new in-app features and also strengthen its back-end technology and team.<\/p><p>Chingari is planning to unveil live-streaming, socio-commerce and audio chat features on its platform shortly. The app is also hoping to enhance its user engagement by strengthening local content portfolio with more than 20 languages on the platform.<\/p> <h2 id=\"chingari-to-increase-its-user-base-to-200-million-by-end-of-2022-5\">Chingari to increase its user-base to 200 million by end of 2022<\/h2> <p>Republic Capital led the latest funding with participation from Onmobile, JPIN Venture Catalysts, Hill Harbour, Angellist, Venture Collective, Makan Family, Cowa Ventures, MVC Friends, Protocol Labs and other HNI family offices.<\/p><p>\"This new funding will further strengthen our position and help us deliver an immersive user experience for our community,\" Sumit Ghosh, Co-founder and CEO, Chingari was quoted as saying in a company press statement.<\/p><p>Chingari claims over 110 million downloads, which amounts to a two-fold increase in its user base since April 2021. The short-video making app hopes to take its user base to 200 million by the end of this year.<\/p><p>Chingari allows users to create short videos and upload them on the platform to share with millions of users. Its in-built filters have been popular, and its international competitors include TikTok, Snapchat, Facebook, and Instagram. The app supports more than 20 Indian regional languages, in addition to English and Hindi. <\/p><p>Chingari recently launched a crypto token ‘$GARI' to make content monetisation more mainstream in the country. The cryptocurrency is built on the Solana blockchain, and is expected to enable content creators to monetize their videos, allowing them to earn income from the Chingari app. They can also set up their own e-commerce spaces. <\/p><p>The token will likely facilitate the sale of physical merchandise and non-fungible tokens (NFTs) on Chingari and allow fans to fund their favorite artists. The Bengaluru-based startup said it is the first social network in India to issue crypto tokens.<\/p> <ul><li><a href=\"https:\/\/www.techradar.com\/in\/news\/amazon-great-republic-day-sale#section-smartphone-offers\">Amazon Great Republic Day Sale: Check out today's offer on phones<br> <\/a><\/li><\/ul> <ul><li><strong>Want to know about the latest happenings in tech? Follow TechRadar India on <\/strong><a href=\"https:\/\/twitter.com\/TechRadarIndia\" target=\"_blank\"><strong>Twitter<\/strong><\/a><strong>, <\/strong><a href=\"https:\/\/www.facebook.com\/TechRadarIndia\" target=\"_blank\"><strong>Facebook<\/strong><\/a><a href=\"https:\/\/www.facebook.com\/TechRadarIndia\"><strong> <\/strong><\/a><strong>and <\/strong><a href=\"https:\/\/www.instagram.com\/techradarindia\/\" target=\"_blank\"><strong>Instagram<\/strong><\/a><strong>!<\/strong><\/li><\/ul> <\/article>","pubDate":"2022-01-17 08:31:27","full_description":"Chingari , which claims to have 32 million active users making it the most popular social media app in the country, has announced that it has raised $15 million in a Series A extension round. Seen as India's answer to the now banned TikTok, the short video platform Chingari said it would use the funds to launch new in-app features and also strengthen its back-end technology and team. Chingari is planning to unveil live-streaming, socio-commerce and audio chat features on its platform shortly. The app is also hoping to enhance its user engagement by strengthening local content portfolio with more than 20 languages on the platform. Republic Capital led the latest funding with participation from Onmobile, JPIN Venture Catalysts, Hill Harbour, Angellist, Venture Collective, Makan Family, Cowa Ventures, MVC Friends, Protocol Labs and other HNI family offices. \"This new funding will further strengthen our position and help us deliver an immersive user experience for our community,\" Sumit Ghosh, Co-founder and CEO, Chingari was quoted as saying in a company press statement. Chingari claims over 110 million downloads, which amounts to a two-fold increase in its user base since April 2021. The short-video making app hopes to take its user base to 200 million by the end of this year. Chingari allows users to create short videos and upload them on the platform to share with millions of users. Its in-built filters have been popular, and its international competitors include TikTok, Snapchat, Facebook, and Instagram. The app supports more than 20 Indian regional languages, in addition to English and Hindi. Chingari recently launched a crypto token ‘$GARI' to make content monetisation more mainstream in the country. The cryptocurrency is built on the Solana blockchain, and is expected to enable content creators to monetize their videos, allowing them to earn income from the Chingari app. They can also set up their own e-commerce spaces. The token will likely facilitate the sale of physical merchandise and non-fungible tokens (NFTs) on Chingari and allow fans to fund their favorite artists. The Bengaluru-based startup said it is the first social network in India to issue crypto tokens.","image_url":null,"source_id":"techradar"},"4":{"title":"Walmart could soon begin offering NFTs and cryptocurrency: Report","link":"https:\/\/indianexpress.com\/article\/technology\/crypto\/walmart-could-begin-offering-its-own-cryptocurrency-launch-nfts-7727393\/","keywords":["Crypto","Technology"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-17 08:30:38","full_description":"US retail giant Walmart is the latest company to step into the cryptocurrency bandwagon. Based on trademark documents the retail giant filed in December 2021 with the US Patent and Trademark Office (USPTO), Walmart appears to be venturing into the metaverse with plans to create its own collection of non fungible tokens (NFTs). An NFT is a digital asset that uses blockchain technology to record who owns a digital object such as an image, video, or in-game item. While anyone can view the asset in question, only the buyer can say they are the “official” owner. According to a report by CNBC, Walmart filed at least seven trademarks in late December 2021 that indicates the retailer’s intent to both create and sell virtual goods while a separate filing indicated that the company would be offering users cryptocurrency and NFTs. The documentation states that Walmart may launch “financial services, namely, providing a digital currency and a digital token of value for use by members of an online community via a global computer network.” https:\/\/images.indianexpress.com\/2020\/08\/1x1.png Read more | Ferrari steps into the world of NFTs, inks deal with tech firm Velas In a statement, Walmart said it is “continuously exploring how emerging technologies may shape future shopping experiences. We are testing new ideas all the time,” the company said, adding that “some ideas become products or services that make it to customers. And some we test, iterate, and learn from.” This development comes after Meta (formerly Facebook ) signaled its intention to foster metaverses, since then there has been a rush among major brands to enter the space with currencies, NFTs or both. Read more | ‘For a digitally native life, NFTs will become the core asset’: MetaKovan Adidas, Nike, Gap and many other well-known names have started selling NFTs and hinted at intentions to create virtual spaces. Just few weeks ago, sportswear giant Adidas Originals earned $23.5 million by selling 30,000 of Adidas’ “Into the Metaverse” NFTs within a matter of hours of going on sale. Meanwhile, people are bidding thousands to own these collectibles, and some are even selling for millions. A recent report by Cointelegraph revealed that people have spent over $9 billion in NFT sales so far.","image_url":null,"source_id":"indianexpress"},"5":{"title":"Singapore tells crypto firms not to market services to public","link":"https:\/\/www.bangkokpost.com\/tech\/2248827\/singapore-tells-crypto-firms-not-to-market-services-to-public","keywords":null,"creator":null,"video_url":null,"description":"Singapore's financial regulator told companies in the cryptocurrency industry to refrain from advertising their services to the public, in line with the city-state's desire to curb retail speculation in volatile digital assets.","content":null,"pubDate":"2022-01-17 08:06:00","full_description":"Singapore's financial regulator told companies in the cryptocurrency industry to refrain from advertising their services to the public, in line with the city-state's desire to curb retail speculation in volatile digital assets. Service providers should only market their activities on their own websites, mobile applications, or official social media accounts, the Monetary Authority of Singapore said Monday in a statement. The guideline will cover a broad array of businesses, from banks to payment service providers and crypto exchanges. \"MAS has observed that some DPT service providers have been actively promoting their services through online and physical advertisements or through the provision of physical automated teller machines in public areas,\" the regulator said, referring to what it calls digital payment tokens, its preferred terminology for cryptocurrencies. That could fuel speculation among traders who do not fully grasp the risks, the MAS said. In embracing crypto, Singapore is trying to balance the benefits of financial innovation with the risks stemming from retail traders investing in tokens prone to wild price swings. Some billboards advertising digital-asset exchanges in the city-state last year have since been taken down.","image_url":null,"source_id":"bangkokpost"},"6":{"title":"Singapore tells crypto firms not to market services to public","link":"https:\/\/www.bangkokpost.com\/business\/2248827\/singapore-tells-crypto-firms-not-to-market-services-to-public","keywords":null,"creator":null,"video_url":null,"description":"Singapore's financial regulator told companies in the cryptocurrency industry to refrain from advertising their services to the public, in line with the city-state's desire to curb retail speculation in volatile digital assets.","content":null,"pubDate":"2022-01-17 08:06:00","full_description":"Singapore's financial regulator told companies in the cryptocurrency industry to refrain from advertising their services to the public, in line with the city-state's desire to curb retail speculation in volatile digital assets. Service providers should only market their activities on their own websites, mobile applications, or official social media accounts, the Monetary Authority of Singapore said Monday in a statement. The guideline will cover a broad array of businesses, from banks to payment service providers and crypto exchanges. \"MAS has observed that some DPT service providers have been actively promoting their services through online and physical advertisements or through the provision of physical automated teller machines in public areas,\" the regulator said, referring to what it calls digital payment tokens, its preferred terminology for cryptocurrencies. That could fuel speculation among traders who do not fully grasp the risks, the MAS said. In embracing crypto, Singapore is trying to balance the benefits of financial innovation with the risks stemming from retail traders investing in tokens prone to wild price swings. Some billboards advertising digital-asset exchanges in the city-state last year have since been taken down.","image_url":null,"source_id":"bangkokpost"},"7":{"title":"Cryptocurrency service providers should not promote their services to public, says MAS as it warns of ‘high risks’","link":"https:\/\/www.channelnewsasia.com\/business\/cryptocurrency-service-providers-should-not-promote-their-services-public-says-mas-it-warns-high-risks-2440416","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-17 07:33:08","full_description":null,"image_url":"https:\/\/onecms-res.cloudinary.com\/image\/upload\/s--lyYGIwYQ--\/c_fill%2Ch_900%2Cw_1600\/f_auto%2Cq_auto\/mas-01---file-photo-data.jpg?itok=VPnfaPEU","source_id":"channelnewsasia"},"8":{"title":"Cryptocurrency service providers should not promote their services to public, says MAS as it warns of 'high risks' - CNA","link":"https:\/\/news.google.com\/__i\/rss\/rd\/articles\/CBMilwFodHRwczovL3d3dy5jaGFubmVsbmV3c2FzaWEuY29tL2J1c2luZXNzL2NyeXB0b2N1cnJlbmN5LXNlcnZpY2UtcHJvdmlkZXJzLXNob3VsZC1ub3QtcHJvbW90ZS10aGVpci1zZXJ2aWNlcy1wdWJsaWMtc2F5cy1tYXMtaXQtd2FybnMtaGlnaC1yaXNrcy0yNDQwNDE20gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Cryptocurrency service providers should not promote their services to public, says MAS as it warns of 'high risks'  CNAMAS discourages cryptocurrency firms from advertising their 'highly risky' services in public spaces  TODAYMAS stops crypto service providers from marketing to general public  The Edge SingaporeSingapore Central Bank Warns Crypto Firms Against Promoting Services  MarketWatchView Full coverage on Google News","content":null,"pubDate":"2022-01-17 07:33:00","image_url":null,"source_id":"google"},"9":{"title":"Walmart Could Begin Offering Its Own Cryptocurrency, Launch NFTs","link":"https:\/\/gadgets.ndtv.com\/cryptocurrency\/news\/walmart-nft-cryptocurrency-metaverse-shopping-experience-metaverse-2712179","keywords":null,"creator":null,"video_url":null,"description":"Retail giant Walmart has filed several trademark applications with the United States Patent and Trademark Office in late December for operations related to the metaverse, cryptocurrency and NFTs and...","content":null,"pubDate":"2022-01-17 06:42:53","full_description":"Walmart, the US retail giant and the world's largest company by revenue, appears to be positioning itself for a venture into the world of crypto and non-fungible tokens (NFTs). Based on trademark documents the retail giant filed in December 2021 with the US Patent and Trademark Office (USPTO), the company is also laying the groundwork to create its own cryptocurrency to contend with the likes of Bitcoin and Ether. This isn't the first time we've heard rumblings from Walmart related to the crypto market, but if things do turn out the way it seems, we could see crypto adoption in the retail segment shoot through the roof. According to CNBC , Walmart filed seven trademarks in late December 2021 that appear to indicate the retailer's intent to both make and sell virtual goods while a separate filing indicated that the company would be offering users virtual currency and NFTs . The documentation states, among other things, that Walmart may launch “financial services, namely, providing a digital currency and a digital token of value for use by members of an online community via a global computer network.” Walmart , as expected, hasn't provided any details about its plans, instead telling CNBC in a generic statement that it is “continuously exploring how emerging technologies” may impact its business. The company went on to say that it tests “new ideas all the time,” and that some of them may become actual products and\/or services. Meanwhile, another application also details possibilities for \"physical fitness training services\" as well as classes in the field of health and nutrition. According to a report by The Verge , these applications could take place via augmented reality (AR) and virtual reality (VR) environments. The company also made another filing for the use of its name and logo in both AR and VR. A separate article by Bloomberg pointed out that the company had also filed trademarks for certain names like \"Verse to Curb,\" \"Verse to Home,\" and \"Verse to Store\" — all hinting that the company could be preparing a virtual shopping experience for its customers. Walmart's trademark application also shows that they might make software's in the future. These software suites can be used in e-commerce marketplaces in mobile\/game devices and can also be used for fund transfers, blockchain, crypto, and other similar uses. In the near future, whatever virtual world Walmart plans to open its store in will push the price of its token while being a big push for all stakeholders in the metaverse space. The release of its cryptocurrency means Walmart might even start accepting Bitcoin across all its stores in the US.","image_url":"https:\/\/i.gadgets360cdn.com\/large\/walmart_reuters_small_1555051156927.JPG","source_id":"ndtv"}},"nextPage":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1}}