{"status":{"0":"success","1":"success","2":"success","3":"success","4":"success","5":"success","6":"success","7":"success"},"totalResults":{"0":8,"1":8,"2":8,"3":8,"4":8,"5":8,"6":8,"7":8},"results":{"0":{"title":"Crypto Charts See Green With Altcoins Despite Bitcoin's Price Drop","link":"https:\/\/gadgets.ndtv.com\/cryptocurrency\/news\/bitcoin-ether-btc-eth-crypto-market-price-today-dogecoin-shiba-inu-2712095","keywords":null,"creator":null,"video_url":null,"description":"Along with Bitcoin and Ether, Dogecoin and Shiba Inu also tumbled into dips. Several altcoins however, managed to maintain the green quotient on crypto price charts. The gainers include Tether,...","content":null,"pubDate":"2022-01-17 05:30:58","full_description":"Bitcoin opened with losses on Monday, January 17, stepping into the third week of 2022. With a dip of 0.57 percent, each token of Bitcoin is trading at $46,214 (roughly Rs. 34.2 lakh) on Indian exchange CoinSwitch Kuber. On international exchanges as well, Bitcoin has suffered similarly marginal price loss. The world's oldest cryptocurrency is trading at around $42,500 (roughly Rs. 31.6 lakh) on global exchanges such as CoinMarketCap and Binance. Along with Bitcoin's failure to gain, Ether has also registered losses. Ether is trading at $3,532 (roughly Rs. 2.62 lakh) per token. According to Gadgets 360's crypto price chart , Ether incurred a loss of 1.40 percent and dropped in value from its previously closing price of $3,582 (roughly Rs. 2.65 lakh). Ripple , Polkadot , Dogecoin , and Shiba Inu among a bunch of other popular altcoins also witnessed price lows, following Bitcoin and Ether. The market momentum has slowed down again today after it had seemingly picked pace earlier last week following US' inflation hiking to a 39-year high of seven percent. On January 13, Bitcoin was trading at $43,598 (roughly Rs. 32.2 lakh) on international exchanges. As per industry insiders, the rising popularity of altcoins among investors could pose a challenge to Bitcoin's supremacy. As Bitcoin's prominence begins to waver, BitPay saw a 27 percent drop in merchants processing Bitcoin payments in 2021, and a rise in transactions in stablecoins, Ether and Dogecoin,” the research team of CoinDCX told Gadgets 360. “With altcoins gaining ground amongst retail investors, we may see other digital assets challenging Bitcoin's pole position and place as a safe haven asset in 2022.” Meanwhile, a bunch of cryptocurrencies did manage to register gains despite the mega ones being hit by losses. Tether , Cardano , USD Coin , Polygon , Chainlink , Uniswap and Litecoin climbed up the price ladder with small but significant gains. The predictions of billionaire business tycoons such as Elon Musk and Mark Cuban spell out a bright future for the crypto sector in the times to come. While Musk has opened payments for Tesla merchandise in DOGE, Cuban recently called Ether the closest crypto asset we have to the existing fiat currencies. The maturing crypto sector is also set to see lesser criminals trying to misuse cryptocurrencies in the near future, a report by research firm Chainalysis said. The study claims that the criminal usage of cryptocurrencies will drop around the world, as more governments learn to take advantage of the uncensored transparency that the blockchain technology offers. Cryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.","image_url":"https:\/\/i.gadgets360cdn.com\/large\/cryptocurrency_bitcoin_ethereum_cover_markets_unsplash_small_1641448617205.jpg","source_id":"ndtv"},"1":{"title":"Robinhood on Listing More Cryptocurrencies: ‘It’s Important That We Get a Bit More Clarity From Regulators’","link":"https:\/\/news.bitcoin.com\/robinhood-listing-cryptocurrencies-important-clarity-from-regulators\/","keywords":["Regulation","Robinhood","Robinhood Cryptocurrency","Robinhood Cryptocurrency listings","Robinhood Cryptocurrency Regulations","Robinhood digital assets","robinhood shib","robinhood shiba inu","robinhood trading platform"],"creator":["Kevin Helms"],"video_url":null,"description":"Robinhood’s chief financial officer has revealed the popular trading platform’s crypto priority and the potential of listing more cryptocurrencies. “We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators,” he emphasized. Robinhood Waiting for Regulatory Clarity The chief financial officer (CFO) […]","content":"Robinhood’s chief financial officer has revealed the popular trading platform’s crypto priority and the potential of listing more cryptocurrencies. “We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators,” he emphasized. Robinhood Waiting for Regulatory Clarity The chief financial officer (CFO) of Robinhood, Jason Warnick, talked about cryptocurrency during The Wall Street Journal’s virtual CFO Network Summit last week. Commenting on retail investors’ high demand for Robinhood to list more cryptocurrencies, particularly the meme crypto shiba inu (SHIB), Warnick emphasized, “It’s not lost on us that our customers and others would like to see us add more coins.” However, the Robinhood executive stressed: We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators. Compliance is a top priority at Robinhood. In December last year, the company partnered with blockchain data platform Chainalysis to meet compliance requirements. Supporters of the shiba inu cryptocurrency have been petitioning on Change.org for Robinhood to list SHIB. At the time of writing, 555,811 people have signed the petition. Christine Brown, Robinhood Crypto’s chief operating officer and VP of Product Operations, said in November that the platform is in no hurry to list any additional cryptocurrencies. Her statement was in response to a question about when SHIB will be listed. Robinhood Crypto currently supports the buying, selling, and real-time market data for bitcoin (BTC), bitcoin cash (BCH), bitcoin sv (BSV), dogecoin (DOGE), ethereum (ETH), ethereum classic (ETC), and litecoin (LTC). Warnick also clarified at the summit that Robinhood will not be buying cryptocurrency for its corporate treasury like some companies have done, such as Microstrategy and Tesla. He explained: There aren’t compelling reasons strategically for our business to put any meaningful amount of our corporate cash into cryptocurrencies. In December last year, Robinhood launched a cryptocurrency gift program. The company also announced the upcoming beta launch of its cryptocurrency wallets, which has a waitlist of 1.6 million people. What do you think about the Robinhood executive’s comments? Let us know in the comments section below.","pubDate":"2022-01-17 00:30:50","full_description":"Robinhood on Listing More Cryptocurrencies: 'It's Important That We Get a Bit More Clarity From Regulators' Robinhood’s chief financial officer has revealed the popular trading platform’s crypto priority and the potential of listing more cryptocurrencies. “We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators,” he emphasized. Robinhood Waiting for Regulatory Clarity The chief financial officer (CFO) of Robinhood, Jason Warnick, talked about cryptocurrency during The Wall Street Journal’s virtual CFO Network Summit last week. Commenting on retail investors’ high demand for Robinhood to list more cryptocurrencies, particularly the meme crypto shiba inu (SHIB), Warnick emphasized, “It’s not lost on us that our customers and others would like to see us add more coins.” However, the Robinhood executive stressed: We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators. Compliance is a top priority at Robinhood. In December last year, the company partnered with blockchain data platform Chainalysis to meet compliance requirements. Supporters of the shiba inu cryptocurrency have been petitioning on Change.org for Robinhood to list SHIB. At the time of writing, 555,811 people have signed the petition. Christine Brown, Robinhood Crypto’s chief operating officer and VP of Product Operations, said in November that the platform is in no hurry to list any additional cryptocurrencies. Her statement was in response to a question about when SHIB will be listed. Robinhood Crypto currently supports the buying, selling, and real-time market data for bitcoin ( BTC ), bitcoin cash ( BCH ), bitcoin sv ( BSV ), dogecoin (DOGE), ethereum ( ETH ), ethereum classic ( ETC ), and litecoin ( LTC ). Warnick also clarified at the summit that Robinhood will not be buying cryptocurrency for its corporate treasury like some companies have done, such as Microstrategy and Tesla. He explained: There aren’t compelling reasons strategically for our business to put any meaningful amount of our corporate cash into cryptocurrencies. In December last year, Robinhood launched a cryptocurrency gift program . The company also announced the upcoming beta launch of its cryptocurrency wallets , which has a waitlist of 1.6 million people. Tags in this story Robinhood , Robinhood Cryptocurrency , Robinhood Cryptocurrency listings , Robinhood Cryptocurrency Regulations , Robinhood digital assets , robinhood shib , robinhood shiba inu , robinhood trading platform What do you think about the Robinhood executive’s comments? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. Pakistan Seeks to Block Websites Dealing in Cryptocurrency: Report REGULATION | 10 hours ago MTI Mastermind Arrest: Lawyer Points to Agreement Relating to Johann Steynberg's Extradition to South Africa REGULATION | 18 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Jack Dorsey’s Payments Company Is ‘Officially Building an Open Bitcoin Mining System’ Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Russia’s Tinkoff Bank Enters Crypto Space Through Swiss Company Acquisition The Russian neobank Tinkoff is joining the world of cryptocurrencies with the purchase of a stake in Aximetria, a Swiss-registered and licensed company which provides clients around the world with services and solutions for digital financial assets. Tinkoff Bank Buys ... read more. Revolut Launches Banking Services in Spain Featuring Deposit Insurance Swiss National Bank Trials CBDC in Transactions With Five Banks Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption","image_url":null,"source_id":"bitcoin"},"2":{"title":"Why Dogecoin Is Plummeting Today","link":"https:\/\/www.fool.com\/investing\/2022\/01\/16\/why-dogecoin-is-sinking-today\/?source=iedfolrf0000001","keywords":null,"creator":["newsfeedback@fool.com (Keith Noonan)"],"video_url":null,"description":"Dogecoin is falling faster than any other top-15 cryptocurrency today.","content":"The price of Dogecoin (CRYPTO: DOGE) is sinking in Sunday's trading. The cryptocurrency was down 5.7% over the previous 24-hour period as of 11:45 a.m. ET. With Bitcoin and Ethereum roughly flat over the previous day of trading and the broader cryptocurrency market looking uncharacteristically stable, Dogecoin's sell-off likely stems from investors taking profits after recent gains. The token began climbing early in the week and posted even bigger gains after Tesla CEO Elon Musk announced that his electric-vehicle company would accept DOGE as payment for its merchandise. Now, the popular meme cryptocurrency seems to be taking a breather. Image source: Getty Images.Continue reading","pubDate":"2022-01-16 16:49:27","full_description":"What happened The price of Dogecoin ( CRYPTO:DOGE ) is sinking in Sunday's trading. The cryptocurrency was down 5.7% over the previous 24-hour period as of 11:45 a.m. ET. With Bitcoin and Ethereum roughly flat over the previous day of trading and the broader cryptocurrency market looking uncharacteristically stable, Dogecoin's sell-off likely stems from investors taking profits after recent gains. The token began climbing early in the week and posted even bigger gains after Tesla CEO Elon Musk announced that his electric-vehicle company would accept DOGE as payment for its merchandise. Now, the popular meme cryptocurrency seems to be taking a breather. Image source: Getty Images. So what Over the last year, Elon Musk has been a Dogecoin holder's best friend. The famous executive has hinted at, and directly expressed, support for the token through Twitter messages and other channels, and his comments have frequently powered impressive gains for the meme-powered cryptocurrency. Even with the recent pullback, Dogecoin is still up roughly 19% over the last seven days. After Musk published a Tweet on Jan. 14 announcing that Dogecoin could be used to purchase Tesla merch, the token's price quickly spiked 25%. While there doesn't appear to be any coin-specific news behind the cryptocurrency's pullback on Sunday, it's not surprising to see Dogecoin give up some ground on the heels of the recent pop. Now what Dogecoin trades down roughly 75% from the lifetime high that it hit last May. Yet, even after recent volatility in the broader cryptocurrency space and substantial draw downs for its token price, the cryptocurrency is still up roughly 1,900% over the last year. Dogecoin Price data by YCharts Dogecoin was started as a campy, dog-themed clone of Bitcoin, but the token went on to deliver seriously impressive returns for investors who got in before its massive pricing surge. The token currently has a market capitalization of roughly $23.6 billion and ranks as the 11th largest cryptocurrency by valuation. While Ethereum, Solana , and Cardano have underlying blockchain service networks that help shape the performance of their respective cryptocurrencies, the pricing drivers for Dogecoin are currently limited to coin adoption and speculation. If more companies begin accepting the token as a payment method or more trading platforms introduce the option to buy and sell the cryptocurrency, that could help to send Dogecoin higher. However, investors should proceed with the understanding that Dogecoin is a high-risk investment, and its trading will likely continue to be highly volatile.","image_url":null,"source_id":"fool"},"3":{"title":"Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin","link":"https:\/\/news.bitcoin.com\/survey-proportion-of-south-african-crypto-holders-grows-to-11-3-56-of-crypto-owners-hold-bitcoin\/","keywords":["Emerging Markets","crypto holders","cryptocurrency ownership","dogecoin","Solana","south africa crypto","XRP"],"creator":["Terence Zimwara"],"video_url":null,"description":"The number of surveyed South Africans that own crypto grew marginally from 10.3% in October 2021, to 11.3% in December 2021. With this rate of ownership, South Africa is now ranked number 21 out of the 27 countries whose internet users participated in the survey. South African Ownership Rate Below Global Average According to the […]","content":"The number of surveyed South Africans that own crypto grew marginally from 10.3% in October 2021, to 11.3% in December 2021. With this rate of ownership, South Africa is now ranked number 21 out of the 27 countries whose internet users participated in the survey. South African Ownership Rate Below Global Average According to the findings of the latest Finder survey, out of the 2,003 South African internet users that were surveyed, 11.3% said they own cryptocurrency. This cryptocurrency ownership rate is said to be marginally higher than that of the United States (10.5%) and Sweden (9.8%). Still, as the survey findings show, South Africa’s latest cryptocurrency ownership rate is yet below the global average, which jumped from 11.2% in October to 15.5% in December 2021. From the total of 27 countries that were surveyed, South Africa is now positioned in 21st place. In terms of the popularity of different cryptocurrencies, the survey findings indicate that 56% of the crypto owners in South Africa own bitcoin. With this proportion of internet users that own BTC, South Africa is the second-highest ranked out of the 27 countries. However, the findings also appear to suggest that other cryptocurrencies are gaining ground. “Between now and the last survey, the number of crypto owners surveyed who said they held BTC has fallen from the 73.5% of respondents who said they own Bitcoin in October to 56% in December,” explains the Finder survey report. Altcoin Popularity Growing According to the findings, ethereum is the second most popular cryptocurrency with a share of 31.5%. This ownership rate, which is 7.1% higher than the global average of 24.4%, sees South Africa rank as the country with the eighth-highest proportion of internet users that own ethereum. In third place is XRP which is owned by 25.8% of the surveyed users while dogecoin and solana are in the fourth and fifth positions respectively. Meanwhile, the survey also found that out of those that said they own crypto, 62% are men and 38% are women. According to the survey report, this means South African “men are roughly 1.6 times as likely to own crypto than women.” On the other hand, the survey found that 48.7% of South Africans aged 18 to 34 are crypto holders. This figure is 16 percentage points higher than that of South African holders between the ages of 35 and 54. What are your thoughts concerning the findings of the latest Finder survey? Tell us what you think in the comments section below.","pubDate":"2022-01-16 12:30:55","full_description":"Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin The number of surveyed South Africans that own crypto grew marginally from 10.3% in October 2021, to 11.3% in December 2021. With this rate of ownership, South Africa is now ranked number 21 out of the 27 countries whose internet users participated in the survey. South African Ownership Rate Below Global Average According to the findings of the latest Finder survey, out of the 2,003 South African internet users that were surveyed, 11.3% said they own cryptocurrency. This cryptocurrency ownership rate is said to be marginally higher than that of the United States (10.5%) and Sweden (9.8%). Still, as the survey findings show, South Africa’s latest cryptocurrency ownership rate is yet below the global average, which jumped from 11.2% in October to 15.5% in December 2021. From the total of 27 countries that were surveyed, South Africa is now positioned in 21st place. In terms of the popularity of different cryptocurrencies, the survey findings indicate that 56% of the crypto owners in South Africa own bitcoin. With this proportion of internet users that own BTC , South Africa is the second-highest ranked out of the 27 countries. However, the findings also appear to suggest that other cryptocurrencies are gaining ground. “Between now and the last survey, the number of crypto owners surveyed who said they held BTC has fallen from the 73.5% of respondents who said they own Bitcoin in October to 56% in December,” explains the Finder survey report. Altcoin Popularity Growing According to the findings, ethereum is the second most popular cryptocurrency with a share of 31.5%. This ownership rate, which is 7.1% higher than the global average of 24.4%, sees South Africa rank as the country with the eighth-highest proportion of internet users that own ethereum. In third place is XRP which is owned by 25.8% of the surveyed users while dogecoin and solana are in the fourth and fifth positions respectively. Meanwhile, the survey also found that out of those that said they own crypto, 62% are men and 38% are women. According to the survey report, this means South African “men are roughly 1.6 times as likely to own crypto than women.” On the other hand, the survey found that 48.7% of South Africans aged 18 to 34 are crypto holders. This figure is 16 percentage points higher than that of South African holders between the ages of 35 and 54. Tags in this story crypto holders , cryptocurrency ownership , dogecoin , Solana , south africa crypto , XRP What are your thoughts concerning the findings of the latest Finder survey? Tell us what you think in the comments section below. Terence Zimwara Terence Zimwara is a Zimbabwe award-winning journalist, author and writer. He has written extensively about the economic troubles of some African countries as well as how digital currencies can provide Africans with an escape route. First Cryptocurrency ATM Reportedly Installed in Uruguay EMERGING MARKETS | 1 day ago Report: Kenya Set to Scale Up Adoption of Cryptocurrencies in 2022 EMERGING MARKETS | 6 days ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Gift to Pope Francis Sold as NFT Raises $80,000 for Afghanistan Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Near Foundation Raises $150 Million to Bolster Web3 Adoption On Thursday, the Near Foundation announced the project has raised $150 million from strategic investors such as Three-Arrows Capital, a16z, Mechanism Capital, Dragonfly Capital, and Circle Ventures. Following the announcement, the Near protocol’s native crypto asset jumped more than 7% ... read more. Russia’s Tinkoff Bank Enters Crypto Space Through Swiss Company Acquisition Revolut Launches Banking Services in Spain Featuring Deposit Insurance Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin","image_url":null,"source_id":"bitcoin"},"4":{"title":"Vitalik Buterin Asks Twitter Followers Which Crypto They Prefer to Overtake Ethereum — Cardano, Tron Favorites","link":"https:\/\/news.bitcoin.com\/vitalik-buterin-crypto-twitter-currency-prefer-overtake-ethereum-cardano-tron\/","keywords":["Altcoins","Bitcoin","Cardano","crypto replace ethereum","crypto replacing ethereum","tron","Vitalik Buterin","Vitalik Buterin poll","Vitalik Buterin poll cryptocurrency poll"],"creator":["Kevin Helms"],"video_url":null,"description":"Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter asking his followers if 80% of all transactions and savings in the year 2035 are in one currency and it is not ether, which currency they would prefer it to be. He asked them to choose from a number of cryptocurrencies including bitcoin, […]","content":"Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter asking his followers if 80% of all transactions and savings in the year 2035 are in one currency and it is not ether, which currency they would prefer it to be. He asked them to choose from a number of cryptocurrencies including bitcoin, cardano, solana, tron, and Binance coin. Vitalik Buterin’s Cryptocurrency Twitter Polls Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter Thursday for the Ethereum community. “You wake up in 2035 and 80% of all transactions and savings in the world are in one currency that is not ETH. Which would you prefer it to be?” He wrote. In his first tweet, Buterin asked his followers to choose from BTC, USD, SOL, and ADA. The second tweet lets them choose from TRON, BNB, CNY, and NEO. After 24 hours, the first poll ended with 600,697 votes and the second with 358,743 votes. Cardano (ADA) tops the results of the first poll, followed by bitcoin (BTC) and solana (SOL). Tron (TRON) tops the results of the second poll, followed by Binance coin (BNB) and neo (NEO). Buterin’s first poll includes the top cryptocurrencies by market cap, excluding stablecoins. At the time of writing, bitcoin, the largest cryptocurrency, has a market cap of $821 billion based on data from Bitcoin.com Markets. Solana, the fifth-largest crypto, has a market cap of $47 billion while cardano, the seventh-largest coin, has a market cap of $42 billion. Buterin’s second poll includes the third-largest cryptocurrency, Binance coin, which has a market cap of $83 billion. Tron’s market cap is $7 billion whereas neo’s is less than $2 billion. While the Ethereum co-founder’s polls appear fun and have attracted many comments and likes on social media, people questioned Buterin’s motives for posting such polls, the choice of cryptocurrencies he included, whether votes were made by bots, and the likelihood that 80% of transactions will be in one currency. Bitcoin trader Tone Vays commented, “Is Vitalik looking for a new job?” The CEO of cryptocurrency exchange FTX, Sam Bankman-Fried, opined: These results are….. wild. Other cryptocurrencies that have been recommended by Vitalik’s Twitter followers in response to the polls include XRP, dogecoin (DOGE), shiba inu (SHIB), and polkadot (DOT). Meanwhile, several people pointed out that the outcome of Buterin’s polls only reflects the popularity of certain cryptocurrencies among his followers and Twitter users, emphasizing that they have no bearing on the popularity of a particular cryptocurrency in the real world. Bank of America, however, believes that Solana could take market share away from Ethereum. What do you think about Vitalik Buterin’s polls? Which cryptocurrency would you prefer? Let us know in the comments section below.","pubDate":"2022-01-16 02:30:23","full_description":"Vitalik Buterin Asks Twitter Followers Which Crypto They Prefer to Overtake Ethereum — Cardano, Tron Favorites Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter asking his followers if 80% of all transactions and savings in the year 2035 are in one currency and it is not ether, which currency they would prefer it to be. He asked them to choose from a number of cryptocurrencies including bitcoin, cardano, solana, tron, and Binance coin. Vitalik Buterin’s Cryptocurrency Twitter Polls Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter Thursday for the Ethereum community. “You wake up in 2035 and 80% of all transactions and savings in the world are in one currency that is not ETH . Which would you prefer it to be?” He wrote. In his first tweet, Buterin asked his followers to choose from BTC , USD, SOL, and ADA . The second tweet lets them choose from TRON, BNB , CNY, and NEO . After 24 hours, the first poll ended with 600,697 votes and the second with 358,743 votes. Cardano ( ADA ) tops the results of the first poll, followed by bitcoin ( BTC ) and solana (SOL). Tron (TRON) tops the results of the second poll, followed by Binance coin ( BNB ) and neo ( NEO ). Buterin’s first poll includes the top cryptocurrencies by market cap, excluding stablecoins. At the time of writing, bitcoin, the largest cryptocurrency, has a market cap of $821 billion based on data from Bitcoin.com Markets. Solana, the fifth-largest crypto, has a market cap of $47 billion while cardano, the seventh-largest coin, has a market cap of $42 billion. Top cryptocurrencies by market capitalization. Source: Bitcoin.com Markets. Buterin’s second poll includes the third-largest cryptocurrency, Binance coin, which has a market cap of $83 billion. Tron’s market cap is $7 billion whereas neo’s is less than $2 billion. While the Ethereum co-founder’s polls appear fun and have attracted many comments and likes on social media, people questioned Buterin’s motives for posting such polls, the choice of cryptocurrencies he included, whether votes were made by bots, and the likelihood that 80% of transactions will be in one currency. Bitcoin trader Tone Vays commented, “Is Vitalik looking for a new job?” The CEO of cryptocurrency exchange FTX, Sam Bankman-Fried, opined: These results are….. wild. Other cryptocurrencies that have been recommended by Vitalik’s Twitter followers in response to the polls include XRP , dogecoin (DOGE), shiba inu (SHIB), and polkadot (DOT). Meanwhile, several people pointed out that the outcome of Buterin’s polls only reflects the popularity of certain cryptocurrencies among his followers and Twitter users, emphasizing that they have no bearing on the popularity of a particular cryptocurrency in the real world. Bank of America, however, believes that Solana could take market share away from Ethereum. Tags in this story Bitcoin , Cardano , crypto replace ethereum , crypto replacing ethereum , tron , Vitalik Buterin , Vitalik Buterin poll , Vitalik Buterin poll cryptocurrency poll What do you think about Vitalik Buterin’s polls? Which cryptocurrency would you prefer? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. Bank of America Says Solana Could Take Market Share From Ethereum, Become the Visa of the Crypto Ecosystem ALTCOINS | 2 hours ago Stablecoin USDC's ERC20 Issuance Surpasses USDT's Total Supply on Ethereum ALTCOINS | 10 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Bank of America Says Solana Could Take Market Share From Ethereum, Become the Visa of the Crypto Ecosystem Show comments More Popular News In Case You Missed It Revolut Launches Banking Services in Spain Featuring Deposit Insurance Revolut, a leading fintech platform and neobank, has received a special banking license to operate in Spain. User deposits are now insured up to €100K, with the coverage being provided by Deposit and Investment Insurance, a Lithuanian state company. The ... read more. NYCB and Group of Banks Join to Launch USDF Stablecoin Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption","image_url":null,"source_id":"bitcoin"},"5":{"title":"Meme Coin Markets Gain Close to 5% in 24 Hours, Dogecoin’s Value Jumps, 3 Meme Tokens See Triple Digit Gains","link":"https:\/\/news.bitcoin.com\/meme-coin-markets-gain-close-to-5-in-24-hours-dogecoins-value-jumps-3-meme-tokens-see-triple-digit-gains\/","keywords":["Markets and Prices","Baby Doge Coin","CAT Token","catbonk","crypto meme assets","Dog Coins","Dog Tokens","Doge","dogebonk","dogecoin","Dogecoin price","Dogelon","dogelon mars","Dogs","donkey","Elon Musk","fantom doge","floki pup","Gains","kitty coin","kitty coin solana","meme coin assets","Meme Coins","Meme Token","Meme Tokens","meta doge","shib","SHIB price","shiba inu","Shiba Inu Gains","solabrador","Tesla","weekly gains"],"creator":["Jamie Redman"],"video_url":null,"description":"The top meme tokens by market capitalization have increased in value by 4.4% in the last 24 hours according to statistics. Dogecoin had a good week jumping more than 20% during the last seven days. However, 14 meme tokens surpassed dogecoin’s weekly jump as a few tokens have seen triple-digit spikes over the last week. […]","content":"The top meme tokens by market capitalization have increased in value by 4.4% in the last 24 hours according to statistics. Dogecoin had a good week jumping more than 20% during the last seven days. However, 14 meme tokens surpassed dogecoin’s weekly jump as a few tokens have seen triple-digit spikes over the last week. Tesla Acceptance Pushes Dogecoin Up 20% This Week, Shiba Inu Gains Over 7% After the electric car company, Tesla announced the firm would be accepting dogecoin (DOGE) payments, the meme crypto spiked in value almost immediately. At the time of writing, metrics show that DOGE has gained 20.3% over the last week. Data shows DOGE has seen a 24-hour price range of around $0.182 to $0.192 per unit on January 15. DOGE has an overall market valuation of around $24.8 billion and that represents 1.13% of the $2.20 trillion crypto economy. The second-largest meme crypto token shiba inu (SHIB) has not had a great week, compared to DOGE. Despite this, seven-day metrics show SHIB has gained 7.3% against the U.S. dollar. SHIB’s market valuation is just over $17 billion on Saturday, with $614 million in global trade volume. DOGE on the other hand has $1.9 billion in 24-hour trades at the time of writing. SHIB has seen a 24-hour price range of around $0.00003064 to $0.00003155 per coin. 14 Meme Tokens Outshined Dogecoin’s Weekly Gains While DOGE saw a big push this week, in terms of seven-day gains, numerous other meme tokens saw much larger gains than the doge father of meme coins. For instance, some coins like spookyshiba (SPOOKYSHIBA) have seen triple-digit gains. The meme asset spookyshiba has jumped 226.2% this past week. Kuma inu (KUMA) has spiked 112.9% and shiba fantom (SHIBA) increased 109% over the last seven days. Other notable meme coin gainers this week include solabrador (SOLAB) which jumped 70.8%, kitty coin solana (KITTY) swelled by 59.9%, and dogebonk’s (DOBO) value grew by 53% in seven days. Baby doge coin (BABYDOGE) is up by 42.7%, cat token (CAT) lifted by 38.7%, and floki pup (FLOKIPUP) saw a 38.2% weekly gain. Five other meme coin crypto assets still had better gains than DOGE, even with Tesla’s recent acceptance announcement. What do you think about the meme coin economy today? What do you think about Dogecoin’s 20% weekly gains or the triple-digit meme token gainers this past week? Let us know what you think about this subject in the comment section below.","pubDate":"2022-01-15 22:30:07","full_description":"Meme Coin Markets Gain Close to 5% in 24 Hours, Dogecoin's Value Jumps, 3 Meme Tokens See Triple Digit Gains The top meme tokens by market capitalization have increased in value by 4.4% in the last 24 hours according to statistics. Dogecoin had a good week jumping more than 20% during the last seven days. However, 14 meme tokens surpassed dogecoin’s weekly jump as a few tokens have seen triple-digit spikes over the last week. Tesla Acceptance Pushes Dogecoin Up 20% This Week, Shiba Inu Gains Over 7% After the electric car company, Tesla announced the firm would be accepting dogecoin (DOGE) payments, the meme crypto spiked in value almost immediately. At the time of writing, metrics show that DOGE has gained 20.3% over the last week. Data shows DOGE has seen a 24-hour price range of around $0.182 to $0.192 per unit on January 15. DOGE has an overall market valuation of around $24.8 billion and that represents 1.13% of the $2.20 trillion crypto economy. DOGE\/USD 1 Year chart via Tradingview on January 15, 2022. The second-largest meme crypto token shiba inu (SHIB) has not had a great week, compared to DOGE . Despite this, seven-day metrics show SHIB has gained 7.3% against the U.S. dollar. SHIB ’s market valuation is just over $17 billion on Saturday, with $614 million in global trade volume. DOGE on the other hand has $1.9 billion in 24-hour trades at the time of writing. SHIB has seen a 24-hour price range of around $0.00003064 to $0.00003155 per coin. 14 Meme Tokens Outshined Dogecoin’s Weekly Gains While DOGE saw a big push this week, in terms of seven-day gains, numerous other meme tokens saw much larger gains than the doge father of meme coins. For instance, some coins like spookyshiba (SPOOKYSHIBA) have seen triple-digit gains. The meme asset spookyshiba has jumped 226.2% this past week. Kuma inu (KUMA) has spiked 112.9% and shiba fantom (SHIBA) increased 109% over the last seven days. The top meme coin gainers this week recorded on January 15, 2022, according to coingecko.com metrics. Other notable meme coin gainers this week include solabrador (SOLAB) which jumped 70.8%, kitty coin solana (KITTY) swelled by 59.9%, and dogebonk’s (DOBO) value grew by 53% in seven days. Baby doge coin (BABYDOGE) is up by 42.7%, cat token (CAT) lifted by 38.7%, and floki pup (FLOKIPUP) saw a 38.2% weekly gain. Five other meme coin crypto assets still had better gains than DOGE, even with Tesla’s recent acceptance announcement. Tags in this story Baby Doge Coin , CAT Token , catbonk , crypto meme assets , Dog Coins , Dog Tokens , Doge , dogebonk , dogecoin , Dogecoin price , Dogelon , dogelon mars , Dogs , donkey , Elon Musk , fantom doge , floki pup , Gains , kitty coin , kitty coin solana , meme coin assets , Meme Coins , Meme Token , Meme Tokens , meta doge , shib , SHIB price , shiba inu , Shiba Inu Gains , solabrador , Tesla , weekly gains What do you think about the meme coin economy today? What do you think about Dogecoin’s 20% weekly gains or the triple-digit meme token gainers this past week? Let us know what you think about this subject in the comment section below. Jamie Redman Jamie Redman is the News Lead at Bitcoin.com News and a financial tech journalist living in Florida. Redman has been an active member of the cryptocurrency community since 2011. He has a passion for Bitcoin, open-source code, and decentralized applications. Since September 2015, Redman has written more than 5,000 articles for Bitcoin.com News about the disruptive protocols emerging today. Swiss Bank Seba Predicts Bitcoin Could Hit $75K This Year Boosted by Institutional Investors MARKETS AND PRICES | 3 days ago NFT Market Looksrare Surpasses Opensea's 24-Hour Sales With $385 Million in Volume MARKETS AND PRICES | 3 days ago Image Credits : Shutterstock, Pixabay, Wiki Commons, Tradingview, Coingecko.com, Previous article Russia Busts Revil Ransomware Group on US Request, Arrests 14 Members Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Near Foundation Raises $150 Million to Bolster Web3 Adoption On Thursday, the Near Foundation announced the project has raised $150 million from strategic investors such as Three-Arrows Capital, a16z, Mechanism Capital, Dragonfly Capital, and Circle Ventures. Following the announcement, the Near protocol’s native crypto asset jumped more than 7% ... read more. Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament British Lawmakers Say a CBDC Is Likely to Hurt Financial Stability — Digital Pound Benefits Overstated","image_url":null,"source_id":"bitcoin"},"6":{"title":"Elon Musk 'humiliated' after Dogebonk take 'moon mission' challenge to SpaceX factory","link":"https:\/\/www.express.co.uk\/finance\/city\/1550682\/elon-musk-news-latest-dogebonk-first-memecoin-space-billboard-advert-space-x-california","keywords":null,"creator":null,"video_url":null,"description":"ELON MUSK has been mocked for failing to make Dogecoin the first memecoin in space on the doorstep of his Space X factory in California.","content":null,"pubDate":"2022-01-15 20:04:45","full_description":null,"image_url":null,"source_id":"express"},"7":{"title":"Dogecoin Holds Steady, But Traders Hit Hard This Weekend","link":"https:\/\/www.fool.com\/investing\/2022\/01\/15\/dogecoin-holds-steady-but-traders-hit-hard-this-we\/?source=iedfolrf0000001","keywords":null,"creator":["newsfeedback@fool.com (Chris MacDonald)"],"video_url":null,"description":"Dogecoin investors are down today, but still up big for the week.","content":"In early Saturday trading, price fluctuations for meme token Dogecoin (CRYPTO: DOGE) took traders on a wild ride. The price of Dogecoin dropped 2.3% over the past 24 hours, as of 11 a.m. ET. However, this dog-inspired cryptocurrency did hold on to the majority of yesterday's double-digit gains, a net positive for Dogecoin bulls.Yesterday's massive rally, induced by a tweet from Tesla (NASDAQ: TSLA) CEO Elon Musk who announced that Dogecoin would be accepted for some types of Tesla merch, sent this meme token on its biggest rally in a month. Those shorting this meme token got hurt from this news, with derivatives-linked liquidations totaling nearly $12 million for short-sellers yesterday. Image source: Getty Images.Continue reading","pubDate":"2022-01-15 17:32:20","full_description":"What happened In early Saturday trading, price fluctuations for meme token Dogecoin ( CRYPTO:DOGE ) took traders on a wild ride. The price of Dogecoin dropped 2.3% over the past 24 hours, as of 11 a.m. ET. However, this dog-inspired cryptocurrency did hold on to the majority of yesterday's double-digit gains , a net positive for Dogecoin bulls. Yesterday's massive rally, induced by a tweet from Tesla ( NASDAQ:TSLA ) CEO Elon Musk who announced that Dogecoin would be accepted for some types of Tesla merch, sent this meme token on its biggest rally in a month. Those shorting this meme token got hurt from this news, with derivatives-linked liquidations totaling nearly $12 million for short-sellers yesterday. Image source: Getty Images. So what Continued volatility for Dogecoin has kept derivatives liquidations relatively high, with $5 million in liquidations reported over the past 24 hours, as per analytics site Coinglass. Derivatives allow for investors to make leveraged bets on short-term price swings in given tokens. Due to the already elevated volatility and risk levels of cryptocurrencies in general and meme tokens in particular, these financial products can often lead to forced liquidations of positions (similar to margin calls in the equities world). Now what Traders don't appear ready to stop trading Dogecoin. The Shiba Inu-inspired token has seen incredible rallies and declines in the past. These short-term swings provide the potential for traders to make a lot of money in a short period of time, or lose in a big way. Over the past two days, losses have mounted, for those taking a bearish view of Dogecoin. Like any volatile asset class, investors should remember to practice discipline in sizing positions appropriately, according to each individual's risk tolerance level. For most, Dogecoin itself is already too risky to consider as a serious investable asset. Dogecoin derivatives take the risk to a whole new level, aimed at the most risk-loving investors out there. Thus, the volatility we're seeing in Dogecoin could potentially be amplified by derivatives-linked buying and selling in the near term. Those looking to invest in this token should be aware of what the short-term price volatility implications are, before diving in.","image_url":null,"source_id":"fool"}},"nextPage":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null}}