{"status":{"0":"success","1":"success","2":"success","3":"success","4":"success","5":"success","6":"success","7":"success","8":"success","9":"success"},"totalResults":{"0":54,"1":54,"2":54,"3":54,"4":54,"5":54,"6":54,"7":54,"8":54,"9":54},"results":{"0":{"title":"New Apple iPad Pro Is Rumored to Feature MagSafe Charging","link":"https:\/\/hypebeast.com\/2022\/1\/apple-ipad-pro-rumored-magsafe-charging-new-chip","keywords":["Tech"],"creator":null,"video_url":null,"description":"New rumors have surfaced surrounding the new Apple iPad Pro. According to various sources, the next generation of the Apple iPad Pro will face a redesign that will allow the tablet to be charged using MagSafe wireless charging.Though that is the case, the design seems to go against what has been previously reported, which is that the iPad will see an all-glass back like the recent iPhones. The new iPad Pro's MagSafe charger would instead be utilized through an enlarged glass Apple logo built on the metal back of the tablet. It is expected to have a faster-charging speed than the current iPhone, suggesting stronger magnets.The iPad Pro might also see an evident improvement to its camera, as well as a greater battery. Sources have also suggested that Apple will be implementing a \"brand new chip.\" It is speculated that it would be the same M2 chip used for the new MacBook Air, which is rumored to increase its graphics core and allow the system to run at a faster speed. There is currently no specific time frame in which Apple has stated the new iPad Pro will launch.In other tech news, Rio de Janeiro is allocating 1% of its treasury to Bitcoin.Click here to view full gallery at HYPEBEAST","content":"New rumors have surfaced surrounding the new Apple iPad Pro. According to various sources, the next generation of the Apple iPad Pro will face a redesign that will allow the tablet to be charged using MagSafe wireless charging.Though that is the case, the design seems to go against what has been previously reported, which is that the iPad will see an all-glass back like the recent iPhones. The new iPad Pro's MagSafe charger would instead be utilized through an enlarged glass Apple logo built on the metal back of the tablet. It is expected to have a faster-charging speed than the current iPhone, suggesting stronger magnets.The iPad Pro might also see an evident improvement to its camera, as well as a greater battery. Sources have also suggested that Apple will be implementing a \"brand new chip.\" It is speculated that it would be the same M2 chip used for the new MacBook Air, which is rumored to increase its graphics core and allow the system to run at a faster speed. There is currently no specific time frame in which Apple has stated the new iPad Pro will launch.In other tech news, Rio de Janeiro is allocating 1% of its treasury to Bitcoin.Click here to view full gallery at HYPEBEAST","pubDate":"2022-01-17 08:51:49","full_description":"New rumors have surfaced surrounding the new Apple iPad Pro . According to various sources , the next generation of the Apple iPad Pro will face a redesign that will allow the tablet to be charged using MagSafe wireless charging. Though that is the case, the design seems to go against what has been previously reported, which is that the iPad will see an all-glass back like the recent iPhones. The new iPad Pro’s MagSafe charger would instead be utilized through an enlarged glass Apple logo built on the metal back of the tablet. It is expected to have a faster-charging speed than the current iPhone, suggesting stronger magnets. The iPad Pro might also see an evident improvement to its camera, as well as a greater battery. Sources have also suggested that Apple will be implementing a “brand new chip.” It is speculated that it would be the same M2 chip used for the new MacBook Air, which is rumored to increase its graphics core and allow the system to run at a faster speed. There is currently no specific time frame in which Apple has stated the new iPad Pro will launch. In other tech news, Rio de Janeiro is allocating 1% of its treasury to Bitcoin .","image_url":null,"source_id":"hypebeast"},"1":{"title":"Bitcoin price prediction: Which crypto will explode in 2022? Expert analysis","link":"https:\/\/www.express.co.uk\/finance\/city\/1549261\/Bitcoin-price-prediction-cryptocurrency-2022-evg","keywords":null,"creator":null,"video_url":null,"description":"BITCOIN is attempting to regain even footing in 2022, following a turbulent path last year that saw its value rapidly decline. Will Bitcoin explode in 2022?","content":null,"pubDate":"2022-01-17 08:26:00","full_description":null,"image_url":null,"source_id":"express"},"2":{"title":"GemUni Disrupts Crypto Gaming With the Decentralized NFTs Gaming Platform for Play to Earn","link":"https:\/\/news.bitcoin.com\/gemuni-disrupts-crypto-gaming-with-the-decentralized-nfts-gaming-platform-for-play-to-earn\/","keywords":["Press release","GemUni"],"creator":["Bitcoin.com Media"],"video_url":null,"description":"PRESS RELEASE. GemUni, a Decentralized NFTs Gaming Platform for Play To Earn, has announced that its upcoming Initial DEX Offering (IDO) will be conducted on three launchpads GameFi, Red Kite, and KrystalGO on January 19th. GemUni is building a Decentralized NFTs Gaming Platform for everyone around the world to engage in Fun, Easy, and Play […]","content":"PRESS RELEASE. GemUni, a Decentralized NFTs Gaming Platform for Play To Earn, has announced that its upcoming Initial DEX Offering (IDO) will be conducted on three launchpads GameFi, Red Kite, and KrystalGO on January 19th. GemUni is building a Decentralized NFTs Gaming Platform for everyone around the world to engage in Fun, Easy, and Play to Earn NFT Casual Games and Signature Games. Users can enjoy fun games while monetizing their experiences with gaming platform rewards and GENI Pass NFTs transactions. A Great Head Start Since its announcement, GemUni has been through three months full of activities and milestones. Last December, the Grand Opening INO event, featuring guests from prominent gaming and blockchain organizations, marked the first time the GENI Pass NFTs were offered on multiple NFT marketplaces. GemUni’s GENI Pass NFTs were highly sought after by crypto and gaming enthusiasts, with thousands of GENI Pass NFTs being sold. Such a good starting point prompted GemUni to announce its Beta Test and Christmas Mini Challenges. The Beta Test has been a success, attracting players to participate in multiple challenges and earn the project token. Impressive Partner Portfolio and promising Roadmap for 2022 A few days before its IDO, GemUni continues to reach another milestone. In its private fundraising round, GemUni raised $2 million from investors. At this point, the project a boasting a portfolio of 30+ private investors and partners, including well-known venture capitalists such as Kyber Ventures, Shima Capital, ZBS Capital (CryptoDiffer), Kyros Ventures (Coin68), Gain Associates, ZipMex, and HG Ventures, among many others. Earlier this January, GemUni announced its promising roadmap for 2022. Besides the Casual Gaming Platform with 500+ games to be released in Q1, the project also announced its Signature Gaming Platform featuring upcoming games like The Olympus, Hero Infinities, CyberRace, Moon 2050, and ZodiBoom. An NFTs marketplace is also going live to support players’ NFT trading activities. Finally, further features like the GemUni Launchpad for IGOs, INOs; DAO Treasury, Side Chain will be released in Q2. With such an ambitious plan for 2022, GemUni is looking forward to partnering with game studios, Global Ambassadors, and artists to create a first class Decentralized NFTs Gaming Platform. IDO on GameFi, Red Kite, and KrystalGO on Jan 19, 2022 On January 19, GemUni is conducting its Initial DEX Offering across three launchpads GameFi, Red Kite, and KrystalGO. With a public price of $0.2 per token, GemUni implied the project valuation is $20 million at IDO. GemUni boasts an impressive leadership team, which includes CEO & Founder Cassie Nguyen – Champion of Startup World Cup 2019 in Silicon Valley. The project’s advisory board is led by Mr. Peter Vesterbacka – Former Mighty Eagle of Rovio Entertainment (Angry Birds games). GemUni CEO & Founder Cassie Nguyen says that her team is working day and night to bridge the gap between gaming and the new Play-to-Earn model to create an ecosystem for 3.2 billion gamers and studios around the world. “Never before have we seen the hype around this combination between gaming and the crypto economy,” she stated “We are proud to be the first Play-to-Earn platform for everyone’s favorite gaming experience. Now, everyone can enjoy fun & easy games in their own time, while earning real-world value.” GemUni aspires to become the “Decentralized Steam” for NFT Games Play to Earn – an ultimate destination of extraordinary GameFi experiences. Follow GemUni to get updates about the project’s January 19 IDO on GameFi, Red Kite, and KrystalGO. Follow GemUni: Website: https:\/\/www.gemuni.io Twitter: https:\/\/twitter.com\/gemuniofficial Telegram community: https:\/\/t.me\/GemUnicommunity Discord: https:\/\/discord.gg\/PnX6qgFvMW Tiktok: https:\/\/www.tiktok.com\/@gemuniofficial Youtube: https:\/\/www.youtube.com\/c\/GemUniOfficial Media contact: Email: growth@gemuni.io   This is a press release. Readers should do their own due diligence before taking any actions related to the promoted company or any of its affiliates or services. Bitcoin.com is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in the press release.","pubDate":"2022-01-17 06:00:47","full_description":"GemUni Disrupts Crypto Gaming With the Decentralized NFTs Gaming Platform for Play to Earn press release PRESS RELEASE. GemUni , a Decentralized NFTs Gaming Platform for Play To Earn, has announced that its upcoming Initial DEX Offering (IDO) will be conducted on three launchpads GameFi, Red Kite, and KrystalGO on January 19th. GemUni is building a Decentralized NFTs Gaming Platform for everyone around the world to engage in Fun, Easy, and Play to Earn NFT Casual Games and Signature Games. Users can enjoy fun games while monetizing their experiences with gaming platform rewards and GENI Pass NFTs transactions. A Great Head Start Since its announcement, GemUni has been through three months full of activities and milestones. Last December, the Grand Opening INO event, featuring guests from prominent gaming and blockchain organizations, marked the first time the GENI Pass NFTs were offered on multiple NFT marketplaces. GemUni’s GENI Pass NFTs were highly sought after by crypto and gaming enthusiasts, with thousands of GENI Pass NFTs being sold. Such a good starting point prompted GemUni to announce its Beta Test and Christmas Mini Challenges. The Beta Test has been a success, attracting players to participate in multiple challenges and earn the project token. Impressive Partner Portfolio and promising Roadmap for 2022 A few days before its IDO, GemUni continues to reach another milestone. In its private fundraising round, GemUni raised $2 million from investors. At this point, the project a boasting a portfolio of 30+ private investors and partners, including well-known venture capitalists such as Kyber Ventures, Shima Capital, ZBS Capital (CryptoDiffer), Kyros Ventures (Coin68), Gain Associates, ZipMex, and HG Ventures, among many others. Earlier this January, GemUni announced its promising roadmap for 2022. Besides the Casual Gaming Platform with 500+ games to be released in Q1, the project also announced its Signature Gaming Platform featuring upcoming games like The Olympus, Hero Infinities, CyberRace, Moon 2050, and ZodiBoom. An NFTs marketplace is also going live to support players’ NFT trading activities. Finally, further features like the GemUni Launchpad for IGOs, INOs; DAO Treasury, Side Chain will be released in Q2. With such an ambitious plan for 2022, GemUni is looking forward to partnering with game studios, Global Ambassadors, and artists to create a first class Decentralized NFTs Gaming Platform. IDO on GameFi, Red Kite, and KrystalGO on Jan 19, 2022 On January 19, GemUni is conducting its Initial DEX Offering across three launchpads GameFi , Red Kite , and KrystalGO . With a public price of $0.2 per token, GemUni implied the project valuation is $20 million at IDO. GemUni boasts an impressive leadership team, which includes CEO & Founder Cassie Nguyen – Champion of Startup World Cup 2019 in Silicon Valley. The project’s advisory board is led by Mr. Peter Vesterbacka – Former Mighty Eagle of Rovio Entertainment (Angry Birds games). GemUni CEO & Founder Cassie Nguyen says that her team is working day and night to bridge the gap between gaming and the new Play-to-Earn model to create an ecosystem for 3.2 billion gamers and studios around the world. “Never before have we seen the hype around this combination between gaming and the crypto economy,” she stated “We are proud to be the first Play-to-Earn platform for everyone’s favorite gaming experience. Now, everyone can enjoy fun & easy games in their own time, while earning real-world value.” GemUni aspires to become the “Decentralized Steam” for NFT Games Play to Earn – an ultimate destination of extraordinary GameFi experiences. Follow GemUni to get updates about the project’s January 19 IDO on GameFi, Red Kite, and KrystalGO. Follow GemUni: Website: https:\/\/www.gemuni.io Twitter: https:\/\/twitter.com\/gemuniofficial Telegram community: https:\/\/t.me\/GemUnicommunity Discord: https:\/\/discord.gg\/PnX6qgFvMW Tiktok: https:\/\/www.tiktok.com\/@gemuniofficial Youtube: https:\/\/www.youtube.com\/c\/GemUniOfficial Media contact: Email: growth@gemuni.io Tags in this story GemUni This is a press release. Readers should do their own due diligence before taking any actions related to the promoted company or any of its affiliates or services. Bitcoin.com is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in the press release. Bitcoin.com Media Bitcoin.com is the premier source for everything crypto-related. Contact ads@bitcoin.com to talk about press releases, sponsored posts, podcasts and other options. Fidelity Expects More Countries to Acquire Bitcoin Citing 'Very High Stakes Game Theory' FEATURED | 2 hours ago Boxing Legend Mike Tyson Says He's 'All in' on Solana Crypto — Asks Fans How High SOL Will Go ALTCOINS | 4 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Fidelity Expects More Countries to Acquire Bitcoin Citing ‘Very High Stakes Game Theory’ More Popular News In Case You Missed It Revolut Launches Banking Services in Spain Featuring Deposit Insurance Revolut, a leading fintech platform and neobank, has received a special banking license to operate in Spain. User deposits are now insured up to €100K, with the coverage being provided by Deposit and Investment Insurance, a Lithuanian state company. The ... read more. Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption British Lawmakers Say a CBDC Is Likely to Hurt Financial Stability — Digital Pound Benefits Overstated","image_url":null,"source_id":"bitcoin"},"3":{"title":"Crypto Charts See Green With Altcoins Despite Bitcoin's Price Drop","link":"https:\/\/gadgets.ndtv.com\/cryptocurrency\/news\/bitcoin-ether-btc-eth-crypto-market-price-today-dogecoin-shiba-inu-2712095","keywords":null,"creator":null,"video_url":null,"description":"Along with Bitcoin and Ether, Dogecoin and Shiba Inu also tumbled into dips. Several altcoins however, managed to maintain the green quotient on crypto price charts. The gainers include Tether,...","content":null,"pubDate":"2022-01-17 05:30:58","full_description":"Bitcoin opened with losses on Monday, January 17, stepping into the third week of 2022. With a dip of 0.57 percent, each token of Bitcoin is trading at $46,214 (roughly Rs. 34.2 lakh) on Indian exchange CoinSwitch Kuber. On international exchanges as well, Bitcoin has suffered similarly marginal price loss. The world's oldest cryptocurrency is trading at around $42,500 (roughly Rs. 31.6 lakh) on global exchanges such as CoinMarketCap and Binance. Along with Bitcoin's failure to gain, Ether has also registered losses. Ether is trading at $3,532 (roughly Rs. 2.62 lakh) per token. According to Gadgets 360's crypto price chart , Ether incurred a loss of 1.40 percent and dropped in value from its previously closing price of $3,582 (roughly Rs. 2.65 lakh). Ripple , Polkadot , Dogecoin , and Shiba Inu among a bunch of other popular altcoins also witnessed price lows, following Bitcoin and Ether. The market momentum has slowed down again today after it had seemingly picked pace earlier last week following US' inflation hiking to a 39-year high of seven percent. On January 13, Bitcoin was trading at $43,598 (roughly Rs. 32.2 lakh) on international exchanges. As per industry insiders, the rising popularity of altcoins among investors could pose a challenge to Bitcoin's supremacy. As Bitcoin's prominence begins to waver, BitPay saw a 27 percent drop in merchants processing Bitcoin payments in 2021, and a rise in transactions in stablecoins, Ether and Dogecoin,” the research team of CoinDCX told Gadgets 360. “With altcoins gaining ground amongst retail investors, we may see other digital assets challenging Bitcoin's pole position and place as a safe haven asset in 2022.” Meanwhile, a bunch of cryptocurrencies did manage to register gains despite the mega ones being hit by losses. Tether , Cardano , USD Coin , Polygon , Chainlink , Uniswap and Litecoin climbed up the price ladder with small but significant gains. The predictions of billionaire business tycoons such as Elon Musk and Mark Cuban spell out a bright future for the crypto sector in the times to come. While Musk has opened payments for Tesla merchandise in DOGE, Cuban recently called Ether the closest crypto asset we have to the existing fiat currencies. The maturing crypto sector is also set to see lesser criminals trying to misuse cryptocurrencies in the near future, a report by research firm Chainalysis said. The study claims that the criminal usage of cryptocurrencies will drop around the world, as more governments learn to take advantage of the uncensored transparency that the blockchain technology offers. Cryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.","image_url":"https:\/\/i.gadgets360cdn.com\/large\/cryptocurrency_bitcoin_ethereum_cover_markets_unsplash_small_1641448617205.jpg","source_id":"ndtv"},"4":{"title":"For Crypto Payments, Use Of Digital Tokens Other Than Bitcoin Rising","link":"https:\/\/www.ndtv.com\/business\/for-crypto-payments-use-of-digital-tokens-other-than-bitcoin-rising-2712035","keywords":null,"creator":null,"video_url":null,"description":"Consumers and businesses are increasingly starting to use digital tokens other than Bitcoin for purchases, according to BitPay Inc., one of the biggest crypto payments processors in the world.","content":null,"pubDate":"2022-01-17 04:41:46","full_description":"BitPay was founded in 2011, when few companies accepted digital coins. Consumers and businesses are increasingly starting to use digital tokens other than Bitcoin for purchases, according to BitPay Inc., one of the biggest crypto payments processors in the world. Last year, Bitcoin's use at merchants that use BitPay dropped to about 65% of processed payments, down from 92% in 2020, the company told Bloomberg. Ether purchases accounted for 15% of the total, stablecoins were 13% and new coins added to BitPay in 2021 -- Dogecoin, Shiba Inu and Litecoin -- accounted for 3%. The alternative coins' use surged partly as more businesses have begun using stablecoins for cross-border payments. Consumers also tend to move to stablecoins -- whose value is supposed to stay steady -- when crypto prices drop, and they've been falling since early November. Coins like Doge also made a splash last year, thanks to fans like Tesla Inc. Chief Executive Elon Musk, who on Friday said the token can be used to buy the company's merchandise. What crypto do you want us to support next? Get your vote in! Take the poll: https:\/\/t.co\/njdu90LmSH #crypto #cryptocurrecy pic.twitter.com\/CmbwgTVU7Y With Bitcoin's price rising 60% last year, despite the fourth-quarter volatility, many investors may also have chosen to hold onto the world's biggest cryptocurrency instead of spending it. Many remember Bitcoin's first commercial transaction, in which a programmer spent Bitcoins now worth billions on two pizza pies. When they did spend their crypto, many bought luxury good like jewelry and watches, cars, boats -- and even (cover your ears) gold, which Bitcoin -- touted as digital gold -- is supposed to replace, according to BitPay. The Atlanta-based private company's transaction volumes related to luxury goods surged 31% last year from 9% in 2020, said Chief Executive Officer Stephen Pair. The company's overall 2021 payment volumes rose 57% year over year. Buying a new car in 2022? Here's how to buy it with #crypto : https:\/\/t.co\/fctI8V7KzW BitPay was founded in 2011, when few companies accepted digital coins. Today it processes an average of about 66,000 transactions per month. That's a tiny fraction of, say, Visa's volume: The credit-card network processed 206 billion transactions in the year ended June 30, 2021. BitPay, with its $1 billion in annual transaction volume and 80 employees, helps companies ranging from Microsoft Corp. to AT&T Inc. accept cryptocurrency payments. It can also serve as an industry barometer. At least so far, the recent downturn hasn't affected crypto investors' spending habits as much as in the crypto winter of 2018, Pair said. While luxury spending has been hit, the overall declines have been much smaller, he said -- perhaps a sign of confidence that the current downturn could be short-lived, or that crypto has a much broader base of users. “Our business ebbs and flows to some degree with the price, when the price goes down, people tend to spend less,” Pair said. “We have not experienced as much of a decline in volume with this recent pullback. It's probably just a reflection of more and more companies that need to use this as a tool to conduct payments.” More merchants are accepting crypto payments now. Last year BitPay began working with VeriFone to accept digital coins at its terminals at various stores. For its part, BitPay is showing signs of confidence as well. It just appointed Jim Lester its first-ever chief operating officer to expand the business. Lester previously headed startup ThingTech, and was also senior vice president of product management, strategy and marketing at Fiserv Inc.'s electronic billing and payments division. A growing list of companies including PayPal Holdings Inc. are stepping into crypto payments as well, showing the payments market's growth potential. “PayPal getting into this space has been great for our business, because it causes companies to start asking the question of should they accept crypto payments,” Pair said. BitPay had close to 50% revenue growth last year, he said. The company has raised $72 million from the likes of Index Ventures and Founders Fund. It doesn't expect to go public, raise another funding round or sell in the near term, though it has talked about an IPO internally, Pair said. “We really like where we are strategically,” Pair said. “This space is still very young. A lot of it has to do with what we think about timing. In the next couple of years we are likely to see very substantial growth.”","image_url":"https:\/\/c.ndtvimg.com\/2022-01\/diqhtj8_240_120x90_17_January_22.jpg","source_id":"ndtv"},"5":{"title":"Fidelity Expects More Countries to Acquire Bitcoin Citing ‘Very High Stakes Game Theory’","link":"https:\/\/news.bitcoin.com\/fidelity-countries-acquire-bitcoin-very-high-stakes-game-theory\/","keywords":["Featured","Bitcoin adoption","central bank adopts bitcoin","countries buying bitcoin","cryptocurrency adoption","El Salvador","fidelity","Fidelity Digital Assets","Fidelity Investments","Fidelity predictions","sovereign nation states","Treasury"],"creator":["Kevin Helms"],"video_url":null,"description":"Fidelity expects more sovereign nation states, or even a central bank, to acquire bitcoin this year. “There is very high stakes game theory at play here, whereby if bitcoin adoption increases, the countries that secure some bitcoin today will be better off competitively than their peers,” the firm explained. Fidelity’s Crypto Predictions Fidelity Digital Assets, […]","content":"Fidelity expects more sovereign nation states, or even a central bank, to acquire bitcoin this year. “There is very high stakes game theory at play here, whereby if bitcoin adoption increases, the countries that secure some bitcoin today will be better off competitively than their peers,” the firm explained. Fidelity’s Crypto Predictions Fidelity Digital Assets, a subsidiary of Fidelity Investments, published a report on crypto trends and their potential future impact earlier this month. Among the trends discussed in the report is the adoption of cryptocurrency by sovereign nations. “This past year saw some major moves by world governments with regards to digital assets,” Fidelity described. The report discusses countries like China that have banned cryptocurrency and countries like El Salvador that took the opposite approach and made BTC legal tender. “We think the two developments observed this year couldn’t be more opposed. Time will certainly tell which path is more successful,” the report authors opined. However, they noted: An outright ban will be difficult to achieve at best, and if successful, will lead to a significant loss of wealth and opportunity. The authors continued, “We also think there is very high stakes game theory at play here, whereby if bitcoin adoption increases, the countries that secure some bitcoin today will be better off competitively than their peers,” elaborating: Therefore, even if other countries do not believe in the investment thesis or adoption of bitcoin, they will be forced to acquire some as a form of insurance. Fidelity clarified, “In other words, a small cost can be paid today as a hedge compared to a potentially much larger cost years in the future.” The investment firm concluded: We therefore wouldn’t be surprised to see other sovereign nation states acquire bitcoin in 2022 and perhaps even see a central bank make an acquisition. El Salvador’s president, Nayib Bukele, also predicted last week that two more sovereign nations will adopt bitcoin as legal tender this year. The CEO of Devere Group, Nigel Green, however, is more optimistic. He expects three more countries to adopt BTC as legal tender this year. Do you agree with Fidelity? Let us know in the comments section below.","pubDate":"2022-01-17 04:30:19","full_description":"Fidelity Expects More Countries to Acquire Bitcoin Citing 'Very High Stakes Game Theory' Fidelity expects more sovereign nation states, or even a central bank, to acquire bitcoin this year. “There is very high stakes game theory at play here, whereby if bitcoin adoption increases, the countries that secure some bitcoin today will be better off competitively than their peers,” the firm explained. Fidelity’s Crypto Predictions Fidelity Digital Assets, a subsidiary of Fidelity Investments, published a report on crypto trends and their potential future impact earlier this month. Among the trends discussed in the report is the adoption of cryptocurrency by sovereign nations. “This past year saw some major moves by world governments with regards to digital assets,” Fidelity described. The report discusses countries like China that have banned cryptocurrency and countries like El Salvador that took the opposite approach and made BTC legal tender. “We think the two developments observed this year couldn’t be more opposed. Time will certainly tell which path is more successful,” the report authors opined. However, they noted: An outright ban will be difficult to achieve at best, and if successful, will lead to a significant loss of wealth and opportunity. The authors continued, “We also think there is very high stakes game theory at play here, whereby if bitcoin adoption increases, the countries that secure some bitcoin today will be better off competitively than their peers,” elaborating: Therefore, even if other countries do not believe in the investment thesis or adoption of bitcoin, they will be forced to acquire some as a form of insurance. Fidelity clarified, “In other words, a small cost can be paid today as a hedge compared to a potentially much larger cost years in the future.” The investment firm concluded: We therefore wouldn’t be surprised to see other sovereign nation states acquire bitcoin in 2022 and perhaps even see a central bank make an acquisition. El Salvador’s president, Nayib Bukele, also predicted last week that two more sovereign nations will adopt bitcoin as legal tender this year. The CEO of Devere Group, Nigel Green, however, is more optimistic. He expects three more countries to adopt BTC as legal tender this year. Tags in this story Bitcoin adoption , central bank adopts bitcoin , countries buying bitcoin , cryptocurrency adoption , El Salvador , fidelity , Fidelity Digital Assets , Fidelity Investments , Fidelity predictions , sovereign nation states , Treasury Do you agree with Fidelity? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. JPMorgan Client Survey: Majority Expect Bitcoin Price to Reach $60K or More This Year FEATURED | 2 days ago Visa: One in Four Businesses Surveyed Plan to Accept Cryptocurrency Payments This Year FEATURED | 2 days ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Boxing Legend Mike Tyson Says He’s ‘All in’ on Solana Crypto — Asks Fans How High SOL Will Go Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Near Foundation Raises $150 Million to Bolster Web3 Adoption On Thursday, the Near Foundation announced the project has raised $150 million from strategic investors such as Three-Arrows Capital, a16z, Mechanism Capital, Dragonfly Capital, and Circle Ventures. Following the announcement, the Near protocol’s native crypto asset jumped more than 7% ... read more. Russia’s Tinkoff Bank Enters Crypto Space Through Swiss Company Acquisition Revolut Launches Banking Services in Spain Featuring Deposit Insurance Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption","image_url":null,"source_id":"bitcoin"},"6":{"title":"Top cryptocurrency news on January 17: The biggest moves in Bitcoin, NFTs and more","link":"https:\/\/www.moneycontrol.com\/news\/business\/top-cryptocurrency-newsjanuary-17-the-biggest-movesbitcoin-nftsmore_15923381.html","keywords":null,"creator":null,"video_url":null,"description":"A daily round-up of the most interesting articles on cryptocurrencies like Bitcoin, Ethereum and Tether to help jump-start the day","content":null,"pubDate":"2022-01-17 04:17:49","full_description":null,"image_url":null,"source_id":"moneycontrol"},"7":{"title":"Cryptocurrency Prices Today: Bitcoin, Ethereum down","link":"https:\/\/www.moneycontrol.com\/news\/business\/cryptocurrency-prices-today-bitcoin-ethereum-down_15923301.html","keywords":null,"creator":null,"video_url":null,"description":"Bitcoin#39;s price is currently above Rs 34 lakh, and its dominance over other cryptocurrencies over the past 24 hours is 39.35 percent","content":null,"pubDate":"2022-01-17 04:08:29","full_description":null,"image_url":null,"source_id":"moneycontrol"},"8":{"title":"Cryptocurrency Prices Today: Bitcoin, Ethereum down","link":"https:\/\/www.moneycontrol.com\/news\/business\/cryptocurrency-prices-today-bitcoin-ethereum-down_15923321.html","keywords":null,"creator":null,"video_url":null,"description":"Bitcoin#39;s price is currently above Rs 34 lakh, and its dominance over other cryptocurrencies over the past 24 hours is 39.35 percent","content":null,"pubDate":"2022-01-17 04:08:29","full_description":null,"image_url":null,"source_id":"moneycontrol"},"9":{"title":"Share Market Live: Sensex, Nifty Open Higher; HCL Technologies Sheds 6%","link":"https:\/\/www.bloombergquint.com\/markets\/share-market-live-sgx-nifty-hints-at-losses-hcl-tech-hdfc-bank-ultratech-maruti-suzuki-in-focus","keywords":["Maruti Suzuki India Ltd.","HDFC Bank Ltd.","Hero MotoCorp Ltd.","HCL Technologies Ltd.","Ultratech Cement Ltd.","NIFTY 50","BUSINESS","MARKETS","bqfree"],"creator":["Bharath Rajeswaran"],"video_url":null,"description":"Catch all live updates on share prices, index moves, corporate announcements and more from the Sensex and Nifty, today.","content":"Opening Bell: Sensex, Nifty Open Higher; HCL Technologies Sheds 6%India's stock benchmarks opened higher, aided by gains in energy, auto and oil and gas stocks were offset by losses in consumer durables stocks.VA Tech Wabag Wins $100 Million Order In Dubai From Green EPCVA Tech Wabag Ltd. bagged an order worth $100 million towards engineering and procurement activities related to desalination project in city of Dubai in UAE.The order was secured from Green EPC, a subsidiary of Ultico FZC, the water technology firm said in an exchange filingSource: Exchange FilingGovernment Bonds Could Extend Losses After Weak AuctionIndian government bonds may slip further after a weak auction on Friday. Higher U.S. yields and crude oil prices could also hurt sentiment.10-year yields rose 2bps to 6.58% on FridayUSD\/INR rose 0.4% to 74.1537 on FridayGlobal funds sold net Rs 1,600 crore of India stocks Friday: NSE.They bought Rs 239 crore of sovereign bonds under limits available to foreign investors, and added Rs 37 crore of corporate debt.State-run banks sold Rs 145 crore of sovereign bonds on Jan. 14: CCIL data. Foreign banks bought Rs 1,780 crore of bonds.Source: BloombergTrade Setup Glenmark Pharma Gets Tentative U.S. FDA Nod For Regadenoson InjectionGlenmark Pharmaceuticals has received tentative nod by U.S. FDA for an injection given to prepare patients to test for coronary artery disease.Regadenoson injection, 0.4 mg\/5 mL, single-dose pre-filled syringe is a generic version of Lexiscan injection, which had an annual sales of $659.9 million, according to IQVIA.Source: Exchange filingRattanIndia Unit Cocoblu Ties Up With Amazon Seller ServicesRattanIndia Enterprises Ltd.'s subsidiary Cocoblu Retail Ltd. entered into an agreement with Amazon Seller Services Pvt. Ltd. to be an online seller, the company said in an exchange filing.Cocoblu is ready to commence operations on Amazon India marketplace, the company added.Source: Exchange filingDCB Bank Approves Appointment Of Rupa Devi Singh As Non-Executive (Part-Time) ChairmanDCB Bank has approved the appointment Rupa Devi Singh as Non-Executive (Part-Time) Chairman. The lenders awaits the approval from regulatory authorities and shareholders of the bank before the appointment becomes effective.Source: Exchange FilingTata Motors Plans To Make 50,000 EVs In FY23: Economic TimesTata Motors Ltd. plans to manufacture 50,000 EVs in FY2023 and has sounded out vendors, the Economic Times reported, quoting people aware of the matter.The company intends to raise production to 1.25-1.5 lakh units in the following two fiscals, the report said.EV business could generate Rs 5,000 crore for Tata Motors in FY23 if it achieves the target, according to the report.Source: BloombergAnalyst Actions: NTPC, HCL TechnologiesNTPC: Batlivala & Karani Securities reinstated coverage on the stock with a 'buy'.HCL Technologies: Upgraded to 'buy' from 'hold' by IDBI Capital Market; price target set at Rs 1,545 apiece.HCL Technologies: Upgraded to 'add' from 'reduce' by Spark Capital Advisors; price target set at Rs 1,410 apiece.Source: BloombergIn Focus: Units Of Unilever, GSK Amid Potential Consumer Deal UpdatesUnilever Plc has held talks with banks about additional financing for a potential sweetened offer for GlaxoSmithKline's consumer products division, Bloomberg reported citing people familiar with the matter. That will bring the their domestic units in focus as Indian markets reopen on Monday.GSK had rejected an earlier offer from Unilever for its consumer healthcare unit in 2021 that valued the business at $68 billion.In Focus: Hindustan Unilever, GlaxoSmithKline Pharmaceuticals.Source: BloombergSGX Nifty Hints At Opening Losses; HCL Tech, HDFC Bank, Ultratech, Maruti Suzuki In FocusAsian stocks were mixed on Monday as traders weighed policy easing by China’s central bank ahead of data expected to underline the slowdown in the nation’s economy.Shares rose in Japan and Australia but slipped in South Korea. S&P 500 and Nasdaq 100 futures were volatile. U.S. stock and bond markets will be shut Monday for a holiday.The Singapore-traded SGX Nifty, an early indicator of India's Nifty 50 Index's performance, fell 0.36% to 18,208.50 as of 7:30 a.m.Elsewhere, oil extended its rally. Among cryptocurrencies, Bitcoin was around $43,000.Also Read: All You Need To Know Going Into Trade On January 17Earnings: Post Market HoursHDFC Bank Q3FY22 (Standalone)Net Profit at Rs 10,342 crore Vs Rs 8,758 crore (YoY) (BBG estimate: Rs 10,136 crore)NII at Rs 18,443 crore Vs Rs 16,318 crore (YoY)GNPA at 1.26% vs 1.35% (QoQ)NNPA at 0.37% vs 0.4% (QoQ)HCL Technologies Q3FY22 (Consolidated, QoQ)Revenue up 8.11% at Rs 22,331 crore Vs Rs 20,655crore (BBG estimate: Rs 21,631 crore)Net profit up 5.62% at Rs 3,442 crore Vs Rs 3,259 crore (BBG estimate: Rs 3,374 crore)Ebit up 7.94% at Rs 4,257 crore Vs Rs 3,944 crore (BBG estimate: Rs 4,207.1 crore)Margin remains flat at 19.1% (BBG estimate: 19.44%)Declared interim dividend of Rs 10 per share.Stocks To WatchHCL Technologies: The company has signed a definitive agreement to acquire Starschema, a Hungarian data engineering services company, for $42.5 million. The acquisition is expected to be completed by March 2022.Hero MotoCorp: To invest up to Rs 420 crore more in Ather Energy. Hero MotoCorp’s shareholding will increase from current 34.8% in Ather after the investment. The investment will be made in one or more tranches by April 30. The company’s exact shareholding will be determined upon completion of Ather’s capital raising round.Maruti Suzuki: Raises prices by average of 1.7% from Saturday.Indian Oil Corporation: Secured nine out of 15 high potential geographical areas in the latest round of CGD auction. The company plans to invest Rs 7,000 crore in the new CGD projects, over and above the Rs 20,000 crore investments that were already planned for the vertical.NBCC India: December total business at Rs 592 crorePB Fintech: To buy a 100% stake in Visit Internet for Rs 22.41 crore.RBL Bank: Hires search firm, external expert to hunt for CEO.Earnings: UltraTech Cement, Angel One, Sonata Software, Tata Steel Long Products, Tatva Chintan Pharma Chemicals, HFCL, Maharashtra Scooters, Bhansali Engineering Polymers, Hathway Cable and Datacom, Moschip Technologies.. Read more on Markets by BloombergQuint.","pubDate":"2022-01-17 02:46:58","full_description":null,"image_url":null,"source_id":"bloombergquint"}},"nextPage":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1}}