{"status":{"0":"success","1":"success","2":"success"},"totalResults":{"0":3,"1":3,"2":3},"results":{"0":{"title":"2 Top Cryptocurrencies to Buy and Hold Right Now","link":"https:\/\/www.fool.com\/investing\/2022\/01\/16\/2-top-cryptocurrencies-to-buy-and-hold-right-now\/?source=iedfolrf0000001","keywords":null,"creator":["newsfeedback@fool.com (Trevor Jennewine)"],"video_url":null,"description":"The latest downturn in the crypto market creates an opportunity for investors.","content":"Over the past decade, cryptocurrency has effectively conjured a brand new economy out of thin air. Understandably, it has become a rather controversial asset class, with smart people arguing for and against it. Even so, no one can deny the wealth this emerging asset class has created. In the last year alone, the crypto market has skyrocketed 109% to $2.1 trillion.However, enthusiasm for more speculative assets has waned in recent months as high inflation and the prospect of rising interest rates have driven investors to look for safer alternatives. To that end, despite tremendous gains in the past year, the crypto market currently sits 29% below its all-time high.Here's the silver lining: Every past downturn has proved to be a buying opportunity, and there are dozens of cryptocurrencies worth owning. For instance, Cardano (CRYPTO: ADA) and Fantom (CRYPTO: FTM) look like smart-long term investments. Here's why.Continue reading","pubDate":"2022-01-16 17:11:22","full_description":"Over the past decade, cryptocurrency has effectively conjured a brand new economy out of thin air. Understandably, it has become a rather controversial asset class, with smart people arguing for and against it. Even so, no one can deny the wealth this emerging asset class has created. In the last year alone, the crypto market has skyrocketed 109% to $2.1 trillion. However, enthusiasm for more speculative assets has waned in recent months as high inflation and the prospect of rising interest rates have driven investors to look for safer alternatives. To that end, despite tremendous gains in the past year, the crypto market currently sits 29% below its all-time high. Here's the silver lining: Every past downturn has proved to be a buying opportunity , and there are dozens of cryptocurrencies worth owning. For instance, Cardano ( CRYPTO:ADA ) and Fantom ( CRYPTO:FTM ) look like smart-long term investments. Here's why. Image source: Getty Images. 1. Cardano Cardano is a programmable blockchain powered by the ADA token, which currently ranks as the seventh-most-valuable cryptocurrency. In 2015, the project was started by Charles Hoskinson shortly after he left Ethereum ( CRYPTO:ETH ) . Cardano aims to be a better version of Ethereum, and it differentiates itself in three ways. First, the developer team has taken an academic approach to building the blockchain. Rather than rushing to complete the platform, the Cardano project was divided into five phases, focusing on the foundation, decentralization, smart contracts, scalability, and governance. Moreover, the team frequently submits research papers for academic peer review, taking an evidence-based approach to development. Second, Cardano is secured by an eco-friendly proof of stake consensus protocol known as Ouroboros. In that system, validators stake tokens to ensure their honesty, as that stake will be forfeited in the event of fraud or an attempted attack. Unlike proof of work consensus, where miners compete based on computing power, Ouroboros randomly selects validators to add new blocks to the chain, thereby securing the network with reduced energy consumption. Third, the upcoming fourth phase of development -- expected to begin in late 2022 or 2023 -- will feature Ouroboros Hydra, a scaling solution that will add multiple side chains to the core blockchain. In other words, Hydra will add additional blockchains to the platform, dividing network traffic more efficiently. In turn, Hydra will boost throughput from its current 250 transactions per second (TPS) to a theoretical 1 million TPS. That would make Cardano one of the fastest and most scalable blockchain platforms, and maybe even the top performer. So what's the investment thesis? Cardano has roots in peer-reviewed academic research. Its Ouroboros consensus protocol is energy efficient and highly scalable. As of Sept. 12, 2021, smart contracts are live on the blockchain, meaning an ecosystem of dApps and decentralized finance (DeFi) services should blossom in the near future. However, those products aren't free. Users pay transaction fees using the blockchain's native cryptocurrency. In other words, as dApps and DeFi products on Cardano become more popular, demand for ADA should rise, pushing its price higher. 2. Fantom Fantom brands itself as a high-throughput smart contracts platform for digital assets and dApps. The project aims to resolve two key limitations frequently found in other blockchains: a lack of scalability and a lack of interoperability. To do that, Fantom relies on a unique proof of stake consensus mechanism known as Lachesis, a protocol that allows validators on the network to calculate the time order of events independently. That means each node (computer) can achieve consensus without waiting for confirmation from every other node. In turn, that makes Fantom very fast. In fact, Fantom can handle thousands of transactions per second (TPS), and those transactions are finalized in about one second. For perspective, Ethereum -- the largest dApp and DeFi ecosystem by a wide margin -- can handle about 14 TPS and it takes six minutes for those transactions to reach finality (i.e. be incorporated into the blockchain). That means Fantom is far more scalable than Ethereum, which could help it take market share. Furthermore, Fantom is also compatible with Solidity, the programming language used to build smart contracts on Ethereum. That means developers can easily port their Ethereum-based dApps over to the Fantom blockchain, where performance is better and fees are lower. Not surprisingly, developers and investors have taken note, and Fantom actually ranks as the sixth-largest DeFi ecosystem, with over $7.1 billion invested on the platform. Going forward, as Fantom-powered dApps and DeFi products become more popular, rising demand for FTM tokens should drive its price higher. That's why this cryptocurrency looks like a smart long-term investment .","image_url":null,"source_id":"fool"},"1":{"title":"Vitalik Buterin Asks Twitter Followers Which Crypto They Prefer to Overtake Ethereum — Cardano, Tron Favorites","link":"https:\/\/news.bitcoin.com\/vitalik-buterin-crypto-twitter-currency-prefer-overtake-ethereum-cardano-tron\/","keywords":["Altcoins","Bitcoin","Cardano","crypto replace ethereum","crypto replacing ethereum","tron","Vitalik Buterin","Vitalik Buterin poll","Vitalik Buterin poll cryptocurrency poll"],"creator":["Kevin Helms"],"video_url":null,"description":"Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter asking his followers if 80% of all transactions and savings in the year 2035 are in one currency and it is not ether, which currency they would prefer it to be. He asked them to choose from a number of cryptocurrencies including bitcoin, […]","content":"Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter asking his followers if 80% of all transactions and savings in the year 2035 are in one currency and it is not ether, which currency they would prefer it to be. He asked them to choose from a number of cryptocurrencies including bitcoin, cardano, solana, tron, and Binance coin. Vitalik Buterin’s Cryptocurrency Twitter Polls Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter Thursday for the Ethereum community. “You wake up in 2035 and 80% of all transactions and savings in the world are in one currency that is not ETH. Which would you prefer it to be?” He wrote. In his first tweet, Buterin asked his followers to choose from BTC, USD, SOL, and ADA. The second tweet lets them choose from TRON, BNB, CNY, and NEO. After 24 hours, the first poll ended with 600,697 votes and the second with 358,743 votes. Cardano (ADA) tops the results of the first poll, followed by bitcoin (BTC) and solana (SOL). Tron (TRON) tops the results of the second poll, followed by Binance coin (BNB) and neo (NEO). Buterin’s first poll includes the top cryptocurrencies by market cap, excluding stablecoins. At the time of writing, bitcoin, the largest cryptocurrency, has a market cap of $821 billion based on data from Bitcoin.com Markets. Solana, the fifth-largest crypto, has a market cap of $47 billion while cardano, the seventh-largest coin, has a market cap of $42 billion. Buterin’s second poll includes the third-largest cryptocurrency, Binance coin, which has a market cap of $83 billion. Tron’s market cap is $7 billion whereas neo’s is less than $2 billion. While the Ethereum co-founder’s polls appear fun and have attracted many comments and likes on social media, people questioned Buterin’s motives for posting such polls, the choice of cryptocurrencies he included, whether votes were made by bots, and the likelihood that 80% of transactions will be in one currency. Bitcoin trader Tone Vays commented, “Is Vitalik looking for a new job?” The CEO of cryptocurrency exchange FTX, Sam Bankman-Fried, opined: These results are….. wild. Other cryptocurrencies that have been recommended by Vitalik’s Twitter followers in response to the polls include XRP, dogecoin (DOGE), shiba inu (SHIB), and polkadot (DOT). Meanwhile, several people pointed out that the outcome of Buterin’s polls only reflects the popularity of certain cryptocurrencies among his followers and Twitter users, emphasizing that they have no bearing on the popularity of a particular cryptocurrency in the real world. Bank of America, however, believes that Solana could take market share away from Ethereum. What do you think about Vitalik Buterin’s polls? Which cryptocurrency would you prefer? Let us know in the comments section below.","pubDate":"2022-01-16 02:30:23","full_description":"Vitalik Buterin Asks Twitter Followers Which Crypto They Prefer to Overtake Ethereum — Cardano, Tron Favorites Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter asking his followers if 80% of all transactions and savings in the year 2035 are in one currency and it is not ether, which currency they would prefer it to be. He asked them to choose from a number of cryptocurrencies including bitcoin, cardano, solana, tron, and Binance coin. Vitalik Buterin’s Cryptocurrency Twitter Polls Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter Thursday for the Ethereum community. “You wake up in 2035 and 80% of all transactions and savings in the world are in one currency that is not ETH . Which would you prefer it to be?” He wrote. In his first tweet, Buterin asked his followers to choose from BTC , USD, SOL, and ADA . The second tweet lets them choose from TRON, BNB , CNY, and NEO . After 24 hours, the first poll ended with 600,697 votes and the second with 358,743 votes. Cardano ( ADA ) tops the results of the first poll, followed by bitcoin ( BTC ) and solana (SOL). Tron (TRON) tops the results of the second poll, followed by Binance coin ( BNB ) and neo ( NEO ). Buterin’s first poll includes the top cryptocurrencies by market cap, excluding stablecoins. At the time of writing, bitcoin, the largest cryptocurrency, has a market cap of $821 billion based on data from Bitcoin.com Markets. Solana, the fifth-largest crypto, has a market cap of $47 billion while cardano, the seventh-largest coin, has a market cap of $42 billion. Top cryptocurrencies by market capitalization. Source: Bitcoin.com Markets. Buterin’s second poll includes the third-largest cryptocurrency, Binance coin, which has a market cap of $83 billion. Tron’s market cap is $7 billion whereas neo’s is less than $2 billion. While the Ethereum co-founder’s polls appear fun and have attracted many comments and likes on social media, people questioned Buterin’s motives for posting such polls, the choice of cryptocurrencies he included, whether votes were made by bots, and the likelihood that 80% of transactions will be in one currency. Bitcoin trader Tone Vays commented, “Is Vitalik looking for a new job?” The CEO of cryptocurrency exchange FTX, Sam Bankman-Fried, opined: These results are….. wild. Other cryptocurrencies that have been recommended by Vitalik’s Twitter followers in response to the polls include XRP , dogecoin (DOGE), shiba inu (SHIB), and polkadot (DOT). Meanwhile, several people pointed out that the outcome of Buterin’s polls only reflects the popularity of certain cryptocurrencies among his followers and Twitter users, emphasizing that they have no bearing on the popularity of a particular cryptocurrency in the real world. Bank of America, however, believes that Solana could take market share away from Ethereum. Tags in this story Bitcoin , Cardano , crypto replace ethereum , crypto replacing ethereum , tron , Vitalik Buterin , Vitalik Buterin poll , Vitalik Buterin poll cryptocurrency poll What do you think about Vitalik Buterin’s polls? Which cryptocurrency would you prefer? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. Bank of America Says Solana Could Take Market Share From Ethereum, Become the Visa of the Crypto Ecosystem ALTCOINS | 2 hours ago Stablecoin USDC's ERC20 Issuance Surpasses USDT's Total Supply on Ethereum ALTCOINS | 10 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Bank of America Says Solana Could Take Market Share From Ethereum, Become the Visa of the Crypto Ecosystem Show comments More Popular News In Case You Missed It Revolut Launches Banking Services in Spain Featuring Deposit Insurance Revolut, a leading fintech platform and neobank, has received a special banking license to operate in Spain. User deposits are now insured up to €100K, with the coverage being provided by Deposit and Investment Insurance, a Lithuanian state company. The ... read more. NYCB and Group of Banks Join to Launch USDF Stablecoin Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption","image_url":null,"source_id":"bitcoin"},"2":{"title":"Bitcoin, Ethereum, Cardano Continue Positive Push This Weekend","link":"https:\/\/www.fool.com\/investing\/2022\/01\/15\/bitcoin-ethereum-cardano-continue-positive-push-th\/?source=iedfolrf0000001","keywords":null,"creator":["newsfeedback@fool.com (Chris MacDonald)"],"video_url":null,"description":"Despite volatility, these three top tokens are moving in the right direction again.","content":"Top cryptocurrencies Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH), and Cardano (CRYPTO: ADA) each continued higher on Saturday. These tokens showed 24-hour gains of 2.5%, 4.0%, and 3.2%, respectively, as of 11:00am ET.Over the past seven days, each of these tokens remains in the green, between 3% and 5% higher. Of course, Bitcoin saw its worst start to the year since its inception, making this rebound week an important one for traders to watch.Image source: Getty Images.Continue reading","pubDate":"2022-01-15 17:58:48","full_description":"What happened Top cryptocurrencies Bitcoin ( CRYPTO:BTC ) , Ethereum ( CRYPTO:ETH ) , and Cardano ( CRYPTO:ADA ) each continued higher on Saturday. These tokens showed 24-hour gains of 2.5%, 4.0%, and 3.2%, respectively, as of 11:00am ET. Over the past seven days, each of these tokens remains in the green, between 3% and 5% higher. Of course, Bitcoin saw its worst start to the year since its inception, making this rebound week an important one for traders to watch. Image source: Getty Images. Cardano continues to gain ground, following this week's news that the Cardano Forest, a project run by the Cardano Foundation, hit a major milestone of planting 1 million trees. So what These moves among top tokens Bitcoin and Ethereum come as trading volumes settle down. According to recent reports, capital inflows into the crypto sector have waned to start the year. This has meant that expectations are that volatility could pick up, once buying or selling pressure returns to more normalized levels. The Ethereum Foundation keeps working towards the next step of the Ethereum 2.0 upgrade, which will move the system over to a proof-of-stake architecture while scaling up transaction speeds and lowering gas fees. Bitcoin is starting to look like a reliable alternative to gold and other traditional value stores. This week, investment bank Goldman Sachs ( NYSE:GS ) argued that the digital currency could be worth $100,000 per token over the next five years. For Cardano, a top proof-of-stake network aiming to become carbon-negative, it was certainly big news this week when the blockchain network announced that it had inspired 1 million trees to be planted. This Foundation is aiming at planting 1 billion trees in a bid to become the greenest blockchain network, and one devoted to helping solve the climate crisis. Given the negative publicity many top cryptocurrencies have received for energy consumption and carbon emissions, this is a big differentiating factor for Cardano. Now what The crypto market appears to be taking a breather, with lower trading volumes suggesting these top tokens may be increasingly viewed as longer-term investments, rather than speculative trading vehicles. For those taking the long view of the crypto sector, that's perhaps a good thing. However, indications are that should volumes pick up again, volatility could be on the rise. For those taking one side of the bet on any of these tokens over the near term, that's something to consider.","image_url":null,"source_id":"fool"}},"nextPage":{"0":null,"1":null,"2":null}}