{"status":{"0":"success","1":"success","2":"success","3":"success","4":"success","5":"success","6":"success","7":"success","8":"success","9":"success"},"totalResults":{"0":94,"1":94,"2":94,"3":94,"4":94,"5":94,"6":94,"7":94,"8":94,"9":94},"results":{"0":{"title":"Singapore Asks Crypto Firms Not to Market Services to Public","link":"https:\/\/au.finance.yahoo.com\/news\/singapore-tells-crypto-firms-not-073000618.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-17 10:07:47","image_url":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/Gc4HW9lXOtcQj_8xhGHXGg--~B\/aD0xMzM0O3c9MjAwMDthcHBpZD15dGFjaHlvbg--\/https:\/\/media.zenfs.com\/en\/bloomberg_technology_68\/031433cf9fe0816f8ba1583e1346bc3e","source_id":"yahoo"},"1":{"title":"Crypto ATM Market Size Worth $1.88 Billion By 2028 | CAGR: 59.2%: Grand View Research, Inc.","link":"https:\/\/www.prnewswire.com:443\/news-releases\/crypto-atm-market-size-worth-1-88-billion-by-2028--cagr-59-2-grand-view-research-inc-301461811.html","keywords":["Mining & Metals","Machine Tools, Metalworking and Metallurgy","Cryptocurrency","ICO","MCT","MNG"],"creator":null,"video_url":null,"description":"SAN FRANCISCO, Jan. 17, 2022 \/PRNewswire\/ -- The global crypto ATM market size is expected to reach USD 1.88 billion by 2028, expanding at a CAGR of 59.2% from 2022 to 2028, according to a new report by Grand View Research, Inc. The growth of the market can be attributed to the consistent...","content":null,"pubDate":"2022-01-17 10:05:00","full_description":null,"image_url":"https:\/\/mma.prnewswire.com\/media\/661327\/Grand_View_Research_Logo.jpg?p=publish","source_id":"cision"},"2":{"title":"Apple Will Reportedly Require Staff To Receive COVID-19 Booster Shots to Enter Stores and Offices","link":"https:\/\/hypebeast.com\/2022\/1\/apple-requiring-staff-to-receive-covid-19-booster-shot-reports","keywords":["Tech"],"creator":null,"video_url":null,"description":"Apple will supposedly require its staff to show proof of their COVID-19 booster shots in order to enter stores and offices.In an internal memo obtained by The Verge, Apple will implement this policy starting February 15. Employees will have four weeks to get their booster shots after they are deemed eligible, and unvaccinated staff — including those who have not received the vaccine and those who have not submitted their proof of vaccination — will be required to provide a negative COVID-19 antigen test before they are allowed to enter a retail store, partner store or the Apple office beginning January 24.“Due to waning efficacy of the primary series of COVID-19 vaccines and the emergence of highly transmissible variants such as Omicron, a booster shot is now part of staying up to date with your COVID-19 vaccination to protect against severe disease,” the memo read.The move from the tech giant arrived after it was reported that several companies like Nike and VF Corp, the parent company of Vans, Supreme, Timberland and The North Face, will begin firing its unvaccinated employees.Elsewhere in tech, take a look at this week's business and crypto roundup.Click here to view full gallery at HYPEBEAST","content":"Apple will supposedly require its staff to show proof of their COVID-19 booster shots in order to enter stores and offices.In an internal memo obtained by The Verge, Apple will implement this policy starting February 15. Employees will have four weeks to get their booster shots after they are deemed eligible, and unvaccinated staff — including those who have not received the vaccine and those who have not submitted their proof of vaccination — will be required to provide a negative COVID-19 antigen test before they are allowed to enter a retail store, partner store or the Apple office beginning January 24.“Due to waning efficacy of the primary series of COVID-19 vaccines and the emergence of highly transmissible variants such as Omicron, a booster shot is now part of staying up to date with your COVID-19 vaccination to protect against severe disease,” the memo read.The move from the tech giant arrived after it was reported that several companies like Nike and VF Corp, the parent company of Vans, Supreme, Timberland and The North Face, will begin firing its unvaccinated employees.Elsewhere in tech, take a look at this week's business and crypto roundup.Click here to view full gallery at HYPEBEAST","pubDate":"2022-01-17 09:55:52","full_description":"Apple will supposedly require its staff to show proof of their COVID-19 booster shots in order to enter stores and offices. In an internal memo obtained by The Verge , Apple will implement this policy starting February 15. Employees will have four weeks to get their booster shots after they are deemed eligible, and unvaccinated staff — including those who have not received the vaccine and those who have not submitted their proof of vaccination — will be required to provide a negative COVID-19 antigen test before they are allowed to enter a retail store, partner store or the Apple office beginning January 24. “Due to waning efficacy of the primary series of COVID-19 vaccines and the emergence of highly transmissible variants such as Omicron, a booster shot is now part of staying up to date with your COVID-19 vaccination to protect against severe disease,” the memo read. The move from the tech giant arrived after it was reported that several companies like Nike and VF Corp , the parent company of Vans , Supreme , Timberland and The North Face , will begin firing its unvaccinated employees. Elsewhere in tech, take a look at this week’s business and crypto roundup .","image_url":null,"source_id":"hypebeast"},"3":{"title":"Millions of iPhone owners warned that NEW bug exposes privacy – fix it now","link":"https:\/\/www.thesun.co.uk\/tech\/17346316\/apple-safari-bug-expose-data-ios-web-browser\/","keywords":["News Tech","Tech","Apple","iOS"],"creator":["Jamie Harris"],"video_url":null,"description":"APPLE users have been warned of a new bug that is capable of exposing some personal info. The issue affects all web browsers on iOS for iPhone and iPad, as well as the tech giant’s Safari 15 on Mac. Security experts from FingerprintJS uncovered the problem, which can leak your recent internet browsing activity, as […]","content":"APPLE users have been warned of a new bug that is capable of exposing some personal info. The issue affects all web browsers on iOS for iPhone and iPad, as well as the tech giant’s Safari 15 on Mac. GettyUsers will have to wait for an update[\/caption] Security experts from FingerprintJS uncovered the problem, which can leak your recent internet browsing activity, as well as revealing some of the personal details from your Google account. It stems from a feature under the bonnet designed to store data in your browser from the one place. The so-called IndexedDB is supposed to follow a same-origin policy, meaning only the site that generates certain data can access it. For example, if you had your email account open in one tab while another tab is a dodgy website, the feature should stop the bad one from interfering with your email. But researchers have apparently found a flaw which stops that defence mechanism from fully working. This could allow hackers to snoop on specific details about your identity. Most read in News Tech DIGITAL DETOX Hacks to break up with your phone - from rubber bands to rejigging apps SCAM DUNK I'm a cyber expert and here are 3 signs you're about to get scammed DOUBLE TROUBLE Porn stars recreate themselves as life-size sex dolls for HIRE WEB RICHLIST Highest paid YouTube’s of 2021 revealed - with one star earning £39MILLION CODE RED Urgent warning issued to BILLIONS of iPhone and Android users over dangerous scam MISSION KIMPOSSIBLE North Korean hackers stole $400m in crypto last year 'to fund nukes' Experts highlight the dangers with services such as Google’s, as one login is used across YouTube, email, Google Calendar and much more. “Not only does this imply that untrusted or malicious websites can learn a user’s identity, but it also allows the linking together of multiple separate accounts used by the same user,” FingerprintJS warned. They tested 1,000 top websites to see whether they could be affected. More than 30 sites use indexed databases which means those who use them could be at risk. What can I do to prevent Safari bug? Unfortunately there isn’t much you can do until Apple roll out a fix. “The only real protection is to update your browser or OS once the issue is resolved by Apple,” experts said. Mac users could use an alternative web browser. But as the issue is across all web browsers on iPhone and iPad, you’ll have to wait. In the meantime, just be extra vigilant of the sites you use. AlamyIssue affects all web browsers on iOS[\/caption] In other news, personalised smart guns, which can be fired only by verified users, may finally become available to U.S. consumers this year. Tech giant Microsoft is trying to make the world more woke by rolling out an “inclusiveness” checker in its Word software. And a federal anti-trust case against Meta, the company formerly known as Facebook, has been given the go-ahead. We pay for your stories! Do you have a story for The Sun Online Tech & Science team? Email us at tech@the-sun.co.uk","pubDate":"2022-01-17 09:48:03","full_description":"APPLE users have been warned of a new bug that is capable of exposing some personal info. The issue affects all web browsers on iOS for iPhone and iPad, as well as the tech giant's Safari 15 on Mac. Security experts from FingerprintJS uncovered the problem, which can leak your recent internet browsing activity, as well as revealing some of the personal details from your Google account. It stems from a feature under the bonnet designed to store data in your browser from the one place. The so-called IndexedDB is supposed to follow a same-origin policy, meaning only the site that generates certain data can access it. For example, if you had your email account open in one tab while another tab is a dodgy website, the feature should stop the bad one from interfering with your email. But researchers have apparently found a flaw which stops that defence mechanism from fully working. This could allow hackers to snoop on specific details about your identity. Experts highlight the dangers with services such as Google's, as one login is used across YouTube, email, Google Calendar and much more. \"Not only does this imply that untrusted or malicious websites can learn a user’s identity, but it also allows the linking together of multiple separate accounts used by the same user,\" FingerprintJS warned. They tested 1,000 top websites to see whether they could be affected. More than 30 sites use indexed databases which means those who use them could be at risk. Unfortunately there isn't much you can do until Apple roll out a fix. \"The only real protection is to update your browser or OS once the issue is resolved by Apple,\" experts said. Mac users could use an alternative web browser. But as the issue is across all web browsers on iPhone and iPad, you'll have to wait. In the meantime, just be extra vigilant of the sites you use. In other news, personalised smart guns , which can be fired only by verified users, may finally become available to U.S. consumers this year. Tech giant Microsoft is trying to make the world more woke by rolling out an “inclusiveness” checker in its Word software. And a federal anti-trust case against Meta , the company formerly known as Facebook, has been given the go-ahead. We pay for your stories! Do you have a story for The Sun Online Tech & Science team? Email us at tech@the-sun.co.uk","image_url":null,"source_id":"thesun"},"4":{"title":"Every Facebook Messenger user warned to turn security feature on NOW","link":"https:\/\/www.thesun.co.uk\/tech\/17346549\/facebook-messenger-security-feature-lock-face-id-touch\/","keywords":["News Tech","Tech","Cyber Crime and hacking","Facebook","Facebook hacks","Meta"],"creator":["Sean Keach"],"video_url":null,"description":"FACEBOOK Messenger users are being warned to lock down their apps. There’s a clever feature that can help you keep nosy people out of the app. Your iPhone already has a lock on it, but there’s a special extra barrier for Messenger that you can activate. This will force people to have to verify before […]","content":"FACEBOOK Messenger users are being warned to lock down their apps. There’s a clever feature that can help you keep nosy people out of the app. Apple \/ TikTok \/ Isabel ArandiaYou can activate a special lock on Messenger[\/caption] Apple \/ TikTok \/ Isabel ArandiaKeep snoopers out of your app[\/caption] Your iPhone already has a lock on it, but there’s a special extra barrier for Messenger that you can activate. This will force people to have to verify before they can enter your Facebook Messenger. It’s a great feature if you regularly let other people use your phone. By activating it, someone using your device won’t be able to get into Messenger. So if you don’t trust people and suspect they may want to snoop on you, it’s the perfect solution. You can lock your app with Touch ID fingerprint scanning or Face ID face verification, depending on which iPhone model you have. Most read in News Tech DIGITAL DETOX Hacks to break up with your phone - from rubber bands to rejigging apps SCAM DUNK I'm a cyber expert and here are 3 signs you're about to get scammed DOUBLE TROUBLE Porn stars recreate themselves as life-size sex dolls for HIRE WEB RICHLIST Highest paid YouTube’s of 2021 revealed - with one star earning £39MILLION CODE RED Urgent warning issued to BILLIONS of iPhone and Android users over dangerous scam MISSION KIMPOSSIBLE North Korean hackers stole $400m in crypto last year 'to fund nukes' Then when anyone attempts to access the Messenger app, they’ll be locked out. The clever feature has been shared countless times by a number of creators on TikTok, including by user Isabel Arandia. So how do you activate the feature? First, make sure you’ve updated Facebook Messenger in the App Store. Then launch the app and tap on the Chats tab. Now tap your profile picture in the top left corner. Next choose Privacy and then tap into App Lock – about halfway down the page. Finally, turn the toggle for Require Touch ID or Require Face ID to on. Now anyone trying to open Messenger will have to authenticate. And unless you have an identical twin, the person attempting to get in won’t be able to. You can also do the same thing with WhatsApp. Go into your WhatsApp’s security and privacy settings to enable it. That way, both your Facebook Messenger and WhatsApp will remain secure. Read all the latest Phones & Gadgets newsKeep up-to-date on Apple storiesGet the latest on Facebook, WhatsApp and Instagram Best Phone and Gadget tips and hacks Looking for tips and hacks for your phone? Want to find those secret features within social media apps? We have you covered... How to get your deleted Instagram photos back How to track someone on Google Maps How can I increase my Snapchat score? How can I change my Facebook password? How can I do a duet on TikTok? Here’s how to see if your Gmail has been hacked How can I change my Amazon Alexa voice in seconds? What is dating app Bumble? How can I test my broadband internet speed? Here’s how to find your Sky TV remote in SECONDS In other news, Google Chrome users have been urged to delete their browser. Facebook recently rebranded to Meta. Check out the best iPhone 13 deals. And take a look at your hidden Facebook rejection folder. We pay for your stories! Do you have a story for The Sun Online Tech & Science team? Email us at tech@the-sun.co.uk","pubDate":"2022-01-17 09:40:59","full_description":"FACEBOOK Messenger users are being warned to lock down their apps. There's a clever feature that can help you keep nosy people out of the app. Your iPhone already has a lock on it, but there's a special extra barrier for Messenger that you can activate. This will force people to have to verify before they can enter your Facebook Messenger. It's a great feature if you regularly let other people use your phone. By activating it, someone using your device won't be able to get into Messenger. So if you don't trust people and suspect they may want to snoop on you, it's the perfect solution. You can lock your app with Touch ID fingerprint scanning or Face ID face verification, depending on which iPhone model you have. Then when anyone attempts to access the Messenger app, they'll be locked out. The clever feature has been shared countless times by a number of creators on TikTok , including by user Isabel Arandia . So how do you activate the feature? First, make sure you've updated Facebook Messenger in the App Store. Then launch the app and tap on the Chats tab. Now tap your profile picture in the top left corner. Next choose Privacy and then tap into App Lock – about halfway down the page. Finally, turn the toggle for Require Touch ID or Require Face ID to on. Now anyone trying to open Messenger will have to authenticate. And unless you have an identical twin, the person attempting to get in won't be able to. You can also do the same thing with WhatsApp . Go into your WhatsApp's security and privacy settings to enable it. That way, both your Facebook Messenger and WhatsApp will remain secure. Looking for tips and hacks for your phone? Want to find those secret features within social media apps? We have you covered... In other news, Google Chrome users have been urged to delete their browser . Facebook recently rebranded to Meta . Check out the best iPhone 13 deals . And take a look at your hidden Facebook rejection folder . We pay for your stories! Do you have a story for The Sun Online Tech & Science team? Email us at tech@the-sun.co.uk","image_url":null,"source_id":"thesun"},"5":{"title":"Singapore Central Bank Issues Guidelines to Discourage Crypto Trading","link":"https:\/\/gadgets.ndtv.com\/cryptocurrency\/news\/cryptocurrency-trading-singapore-central-bank-monetary-authority-mas-public-2712489","keywords":null,"creator":null,"video_url":null,"description":"The Monetary Authority of Singapore (MAS) issued guidelines that limit cryptocurrency trading service providers from promoting their services to the general public, as part of a bid to shield retail...","content":null,"pubDate":"2022-01-17 08:55:28","full_description":"The Monetary Authority of Singapore (MAS) on Monday issued guidelines that limit cryptocurrency trading service providers from promoting their services to the general public, as part of a bid to shield retail investors from potential risks. Singapore is a popular location for cryptocurrency companies due to a comparatively clear regulatory and operating environment and is among the forerunners globally in developing a formal licensing framework. But the city-state's authorities have repeatedly warned that trading in digital payment tokens (DPT), or cryptocurrency, is highly risky and not suitable for the general public, as they are subject to sharp speculative swings. The new guidelines clarify the expectations of MAS that companies should not engage in marketing or advertising of DPT services in public areas in Singapore or through the engagement of third parties, such as social media influencers, to promote DPT services to the general public. They can only market or advertise on their own corporate websites, mobile applications or official social media accounts. \"MAS strongly encourages the development of blockchain technology and innovative application of crypto tokens in value-adding use cases,\" Loo Siew Yee, MAS Assistant Managing Director (Policy, Payments and Financial Crime), said in a statement. \"But the trading of cryptocurrencies is highly risky and not suitable for the general public. DPT service providers should therefore not portray the trading of DPTs in a manner that trivialises the high risks of trading in DPTs, nor engage in marketing activities that target the general public.\" © Thomson Reuters 2022 .embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }","image_url":"https:\/\/i.gadgets360cdn.com\/large\/bitcoin_crypto_marlet_cap_pexels_small_1639375288384.jpg","source_id":"ndtv"},"6":{"title":"Animoca, Galaxy Interactive and Polygon back gaming firm nCore in web3 push","link":"https:\/\/techcrunch.com\/2022\/01\/17\/animoca-galaxy-interactive-and-polygon-back-gaming-firm-ncore-in-web3-push\/","keywords":["Asia","Funding","Gaming","Mobile","Animoca Brands","Galaxy Interactive","Polygon"],"creator":["Manish Singh"],"video_url":null,"description":"nCore Games has raised $10 million in a new financing round as the top Indian gaming firm gears up to launch web3 offerings, its top executives said Monday. Animoca Brands and Galaxy Interactive, two high-profile investors in the crypto space, led the funding. Polygon, a popular layer 2 Ethereum scaling solution, and Hyperedge Capital also […]","content":"nCore Games has raised $10 million in a new financing round as the top Indian gaming firm gears up to launch web3 offerings, its top executives said Monday. Animoca Brands and Galaxy Interactive, two high-profile investors in the crypto space, led the funding. Polygon, a popular layer 2 Ethereum scaling solution, and Hyperedge Capital also participated in the round. Scores of angel investors including Amitabh Singhal, Sandeep Nailwal, Kanwaljit Bombra, Sohil Chand, Ashish Chand, Ram Madhvani, Rakesh Kaul, Mannan Adenwala, Sanjay Narang, Taj Haslani, Kristian Segerstrale, Sanjay Gondal, Vedant Baali, Kartik Prabhakara, Peter Leung, Yashraj Akashi and Akshay Chaturvedi also invested in the round. nCore Games houses a number of gaming studios including Studio nCore, Dot9 Games, and IceSpice. Its portfolio includes multiplayer action-title Fau-G and Pro Cricket Mobile that have garnered tens of millions of downloads. IceSpice, additionally, today houses a number of third-party games on its platform. The startup plans to launch and invest in more games this year, said Vishal Gondal, co-founder of nCore Games, in an interview with TechCrunch. But the bigger focus with the funding is expansion into the metaverse, he said. nCore Games is evaluating launching its own NFTs and tokens and may do so in the next few months, he said. India has emerged as one of the largest mobile games markets globally by download counts. PUBG Mobile, before it was banned by New Delhi, had amassed over 50 million monthly active users in India. But gaming firms have struggled to efficiently monetize this user base because of low-penetration of in-app purchases and small ticket advertising dollars. Gondal, an industry gaming veteran who sold his previous venture to Disney, said there’s a shift in the gaming economy, especially in the developing markets where firms have largely relied on advertisement to generate revenue. He cited the popularity of Axie Infinity in the Philippines, a market similar to India where in-app purchase revenue is not high. Drawing parallels between India, Indonesia, and the Philippines, Gondal said he is optimistic that web3 offerings that have made inroads in several categories and in many markets will prove popular with gaming in India. Gondal said web3 is positioned to enable the right incentive structure to all stakeholders. “Currently when you’re playing a game, the maximum upside for you was to become part of some community. Now while you’re playing the game, you also have the chance to own the value of the game,” he said. Tejraj Parab, the chief executive of IceSpice, said nCore Games is eyeing making a universal token that all of its games as well as those of the partner firms will provide to the community. The startup is also hoping to make its technology available to other game developers to leverage, he said. Dayanidhi MG, the chief executive of Studio nCore, said, “we are excited to embrace the emerging trends and technologies in the company of global leaders and highly successful funds, companies and veterans to take nCore to the next level with exponential growth.” Web3 is beginning to gain traction in India. Indian startup Faze, backed by Tiger Global and Sequoia Capital India, last year partnered with ICC, the global governing body of cricket, to launch NFTs for cricketers. The startup is currently holding talks to raise a new financing round from Insight Partners, according to two sources familiar with the matter. Several Bollywood celebrities have also partnered with firms to launch their own NFTs. “nCORE Games was started by experienced gaming industry professionals with strong pedigrees. This is one of our most promising investments in India, which has a large gaming market with a massive growth potential,” said Yat Siu, the executive chairman and co-founder of Animoca Brands, in a statement. “nCORE Games has the right team to leverage blockchain and NFTs in games to deliver digital property rights to players, and we look forward to many successful products as we move toward a global open metaverse.”","pubDate":"2022-01-17 08:53:48","full_description":null,"image_url":null,"source_id":"techcrunch"},"7":{"title":"Singapore curbs crypto marketing in digital asset crackdown - The Block Crypto","link":"https:\/\/news.google.com\/__i\/rss\/rd\/articles\/CBMiaGh0dHBzOi8vd3d3LnRoZWJsb2NrY3J5cHRvLmNvbS9saW5rZWQvMTMwNDU3L3NpbmdhcG9yZS1jdXJicy1jcnlwdG8tbWFya2V0aW5nLWluLWRpZ2l0YWwtYXNzZXQtY3JhY2tkb3du0gFsaHR0cHM6Ly93d3cudGhlYmxvY2tjcnlwdG8uY29tL2FtcC9saW5rZWQvMTMwNDU3L3NpbmdhcG9yZS1jdXJicy1jcnlwdG8tbWFya2V0aW5nLWluLWRpZ2l0YWwtYXNzZXQtY3JhY2tkb3du?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Singapore curbs crypto marketing in digital asset crackdown  The Block CryptoCryptocurrency service providers should not promote their services to public, says MAS as it warns of 'high risks'  CNAMAS stops crypto service providers from marketing to general public  The Edge SingaporeSingapore Central Bank Warns Crypto Firms Against Promoting Services  MarketWatchView Full coverage on Google News","content":null,"pubDate":"2022-01-17 08:53:30","image_url":null,"source_id":"google"},"8":{"title":"Homegrown TikTok rival Chingari raises $15 million in new funding","link":"https:\/\/www.techradar.com\/news\/homegrown-tiktok-rival-chingari-raises-dollar15-million-in-new-funding\/","keywords":null,"creator":null,"video_url":null,"description":"The Bengaluru-based short video platform Chingari said the funds will be used, among others, to strengthen the backend technology team, as well as boost its marketing initiatives for 2022.","content":"<article> <p><a href=\"https:\/\/www.techradar.com\/in\/news\/regional-content-drives-indian-short-form-video-apps-to-tiktok-levels\">Chingari<\/a>, which claims to have 32 million active users making it the most popular social media app in the country, has announced that it has raised $15 million in a Series A extension round. <\/p><p>Seen as India's answer to the now banned TikTok, the short video platform Chingari said it would use the funds to launch new in-app features and also strengthen its back-end technology and team.<\/p><p>Chingari is planning to unveil live-streaming, socio-commerce and audio chat features on its platform shortly. The app is also hoping to enhance its user engagement by strengthening local content portfolio with more than 20 languages on the platform.<\/p> <h2 id=\"chingari-to-increase-its-user-base-to-200-million-by-end-of-2022-5\">Chingari to increase its user-base to 200 million by end of 2022<\/h2> <p>Republic Capital led the latest funding with participation from Onmobile, JPIN Venture Catalysts, Hill Harbour, Angellist, Venture Collective, Makan Family, Cowa Ventures, MVC Friends, Protocol Labs and other HNI family offices.<\/p><p>\"This new funding will further strengthen our position and help us deliver an immersive user experience for our community,\" Sumit Ghosh, Co-founder and CEO, Chingari was quoted as saying in a company press statement.<\/p><p>Chingari claims over 110 million downloads, which amounts to a two-fold increase in its user base since April 2021. The short-video making app hopes to take its user base to 200 million by the end of this year.<\/p><p>Chingari allows users to create short videos and upload them on the platform to share with millions of users. Its in-built filters have been popular, and its international competitors include TikTok, Snapchat, Facebook, and Instagram. The app supports more than 20 Indian regional languages, in addition to English and Hindi. <\/p><p>Chingari recently launched a crypto token ‘$GARI' to make content monetisation more mainstream in the country. The cryptocurrency is built on the Solana blockchain, and is expected to enable content creators to monetize their videos, allowing them to earn income from the Chingari app. They can also set up their own e-commerce spaces. <\/p><p>The token will likely facilitate the sale of physical merchandise and non-fungible tokens (NFTs) on Chingari and allow fans to fund their favorite artists. The Bengaluru-based startup said it is the first social network in India to issue crypto tokens.<\/p> <ul><li><a href=\"https:\/\/www.techradar.com\/in\/news\/amazon-great-republic-day-sale#section-smartphone-offers\">Amazon Great Republic Day Sale: Check out today's offer on phones<br> <\/a><\/li><\/ul> <ul><li><strong>Want to know about the latest happenings in tech? Follow TechRadar India on <\/strong><a href=\"https:\/\/twitter.com\/TechRadarIndia\" target=\"_blank\"><strong>Twitter<\/strong><\/a><strong>, <\/strong><a href=\"https:\/\/www.facebook.com\/TechRadarIndia\" target=\"_blank\"><strong>Facebook<\/strong><\/a><a href=\"https:\/\/www.facebook.com\/TechRadarIndia\"><strong> <\/strong><\/a><strong>and <\/strong><a href=\"https:\/\/www.instagram.com\/techradarindia\/\" target=\"_blank\"><strong>Instagram<\/strong><\/a><strong>!<\/strong><\/li><\/ul> <\/article>","pubDate":"2022-01-17 08:31:27","full_description":"Chingari , which claims to have 32 million active users making it the most popular social media app in the country, has announced that it has raised $15 million in a Series A extension round. Seen as India's answer to the now banned TikTok, the short video platform Chingari said it would use the funds to launch new in-app features and also strengthen its back-end technology and team. Chingari is planning to unveil live-streaming, socio-commerce and audio chat features on its platform shortly. The app is also hoping to enhance its user engagement by strengthening local content portfolio with more than 20 languages on the platform. Republic Capital led the latest funding with participation from Onmobile, JPIN Venture Catalysts, Hill Harbour, Angellist, Venture Collective, Makan Family, Cowa Ventures, MVC Friends, Protocol Labs and other HNI family offices. \"This new funding will further strengthen our position and help us deliver an immersive user experience for our community,\" Sumit Ghosh, Co-founder and CEO, Chingari was quoted as saying in a company press statement. Chingari claims over 110 million downloads, which amounts to a two-fold increase in its user base since April 2021. The short-video making app hopes to take its user base to 200 million by the end of this year. Chingari allows users to create short videos and upload them on the platform to share with millions of users. Its in-built filters have been popular, and its international competitors include TikTok, Snapchat, Facebook, and Instagram. The app supports more than 20 Indian regional languages, in addition to English and Hindi. Chingari recently launched a crypto token ‘$GARI' to make content monetisation more mainstream in the country. The cryptocurrency is built on the Solana blockchain, and is expected to enable content creators to monetize their videos, allowing them to earn income from the Chingari app. They can also set up their own e-commerce spaces. The token will likely facilitate the sale of physical merchandise and non-fungible tokens (NFTs) on Chingari and allow fans to fund their favorite artists. The Bengaluru-based startup said it is the first social network in India to issue crypto tokens.","image_url":null,"source_id":"techradar"},"9":{"title":"Bitcoin price prediction: Which crypto will explode in 2022? Expert analysis","link":"https:\/\/www.express.co.uk\/finance\/city\/1549261\/Bitcoin-price-prediction-cryptocurrency-2022-evg","keywords":null,"creator":null,"video_url":null,"description":"BITCOIN is attempting to regain even footing in 2022, following a turbulent path last year that saw its value rapidly decline. Will Bitcoin explode in 2022?","content":null,"pubDate":"2022-01-17 08:26:00","full_description":null,"image_url":null,"source_id":"express"}},"nextPage":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1}}