{"status":{"0":"success","1":"success","2":"success","3":"success","4":"success","5":"success","6":"success","7":"success","8":"success","9":"success"},"totalResults":{"0":22,"1":22,"2":22,"3":22,"4":22,"5":22,"6":22,"7":22,"8":22,"9":22},"results":{"0":{"title":"Most Defi Hacks in 2021 Had to Do With Centralization Issues, According to Certik","link":"https:\/\/news.bitcoin.com\/most-defi-hacks-in-2021-had-to-do-with-centralization-issues-according-to-certik\/","keywords":["Defi","attack vectors","Avalanche","cenralization","certick","DeFi","Ethereum","growth","Solana","Terra"],"creator":["Sergio Goschenko"],"video_url":null,"description":"Certik, a blockchain security and auditing firm, has reported that the most common attack vector for hacks in decentralized finance (defi) protocols had to do with centralization in 2021. This data is present in Certik’s latest report, where the company also examines the growth of defi in 2021, and how other chains such as Avalanche […]","content":"Certik, a blockchain security and auditing firm, has reported that the most common attack vector for hacks in decentralized finance (defi) protocols had to do with centralization in 2021. This data is present in Certik’s latest report, where the company also examines the growth of defi in 2021, and how other chains such as Avalanche and BSC rose as alternatives to Ethereum’s high fees.\r Centralization Costs Defi Protocols $1.3 Billion in 2021\r A new report issued by Certik, a blockchain security and auditing firm, has revealed that centralization issues in defi protocols were the most common attack vector for hackers in 2021. According to the firm, $1.3 billion were exploited using single points of failure. Certik made 1,737 smart contract audits during 2021, and found 286 instances of discrete centralization risks. The report states:\r \r Centralization is antithetical to the ethos of DeFi and poses major security risks. Single points of failure can be exploited by dedicated hackers and malicious insiders alike.\r \r One of the protocols that suffered from this kind of vulnerability was BZX, when an attacker managed to phish two private keys using an email with a malicious macro in November. The attacker took control of $55 million from the protocol at that time. This is part of what the company classifies as privileged ownership vulnerabilities.\r \r Certik on Defi Growth and Multichain Tendencies\r The report also recognizes the massive growth the defi environment experienced last year. Certik states that the volume traded on decentralized exchanges (dex) tripled, the total value locked in defi-based protocols quadrupled, and Ethereum fee revenue skyrocketed. On the growth of Ethereum, the report acknowledges that:\r \r There is clearly a voracious appetite for the smart contract-driven decentralized applications that Ethereum enables. DeFi, NFTs, and other applications such as ENS (Ethereum Name System) have all contributed to this growth.\r \r However, due to the challenges Ethereum has faced in scaling, a number of competitors managed to take a third of Ethereum’s defi dominance. Certik states that Binance Smart Chain, Solana, Terra, Avalanche, Fantom, and Polygon were the more popular chains chosen as alternatives for users’ defi activities.\r Even with the Ethereum block space trading at a premium, the chain reached $153 billion TVL. But with the user migration to other chains, the decentralization debate has deepened. Solana, one of the chains ostensibly moving to replace Ethereum, has been facing constant troubles that have been formally acknowledged by its team.\r What do you think about Certik and the changes that occurred in defi in 2021? Tell us in the comments section below.\r","pubDate":"2022-01-17 10:00:05","full_description":"Most Defi Hacks in 2021 Had to Do With Centralization Issues, According to Certik Certik, a blockchain security and auditing firm, has reported that the most common attack vector for hacks in decentralized finance (defi) protocols had to do with centralization in 2021. This data is present in Certik’s latest report, where the company also examines the growth of defi in 2021, and how other chains such as Avalanche and BSC rose as alternatives to Ethereum’s high fees. Centralization Costs Defi Protocols $1.3 Billion in 2021 A new report issued by Certik, a blockchain security and auditing firm, has revealed that centralization issues in defi protocols were the most common attack vector for hackers in 2021. According to the firm, $1.3 billion were exploited using single points of failure. Certik made 1,737 smart contract audits during 2021, and found 286 instances of discrete centralization risks. The report states: Centralization is antithetical to the ethos of DeFi and poses major security risks. Single points of failure can be exploited by dedicated hackers and malicious insiders alike. One of the protocols that suffered from this kind of vulnerability was BZX , when an attacker managed to phish two private keys using an email with a malicious macro in November. The attacker took control of $55 million from the protocol at that time. This is part of what the company classifies as privileged ownership vulnerabilities. Certik on Defi Growth and Multichain Tendencies The report also recognizes the massive growth the defi environment experienced last year. Certik states that the volume traded on decentralized exchanges (dex) tripled, the total value locked in defi-based protocols quadrupled, and Ethereum fee revenue skyrocketed. On the growth of Ethereum, the report acknowledges that: There is clearly a voracious appetite for the smart contract-driven decentralized applications that Ethereum enables. DeFi, NFTs, and other applications such as ENS (Ethereum Name System) have all contributed to this growth. However, due to the challenges Ethereum has faced in scaling, a number of competitors managed to take a third of Ethereum’s defi dominance. Certik states that Binance Smart Chain, Solana, Terra, Avalanche, Fantom, and Polygon were the more popular chains chosen as alternatives for users’ defi activities. Even with the Ethereum block space trading at a premium, the chain reached $153 billion TVL. But with the user migration to other chains, the decentralization debate has deepened. Solana, one of the chains ostensibly moving to replace Ethereum, has been facing constant troubles that have been formally acknowledged by its team. Tags in this story attack vectors , Avalanche , cenralization , certick , DeFi , Ethereum , growth , Solana , Terra What do you think about Certik and the changes that occurred in defi in 2021? Tell us in the comments section below. Sergio Goschenko Sergio is a cryptocurrency journalist based in Venezuela. He describes himself as late to the game, entering the cryptosphere when the price rise happened during December 2017. Having a computer engineering background, living in Venezuela, and being impacted by the cryptocurrency boom at a social level, he offers a different point of view about crypto success and how it helps the unbanked and underserved. Terra Proposal Seeks to Expand UST Stablecoin to 5 Different Defi Protocols DEFI | 7 days ago Value Locked in Defi Slips 10% in 4 Days, Ethereum TVL Dominates at 58% DEFI | Jan 8, 2022 Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Konami’s Castlevania Anniversary NFT Sale Raises Over $160K Show comments More Popular News In Case You Missed It Russia’s Tinkoff Bank Enters Crypto Space Through Swiss Company Acquisition The Russian neobank Tinkoff is joining the world of cryptocurrencies with the purchase of a stake in Aximetria, a Swiss-registered and licensed company which provides clients around the world with services and solutions for digital financial assets. Tinkoff Bank Buys ... read more. Swiss National Bank Trials CBDC in Transactions With Five Banks Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption","image_url":null,"source_id":"bitcoin"},"1":{"title":"Animoca, Galaxy Interactive and Polygon back gaming firm nCore in web3 push","link":"https:\/\/techcrunch.com\/2022\/01\/17\/animoca-galaxy-interactive-and-polygon-back-gaming-firm-ncore-in-web3-push\/","keywords":["Asia","Funding","Gaming","Mobile","Animoca Brands","Galaxy Interactive","Polygon"],"creator":["Manish Singh"],"video_url":null,"description":"nCore Games has raised $10 million in a new financing round as the top Indian gaming firm gears up to launch web3 offerings, its top executives said Monday. Animoca Brands and Galaxy Interactive, two high-profile investors in the crypto space, led the funding. Polygon, a popular layer 2 Ethereum scaling solution, and Hyperedge Capital also […]","content":"nCore Games has raised $10 million in a new financing round as the top Indian gaming firm gears up to launch web3 offerings, its top executives said Monday. Animoca Brands and Galaxy Interactive, two high-profile investors in the crypto space, led the funding. Polygon, a popular layer 2 Ethereum scaling solution, and Hyperedge Capital also participated in the round. Scores of angel investors including Amitabh Singhal, Sandeep Nailwal, Kanwaljit Bombra, Sohil Chand, Ashish Chand, Ram Madhvani, Rakesh Kaul, Mannan Adenwala, Sanjay Narang, Taj Haslani, Kristian Segerstrale, Sanjay Gondal, Vedant Baali, Kartik Prabhakara, Peter Leung, Yashraj Akashi and Akshay Chaturvedi also invested in the round. nCore Games houses a number of gaming studios including Studio nCore, Dot9 Games, and IceSpice. Its portfolio includes multiplayer action-title Fau-G and Pro Cricket Mobile that have garnered tens of millions of downloads. IceSpice, additionally, today houses a number of third-party games on its platform. The startup plans to launch and invest in more games this year, said Vishal Gondal, co-founder of nCore Games, in an interview with TechCrunch. But the bigger focus with the funding is expansion into the metaverse, he said. nCore Games is evaluating launching its own NFTs and tokens and may do so in the next few months, he said. India has emerged as one of the largest mobile games markets globally by download counts. PUBG Mobile, before it was banned by New Delhi, had amassed over 50 million monthly active users in India. But gaming firms have struggled to efficiently monetize this user base because of low-penetration of in-app purchases and small ticket advertising dollars. Gondal, an industry gaming veteran who sold his previous venture to Disney, said there’s a shift in the gaming economy, especially in the developing markets where firms have largely relied on advertisement to generate revenue. He cited the popularity of Axie Infinity in the Philippines, a market similar to India where in-app purchase revenue is not high. Drawing parallels between India, Indonesia, and the Philippines, Gondal said he is optimistic that web3 offerings that have made inroads in several categories and in many markets will prove popular with gaming in India. Gondal said web3 is positioned to enable the right incentive structure to all stakeholders. “Currently when you’re playing a game, the maximum upside for you was to become part of some community. Now while you’re playing the game, you also have the chance to own the value of the game,” he said. Tejraj Parab, the chief executive of IceSpice, said nCore Games is eyeing making a universal token that all of its games as well as those of the partner firms will provide to the community. The startup is also hoping to make its technology available to other game developers to leverage, he said. Dayanidhi MG, the chief executive of Studio nCore, said, “we are excited to embrace the emerging trends and technologies in the company of global leaders and highly successful funds, companies and veterans to take nCore to the next level with exponential growth.” Web3 is beginning to gain traction in India. Indian startup Faze, backed by Tiger Global and Sequoia Capital India, last year partnered with ICC, the global governing body of cricket, to launch NFTs for cricketers. The startup is currently holding talks to raise a new financing round from Insight Partners, according to two sources familiar with the matter. Several Bollywood celebrities have also partnered with firms to launch their own NFTs. “nCORE Games was started by experienced gaming industry professionals with strong pedigrees. This is one of our most promising investments in India, which has a large gaming market with a massive growth potential,” said Yat Siu, the executive chairman and co-founder of Animoca Brands, in a statement. “nCORE Games has the right team to leverage blockchain and NFTs in games to deliver digital property rights to players, and we look forward to many successful products as we move toward a global open metaverse.”","pubDate":"2022-01-17 08:53:48","full_description":null,"image_url":null,"source_id":"techcrunch"},"2":{"title":"Top cryptocurrency news on January 17: The biggest moves in Bitcoin, NFTs and more","link":"https:\/\/www.moneycontrol.com\/news\/business\/top-cryptocurrency-newsjanuary-17-the-biggest-movesbitcoin-nftsmore_15923381.html","keywords":null,"creator":null,"video_url":null,"description":"A daily round-up of the most interesting articles on cryptocurrencies like Bitcoin, Ethereum and Tether to help jump-start the day","content":null,"pubDate":"2022-01-17 04:17:49","full_description":null,"image_url":null,"source_id":"moneycontrol"},"3":{"title":"Cryptocurrency Prices Today: Bitcoin, Ethereum down","link":"https:\/\/www.moneycontrol.com\/news\/business\/cryptocurrency-prices-today-bitcoin-ethereum-down_15923321.html","keywords":null,"creator":null,"video_url":null,"description":"Bitcoin#39;s price is currently above Rs 34 lakh, and its dominance over other cryptocurrencies over the past 24 hours is 39.35 percent","content":null,"pubDate":"2022-01-17 04:08:29","full_description":null,"image_url":null,"source_id":"moneycontrol"},"4":{"title":"Cryptocurrency Prices Today: Bitcoin, Ethereum down","link":"https:\/\/www.moneycontrol.com\/news\/business\/cryptocurrency-prices-today-bitcoin-ethereum-down_15923301.html","keywords":null,"creator":null,"video_url":null,"description":"Bitcoin#39;s price is currently above Rs 34 lakh, and its dominance over other cryptocurrencies over the past 24 hours is 39.35 percent","content":null,"pubDate":"2022-01-17 04:08:29","full_description":null,"image_url":null,"source_id":"moneycontrol"},"5":{"title":"Boxing Legend Mike Tyson Says He’s ‘All in’ on Solana Crypto — Asks Fans How High SOL Will Go","link":"https:\/\/news.bitcoin.com\/boxing-legend-mike-tyson-all-in-on-solana-crypto-how-high-sol-will-go\/","keywords":["Altcoins","bitcoin vs solana","ethereum vs solana","Mike Tyson","Mike Tyson Bitcoin","Mike Tyson crypto","Mike Tyson crypto investment","Mike Tyson cryptocurrency","Mike Tyson investing in sol","Mike Tyson investments","Mike Tyson sol","Mike Tyson solana","SOL","Solana"],"creator":["Kevin Helms"],"video_url":null,"description":"Boxing legend Mike Tyson, aka “Iron Mike,” says he is “all in on solana.” He is now asking his Twitter followers how high the price of the cryptocurrency SOL will go. Mike Tyson Asks How High the Price of Solana Will Go Mike Tyson, one of the greatest heavyweight boxers of all time, has been […]","content":"Boxing legend Mike Tyson, aka “Iron Mike,” says he is “all in on solana.” He is now asking his Twitter followers how high the price of the cryptocurrency SOL will go. Mike Tyson Asks How High the Price of Solana Will Go Mike Tyson, one of the greatest heavyweight boxers of all time, has been active in the crypto space. After announcing last week that he is “all in” on the cryptocurrency solana (SOL), he is now asking his 5.7 million Twitter followers how high they think the price of the crypto will go. He tweeted Saturday, “How high do you think Sol will go?” While his tweet has received 2.4K comments at the time of writing, no one gave him a serious price analysis for solana. Tyson is nicknamed “Iron Mike” and “Kid Dynamite” in his early career, and later known as “The Baddest Man on the Planet.” Last week, he tweeted that he was “All in on Solana,” adding that he “Just copped a Catalina Whale.” His tweet included an image of a non-fungible token (NFT) from the Catalina Whale Mixer collection. Iron Mike also has his own NFT collection on Opensea, which was launched in August last year in collaboration with artist Cory Van Lew. “The Mike Tyson NFT Collection is a limited-edition series of NFTs that celebrates the iconic life and legacy of the Baddest Man on the Planet, Mike Tyson,” according to the description of the collection. Tyson further tweeted about NFTs last week: “Ever since I got into NFTs I have been looking for crypto partnerships and DREAM really stood out. It’s the first of its kind that can only be traded during US stock market hours. Could revolutionize the space and help the mental health of the crypto community.” Before getting into solana, Iron Mike asked his fans on Twitter which cryptocurrency they recommended. In June last year, he was weighing between bitcoin and ether. He tweeted, “Which do you prefer, BTC or ETH?” He then tried to choose between solana and ether. In September, he tweeted, “Solana or Ethereum?” Solana is currently the fifth-largest cryptocurrency with a market capitalization of about $47 billion based on data from Bitcoin.com Markets. The coin is trading at $149.84. The cryptocurrency gained 4,495% over the past year but is down more than 15% over the past month. Last week, Bank of America published a bullish report on solana, asserting that SOL could take market share from ethereum and become the Visa of the digital asset ecosystem. What do you think about Mike Tyson’s solana comments? Let us know in the comments section below.","pubDate":"2022-01-17 02:30:40","full_description":"Boxing Legend Mike Tyson Says He's 'All in' on Solana Crypto — Asks Fans How High SOL Will Go Boxing legend Mike Tyson, aka “Iron Mike,” says he is “all in on solana.” He is now asking his Twitter followers how high the price of the cryptocurrency SOL will go. Mike Tyson Asks How High the Price of Solana Will Go Mike Tyson, one of the greatest heavyweight boxers of all time, has been active in the crypto space. After announcing last week that he is “all in” on the cryptocurrency solana (SOL), he is now asking his 5.7 million Twitter followers how high they think the price of the crypto will go. He tweeted Saturday, “How high do you think Sol will go?” While his tweet has received 2.4K comments at the time of writing, no one gave him a serious price analysis for solana. Tyson is nicknamed “Iron Mike” and “Kid Dynamite” in his early career, and later known as “The Baddest Man on the Planet.” Last week, he tweeted that he was “All in on Solana,” adding that he “Just copped a Catalina Whale.” His tweet included an image of a non-fungible token (NFT) from the Catalina Whale Mixer collection. Iron Mike also has his own NFT collection on Opensea, which was launched in August last year in collaboration with artist Cory Van Lew. “The Mike Tyson NFT Collection is a limited-edition series of NFTs that celebrates the iconic life and legacy of the Baddest Man on the Planet, Mike Tyson,” according to the description of the collection. Tyson further tweeted about NFTs last week: “Ever since I got into NFTs I have been looking for crypto partnerships and DREAM really stood out. It’s the first of its kind that can only be traded during US stock market hours. Could revolutionize the space and help the mental health of the crypto community.” Before getting into solana, Iron Mike asked his fans on Twitter which cryptocurrency they recommended. In June last year, he was weighing between bitcoin and ether. He tweeted , “Which do you prefer, BTC or ETH ?” He then tried to choose between solana and ether. In September, he tweeted, “Solana or Ethereum?” Solana is currently the fifth-largest cryptocurrency with a market capitalization of about $47 billion based on data from Bitcoin.com Markets. The coin is trading at $149.84. The cryptocurrency gained 4,495% over the past year but is down more than 15% over the past month. Last week, Bank of America published a bullish report on solana, asserting that SOL could take market share from ethereum and become the Visa of the digital asset ecosystem. Tags in this story bitcoin vs solana , ethereum vs solana , Mike Tyson , Mike Tyson Bitcoin , Mike Tyson crypto , Mike Tyson crypto investment , Mike Tyson cryptocurrency , Mike Tyson investing in sol , Mike Tyson investments , Mike Tyson sol , Mike Tyson solana , SOL , Solana What do you think about Mike Tyson’s solana comments? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. Vitalik Buterin Asks Twitter Followers Which Crypto They Prefer to Overtake Ethereum — Cardano, Tron Favorites ALTCOINS | 1 day ago Bank of America Says Solana Could Take Market Share From Ethereum, Become the Visa of the Crypto Ecosystem ALTCOINS | 1 day ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Robinhood on Listing More Cryptocurrencies: ‘It’s Important That We Get a Bit More Clarity From Regulators’ Show comments More Popular News In Case You Missed It Revolut Launches Banking Services in Spain Featuring Deposit Insurance Revolut, a leading fintech platform and neobank, has received a special banking license to operate in Spain. User deposits are now insured up to €100K, with the coverage being provided by Deposit and Investment Insurance, a Lithuanian state company. The ... read more. NYCB and Group of Banks Join to Launch USDF Stablecoin Swiss National Bank Trials CBDC in Transactions With Five Banks Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament","image_url":null,"source_id":"bitcoin"},"6":{"title":"Robinhood on Listing More Cryptocurrencies: ‘It’s Important That We Get a Bit More Clarity From Regulators’","link":"https:\/\/news.bitcoin.com\/robinhood-listing-cryptocurrencies-important-clarity-from-regulators\/","keywords":["Regulation","Robinhood","Robinhood Cryptocurrency","Robinhood Cryptocurrency listings","Robinhood Cryptocurrency Regulations","Robinhood digital assets","robinhood shib","robinhood shiba inu","robinhood trading platform"],"creator":["Kevin Helms"],"video_url":null,"description":"Robinhood’s chief financial officer has revealed the popular trading platform’s crypto priority and the potential of listing more cryptocurrencies. “We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators,” he emphasized. Robinhood Waiting for Regulatory Clarity The chief financial officer (CFO) […]","content":"Robinhood’s chief financial officer has revealed the popular trading platform’s crypto priority and the potential of listing more cryptocurrencies. “We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators,” he emphasized. Robinhood Waiting for Regulatory Clarity The chief financial officer (CFO) of Robinhood, Jason Warnick, talked about cryptocurrency during The Wall Street Journal’s virtual CFO Network Summit last week. Commenting on retail investors’ high demand for Robinhood to list more cryptocurrencies, particularly the meme crypto shiba inu (SHIB), Warnick emphasized, “It’s not lost on us that our customers and others would like to see us add more coins.” However, the Robinhood executive stressed: We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators. Compliance is a top priority at Robinhood. In December last year, the company partnered with blockchain data platform Chainalysis to meet compliance requirements. Supporters of the shiba inu cryptocurrency have been petitioning on Change.org for Robinhood to list SHIB. At the time of writing, 555,811 people have signed the petition. Christine Brown, Robinhood Crypto’s chief operating officer and VP of Product Operations, said in November that the platform is in no hurry to list any additional cryptocurrencies. Her statement was in response to a question about when SHIB will be listed. Robinhood Crypto currently supports the buying, selling, and real-time market data for bitcoin (BTC), bitcoin cash (BCH), bitcoin sv (BSV), dogecoin (DOGE), ethereum (ETH), ethereum classic (ETC), and litecoin (LTC). Warnick also clarified at the summit that Robinhood will not be buying cryptocurrency for its corporate treasury like some companies have done, such as Microstrategy and Tesla. He explained: There aren’t compelling reasons strategically for our business to put any meaningful amount of our corporate cash into cryptocurrencies. In December last year, Robinhood launched a cryptocurrency gift program. The company also announced the upcoming beta launch of its cryptocurrency wallets, which has a waitlist of 1.6 million people. What do you think about the Robinhood executive’s comments? Let us know in the comments section below.","pubDate":"2022-01-17 00:30:50","full_description":"Robinhood on Listing More Cryptocurrencies: 'It's Important That We Get a Bit More Clarity From Regulators' Robinhood’s chief financial officer has revealed the popular trading platform’s crypto priority and the potential of listing more cryptocurrencies. “We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators,” he emphasized. Robinhood Waiting for Regulatory Clarity The chief financial officer (CFO) of Robinhood, Jason Warnick, talked about cryptocurrency during The Wall Street Journal’s virtual CFO Network Summit last week. Commenting on retail investors’ high demand for Robinhood to list more cryptocurrencies, particularly the meme crypto shiba inu (SHIB), Warnick emphasized, “It’s not lost on us that our customers and others would like to see us add more coins.” However, the Robinhood executive stressed: We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators. Compliance is a top priority at Robinhood. In December last year, the company partnered with blockchain data platform Chainalysis to meet compliance requirements. Supporters of the shiba inu cryptocurrency have been petitioning on Change.org for Robinhood to list SHIB. At the time of writing, 555,811 people have signed the petition. Christine Brown, Robinhood Crypto’s chief operating officer and VP of Product Operations, said in November that the platform is in no hurry to list any additional cryptocurrencies. Her statement was in response to a question about when SHIB will be listed. Robinhood Crypto currently supports the buying, selling, and real-time market data for bitcoin ( BTC ), bitcoin cash ( BCH ), bitcoin sv ( BSV ), dogecoin (DOGE), ethereum ( ETH ), ethereum classic ( ETC ), and litecoin ( LTC ). Warnick also clarified at the summit that Robinhood will not be buying cryptocurrency for its corporate treasury like some companies have done, such as Microstrategy and Tesla. He explained: There aren’t compelling reasons strategically for our business to put any meaningful amount of our corporate cash into cryptocurrencies. In December last year, Robinhood launched a cryptocurrency gift program . The company also announced the upcoming beta launch of its cryptocurrency wallets , which has a waitlist of 1.6 million people. Tags in this story Robinhood , Robinhood Cryptocurrency , Robinhood Cryptocurrency listings , Robinhood Cryptocurrency Regulations , Robinhood digital assets , robinhood shib , robinhood shiba inu , robinhood trading platform What do you think about the Robinhood executive’s comments? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. Pakistan Seeks to Block Websites Dealing in Cryptocurrency: Report REGULATION | 10 hours ago MTI Mastermind Arrest: Lawyer Points to Agreement Relating to Johann Steynberg's Extradition to South Africa REGULATION | 18 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Jack Dorsey’s Payments Company Is ‘Officially Building an Open Bitcoin Mining System’ Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Russia’s Tinkoff Bank Enters Crypto Space Through Swiss Company Acquisition The Russian neobank Tinkoff is joining the world of cryptocurrencies with the purchase of a stake in Aximetria, a Swiss-registered and licensed company which provides clients around the world with services and solutions for digital financial assets. Tinkoff Bank Buys ... read more. Revolut Launches Banking Services in Spain Featuring Deposit Insurance Swiss National Bank Trials CBDC in Transactions With Five Banks Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption","image_url":null,"source_id":"bitcoin"},"7":{"title":"‘AWS for Web3’ Pocket Network Shakes Up Infrastructure of the Internet","link":"https:\/\/news.bitcoin.com\/aws-for-web3-pocket-network-shakes-up-infrastructure-of-the-internet\/","keywords":["Press release","Pocket Network"],"creator":["Bitcoin.com Media"],"video_url":null,"description":"PRESS RELEASE. Tampa Bay, Florida, U.S.A – 16th January 2022 – Pocket Network – an infrastructure middleware protocol which facilitates decentralized cloud computing and abundant bandwidth on full nodes interoperable with DApps across all 21+ blockchains surpasses milestone 20,000 full nodes, answering a real and conceptual question around decentralization viability. Pocket Network incentivizes a global […]","content":"PRESS RELEASE. Tampa Bay, Florida, U.S.A – 16th January 2022 – Pocket Network – an infrastructure middleware protocol which facilitates decentralized cloud computing and abundant bandwidth on full nodes interoperable with DApps across all 21+ blockchains surpasses milestone 20,000 full nodes, answering a real and conceptual question around decentralization viability. Pocket Network incentivizes a global community of independent node operators and service providers running 21,000+ full nodes adding to the network’s resilience. Pocket Network is secured by over $320M worth of network infrastructure distributed globally across 23 countries and reduces the risk of service downtime to near zero for any layer 1 or industry DApps as work is distributed evenly across thousands of full nodes, which also protects end users’ privacy. Pocket Network, who last week closed a strategic round led by Republic Capital, RockTree Capital, Arrington Capital, is undergoing exponential growth as demand for its network measured in API calls or relays jumped to 5.78 Billion relays in December, up 44% From November 2021. “Pocket is the First Mover, changing the game as core infrastructure for the Web3 revolution” said Omer Ozden, CEO of RockTree Capital “For those that are seeking the next high growth first mover like AWS or Ethereum, you can see transparently on-chain the parabolic growth of actual usage and of actual revenues of the Pocket Network. The metrics have been super impressive and we look forward to the scaling 2022 will bring.” Pocket Network has generated $56m revenue in December up from $29m in November and currently supports over 2000+ DApps run across its network which is integrated with Solana along with Ethereum, Polygon, Avalanche, Binance, Harmony, Gnosis (formerly xDai), Fuse and many more. “There is increased investment in public, open-source infrastructure through crypto networks that continues to chip away at the dominance of today’s providers, reducing them to commodities,” said Michael O’Rourke, CEO at Pocket Network “Our attractive economic flywheel model for our network is simple and naturally drives growth – attractive node running incentives adds more nodes which in turn creates more redundancy and better DApp service experience, more DApp usage then generates more node revenue.” Pocket meaningfully encourages and incentivizes niche cloud providers which commercially have been less viable over the last decade with massively well known incumbents dominating the traditional market, and aims to provide Web3 with a much more compatible infrastructure network. About Pocket Network Pocket Network, a blockchain data ecosystem for Web3 applications, is a platform built for applications that uses cost-efficient economics to coordinate and distribute data at scale. It enables seamless and secure interactions between blockchains and across applications. With Pocket, the use of blockchains can be simply integrated into web..sites, mobile apps, IoT and more, giving developers the freedom to put blockchain enabled applications into the “pocket” of every mainstream consumer. For more information, visit https:\/\/pokt.network. RockTree Capital, a merchant bank and fund based in China focused on blockchain projects and mobile e-commerce companies, with offices in Beijing, Shanghai, New York and Toronto. RockTree Capital invests into top-tier blockchain projects and accelerates their growth in Asia. https:\/\/rocktreecapital.com\/   This is a press release. Readers should do their own due diligence before taking any actions related to the promoted company or any of its affiliates or services. Bitcoin.com is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in the press release.","pubDate":"2022-01-16 22:00:47","full_description":"‘AWS for Web3’ Pocket Network Shakes Up Infrastructure of the Internet press release PRESS RELEASE. Tampa Bay, Florida, U.S.A – 16th January 2022 – Pocket Network – an infrastructure middleware protocol which facilitates decentralized cloud computing and abundant bandwidth on full nodes interoperable with DApps across all 21+ blockchains surpasses milestone 20,000 full nodes, answering a real and conceptual question around decentralization viability. Pocket Network incentivizes a global community of independent node operators and service providers running 21,000+ full nodes adding to the network’s resilience. Pocket Network is secured by over $320M worth of network infrastructure distributed globally across 23 countries and reduces the risk of service downtime to near zero for any layer 1 or industry DApps as work is distributed evenly across thousands of full nodes, which also protects end users’ privacy. Pocket Network, who last week closed a strategic round led by Republic Capital, RockTree Capital, Arrington Capital, is undergoing exponential growth as demand for its network measured in API calls or relays jumped to 5.78 Billion relays in December, up 44% From November 2021. “Pocket is the First Mover, changing the game as core infrastructure for the Web3 revolution” said Omer Ozden, CEO of RockTree Capital “For those that are seeking the next high growth first mover like AWS or Ethereum, you can see transparently on-chain the parabolic growth of actual usage and of actual revenues of the Pocket Network. The metrics have been super impressive and we look forward to the scaling 2022 will bring.” Pocket Network has generated $56m revenue in December up from $29m in November and currently supports over 2000+ DApps run across its network which is integrated with Solana along with Ethereum , Polygon , Avalanche , Binance , Harmony, Gnosis (formerly xDai ), Fuse and many more. “There is increased investment in public, open-source infrastructure through crypto networks that continues to chip away at the dominance of today’s providers, reducing them to commodities,” said Michael O’Rourke, CEO at Pocket Network “Our attractive economic flywheel model for our network is simple and naturally drives growth – attractive node running incentives adds more nodes which in turn creates more redundancy and better DApp service experience, more DApp usage then generates more node revenue.” Pocket meaningfully encourages and incentivizes niche cloud providers which commercially have been less viable over the last decade with massively well known incumbents dominating the traditional market, and aims to provide Web3 with a much more compatible infrastructure network. About Pocket Network Pocket Network , a blockchain data ecosystem for Web3 applications, is a platform built for applications that uses cost-efficient economics to coordinate and distribute data at scale. It enables seamless and secure interactions between blockchains and across applications. With Pocket, the use of blockchains can be simply integrated into web..sites, mobile apps, IoT and more, giving developers the freedom to put blockchain enabled applications into the “pocket” of every mainstream consumer. For more information, visit https:\/\/pokt.network . RockTree Capital, a merchant bank and fund based in China focused on blockchain projects and mobile e-commerce companies, with offices in Beijing, Shanghai, New York and Toronto. RockTree Capital invests into top-tier blockchain projects and accelerates their growth in Asia. https:\/\/rocktreecapital.com\/ Tags in this story Pocket Network This is a press release. Readers should do their own due diligence before taking any actions related to the promoted company or any of its affiliates or services. Bitcoin.com is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in the press release. Bitcoin.com Media Bitcoin.com is the premier source for everything crypto-related. Contact ads@bitcoin.com to talk about press releases, sponsored posts, podcasts and other options. Euro Inflation Hits Record Highs, ECB Not in Rush to Raise Interest Rates ECONOMICS | 2 hours ago Foam Shoe Giant Crocs Files NFT and Digital Collectibles Trademark Application NEWS | 4 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Euro Inflation Hits Record Highs, ECB Not in Rush to Raise Interest Rates More Popular News In Case You Missed It NYCB and Group of Banks Join to Launch USDF Stablecoin A group of U.S.-based banks is launching their own stablecoin, USDF. The stablecoin will be issued by the USDF Consortium, which will allow its members (financial and banking institutions) to issue USDF. The proposed stablecoin will be the first currency ... read more. Swiss National Bank Trials CBDC in Transactions With Five Banks Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin","image_url":null,"source_id":"bitcoin"},"8":{"title":"Why Dogecoin Is Plummeting Today","link":"https:\/\/www.fool.com\/investing\/2022\/01\/16\/why-dogecoin-is-sinking-today\/?source=iedfolrf0000001","keywords":null,"creator":["newsfeedback@fool.com (Keith Noonan)"],"video_url":null,"description":"Dogecoin is falling faster than any other top-15 cryptocurrency today.","content":"The price of Dogecoin (CRYPTO: DOGE) is sinking in Sunday's trading. The cryptocurrency was down 5.7% over the previous 24-hour period as of 11:45 a.m. ET. With Bitcoin and Ethereum roughly flat over the previous day of trading and the broader cryptocurrency market looking uncharacteristically stable, Dogecoin's sell-off likely stems from investors taking profits after recent gains. The token began climbing early in the week and posted even bigger gains after Tesla CEO Elon Musk announced that his electric-vehicle company would accept DOGE as payment for its merchandise. Now, the popular meme cryptocurrency seems to be taking a breather. Image source: Getty Images.Continue reading","pubDate":"2022-01-16 16:49:27","full_description":"What happened The price of Dogecoin ( CRYPTO:DOGE ) is sinking in Sunday's trading. The cryptocurrency was down 5.7% over the previous 24-hour period as of 11:45 a.m. ET. With Bitcoin and Ethereum roughly flat over the previous day of trading and the broader cryptocurrency market looking uncharacteristically stable, Dogecoin's sell-off likely stems from investors taking profits after recent gains. The token began climbing early in the week and posted even bigger gains after Tesla CEO Elon Musk announced that his electric-vehicle company would accept DOGE as payment for its merchandise. Now, the popular meme cryptocurrency seems to be taking a breather. Image source: Getty Images. So what Over the last year, Elon Musk has been a Dogecoin holder's best friend. The famous executive has hinted at, and directly expressed, support for the token through Twitter messages and other channels, and his comments have frequently powered impressive gains for the meme-powered cryptocurrency. Even with the recent pullback, Dogecoin is still up roughly 19% over the last seven days. After Musk published a Tweet on Jan. 14 announcing that Dogecoin could be used to purchase Tesla merch, the token's price quickly spiked 25%. While there doesn't appear to be any coin-specific news behind the cryptocurrency's pullback on Sunday, it's not surprising to see Dogecoin give up some ground on the heels of the recent pop. Now what Dogecoin trades down roughly 75% from the lifetime high that it hit last May. Yet, even after recent volatility in the broader cryptocurrency space and substantial draw downs for its token price, the cryptocurrency is still up roughly 1,900% over the last year. Dogecoin Price data by YCharts Dogecoin was started as a campy, dog-themed clone of Bitcoin, but the token went on to deliver seriously impressive returns for investors who got in before its massive pricing surge. The token currently has a market capitalization of roughly $23.6 billion and ranks as the 11th largest cryptocurrency by valuation. While Ethereum, Solana , and Cardano have underlying blockchain service networks that help shape the performance of their respective cryptocurrencies, the pricing drivers for Dogecoin are currently limited to coin adoption and speculation. If more companies begin accepting the token as a payment method or more trading platforms introduce the option to buy and sell the cryptocurrency, that could help to send Dogecoin higher. However, investors should proceed with the understanding that Dogecoin is a high-risk investment, and its trading will likely continue to be highly volatile.","image_url":null,"source_id":"fool"},"9":{"title":"$2.5 Billion in NFT Sales This Week, Volume Climbs 161%, Meebits NFT Sales Surge","link":"https:\/\/news.bitcoin.com\/2-5-billion-in-nft-sales-this-week-volume-climbs-161-meebits-nft-sales-surge\/","keywords":["Markets and Prices","blockchains","Cryptophunks V2","cryptoslam.io","ETH sales","Ethereum","Flow sales","looksrare","LOOT","Meebit #13824","Meebit #9711","Meebits collection","NBA Top Shot","nft","NFT buyers","NFT sales","NFT sellers","NFTs","Non-fungible Token","Opensea","ronin","Solana","ten blockchains","Theta","Wax Blockchain"],"creator":["Jamie Redman"],"video_url":null,"description":"During the last seven days, there’s been $2.53 billion non-fungible token (NFT) sales, up 161% over the past week. Ethereum’s blockchain recorded the most NFT sales with $2.45 billion of the aggregate while the Solana network saw around $31.9 million in NFT sales this week. Across 258,536 NFT buyers this week, the NFT collection Meebits […]","content":"During the last seven days, there’s been $2.53 billion non-fungible token (NFT) sales, up 161% over the past week. Ethereum’s blockchain recorded the most NFT sales with $2.45 billion of the aggregate while the Solana network saw around $31.9 million in NFT sales this week. Across 258,536 NFT buyers this week, the NFT collection Meebits captured $1.23 billion in NFT sales. With $2.5 Billion in NFT Sales Across 10 Chains, Ethereum NFT Sales Dominate by More Than 96% A great number of non-fungible token sales continue, as the recorded sales across the top 10 blockchains with NFT compatibility amounted to $2.53 billion in NFT sales. The metric is up 161% during the course of the week, but Ethereum’s NFT sales represent the lion’s share. NFTs stemming from Ethereum captured $2.45 billion and sales on the Ethereum blockchain are up 184% according to cryptoslam.io’s data on Sunday. Out of this week’s top ten blockchain networks, Theta saw an increase in seven-day sales by 490.39%. Sales on the Wax blockchain increased by 17.10% and Flow blockchain sales jumped by 1.04% this past week. The biggest sale this week, in terms of the most expensive NFT sold in seven days, was Meebit #13824 when it sold for 15,000 ETH or $50.61 million four days ago. Meebit #9711 sold for a touch less than #13824 at 14,730 ether or $49.25 million at the time of settlement. Meebits has seen a 31,948.20% seven-day increase in sales and the collection is the top NFT compilation in terms of this week’s sales. The Meebits collection saw 574 buyers amid 2,199 transactions spend $1.23 billion in sales. The week’s second most sold collection is the NFT project Loot as it has seen $281 million in weekly sales according to cryptoslam.io metrics. Loot is followed by Cryptophunks V2 as that NFT project saw $142 million in sales. While Opensea Nears $15 Billion, Axie Infinity Nears $4 Billion in All-Time NFT Sales Volume As Bitcoin.com News reported earlier this week, there’s been an influx of traders leveraging the new NFT marketplace Looksrare. The Looksrare NFT market has outpaced Opensea’s seven-day sales statistics with $444.55 million. Opensea has seen $120.55 million in sales this week, down 32.58% from the week prior. Solana’s Magic Eden was the third-largest marketplace this week with $7.68 million in sales, according to dappradar.com stats. Meanwhile, two NFT projects are about to reach new milestones in terms of all-time NFT sales volume. The NFT marketplace Opensea, which supports Ethereum and Polygon blockchains, is nearing $15 billion in total sales with $14.68 billion today. Axie Infinity is getting close to topping $4 billion in total sales, as the NFT project has accrued $3.94 billion so far. Furthermore, Flow’s NBA Top Shot is getting close to $1 billion in volume with $776.49 million total and Solana’s Magic Eden is also nearing the $1 billion mark with $615.05 million in all-time sales. What do you think about this week’s non-fungible token sales and statistics? Let us know what you think about this subject in the comments section below.","pubDate":"2022-01-16 16:30:41","full_description":"$2.5 Billion in NFT Sales This Week, Volume Climbs 161%, Meebits NFT Sales Surge During the last seven days, there’s been $2.53 billion non-fungible token (NFT) sales, up 161% over the past week. Ethereum’s blockchain recorded the most NFT sales with $2.45 billion of the aggregate while the Solana network saw around $31.9 million in NFT sales this week. Across 258,536 NFT buyers this week, the NFT collection Meebits captured $1.23 billion in NFT sales. With $2.5 Billion in NFT Sales Across 10 Chains, Ethereum NFT Sales Dominate by More Than 96% A great number of non-fungible token sales continue, as the recorded sales across the top 10 blockchains with NFT compatibility amounted to $2.53 billion in NFT sales. Over the last seven days up until January 16, 2022, there’s been $2.53 billion non-fungible token (NFT) sales, up 161% over the past week. The metric is up 161% during the course of the week, but Ethereum’s NFT sales represent the lion’s share. NFTs stemming from Ethereum captured $2.45 billion and sales on the Ethereum blockchain are up 184% according to cryptoslam.io’s data on Sunday. NFT sales on Ethereum jumped 184% this past week. Out of this week’s top ten blockchain networks, Theta saw an increase in seven-day sales by 490.39%. Sales on the Wax blockchain increased by 17.10% and Flow blockchain sales jumped by 1.04% this past week. The biggest sale this week, in terms of the most expensive NFT sold in seven days, was Meebit #13824 when it sold for 15,000 ETH or $50.61 million four days ago. Meebit #9711 sold for a touch less than #13824 at 14,730 ether or $49.25 million at the time of settlement. Top ten NFT collections in terms of this week’s sales. Meebits has seen a 31,948.20% seven-day increase in sales and the collection is the top NFT compilation in terms of this week’s sales. The Meebits collection saw 574 buyers amid 2,199 transactions spend $1.23 billion in sales. The week’s second most sold collection is the NFT project Loot as it has seen $281 million in weekly sales according to cryptoslam.io metrics. Loot is followed by Cryptophunks V2 as that NFT project saw $142 million in sales. While Opensea Nears $15 Billion, Axie Infinity Nears $4 Billion in All-Time NFT Sales Volume As Bitcoin.com News reported earlier this week, there’s been an influx of traders leveraging the new NFT marketplace Looksrare. The Looksrare NFT market has outpaced Opensea’s seven-day sales statistics with $444.55 million. Opensea has seen $120.55 million in sales this week, down 32.58% from the week prior. Solana’s Magic Eden was the third-largest marketplace this week with $7.68 million in sales, according to dappradar.com stats . Opensea and Axie Infinity all-time sales volume. Meanwhile, two NFT projects are about to reach new milestones in terms of all-time NFT sales volume. The NFT marketplace Opensea , which supports Ethereum and Polygon blockchains, is nearing $15 billion in total sales with $14.68 billion today. Axie Infinity is getting close to topping $4 billion in total sales, as the NFT project has accrued $3.94 billion so far. Furthermore, Flow’s NBA Top Shot is getting close to $1 billion in volume with $776.49 million total and Solana’s Magic Eden is also nearing the $1 billion mark with $615.05 million in all-time sales. Tags in this story blockchains , Cryptophunks V2 , cryptoslam.io , ETH sales , Ethereum , Flow sales , looksrare , LOOT , Meebit #13824 , Meebit #9711 , Meebits collection , NBA Top Shot , nft , NFT buyers , NFT sales , NFT sellers , NFTs , Non-fungible Token , Opensea , ronin , Solana , ten blockchains , Theta , Wax Blockchain What do you think about this week’s non-fungible token sales and statistics? Let us know what you think about this subject in the comments section below. Jamie Redman Jamie Redman is the News Lead at Bitcoin.com News and a financial tech journalist living in Florida. Redman has been an active member of the cryptocurrency community since 2011. He has a passion for Bitcoin, open-source code, and decentralized applications. Since September 2015, Redman has written more than 5,000 articles for Bitcoin.com News about the disruptive protocols emerging today. Meme Coin Markets Gain Close to 5% in 24 Hours, Dogecoin's Value Jumps, 3 Meme Tokens See Triple Digit Gains MARKETS AND PRICES | 18 hours ago Swiss Bank Seba Predicts Bitcoin Could Hit $75K This Year Boosted by Institutional Investors MARKETS AND PRICES | 4 days ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Pakistan Seeks to Block Websites Dealing in Cryptocurrency: Report Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Near Foundation Raises $150 Million to Bolster Web3 Adoption On Thursday, the Near Foundation announced the project has raised $150 million from strategic investors such as Three-Arrows Capital, a16z, Mechanism Capital, Dragonfly Capital, and Circle Ventures. Following the announcement, the Near protocol’s native crypto asset jumped more than 7% ... read more. Russia’s Tinkoff Bank Enters Crypto Space Through Swiss Company Acquisition Swiss National Bank Trials CBDC in Transactions With Five Banks Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin","image_url":null,"source_id":"bitcoin"}},"nextPage":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1}}