{"status":{"0":"success","1":"success","2":"success","3":"success","4":"success","5":"success","6":"success","7":"success","8":"success"},"totalResults":{"0":9,"1":9,"2":9,"3":9,"4":9,"5":9,"6":9,"7":9,"8":9},"results":{"0":{"title":"Boxing Legend Mike Tyson Says He’s ‘All in’ on Solana Crypto — Asks Fans How High SOL Will Go","link":"https:\/\/news.bitcoin.com\/boxing-legend-mike-tyson-all-in-on-solana-crypto-how-high-sol-will-go\/","keywords":["Altcoins","bitcoin vs solana","ethereum vs solana","Mike Tyson","Mike Tyson Bitcoin","Mike Tyson crypto","Mike Tyson crypto investment","Mike Tyson cryptocurrency","Mike Tyson investing in sol","Mike Tyson investments","Mike Tyson sol","Mike Tyson solana","SOL","Solana"],"creator":["Kevin Helms"],"video_url":null,"description":"Boxing legend Mike Tyson, aka “Iron Mike,” says he is “all in on solana.” He is now asking his Twitter followers how high the price of the cryptocurrency SOL will go. Mike Tyson Asks How High the Price of Solana Will Go Mike Tyson, one of the greatest heavyweight boxers of all time, has been […]","content":"Boxing legend Mike Tyson, aka “Iron Mike,” says he is “all in on solana.” He is now asking his Twitter followers how high the price of the cryptocurrency SOL will go. Mike Tyson Asks How High the Price of Solana Will Go Mike Tyson, one of the greatest heavyweight boxers of all time, has been active in the crypto space. After announcing last week that he is “all in” on the cryptocurrency solana (SOL), he is now asking his 5.7 million Twitter followers how high they think the price of the crypto will go. He tweeted Saturday, “How high do you think Sol will go?” While his tweet has received 2.4K comments at the time of writing, no one gave him a serious price analysis for solana. Tyson is nicknamed “Iron Mike” and “Kid Dynamite” in his early career, and later known as “The Baddest Man on the Planet.” Last week, he tweeted that he was “All in on Solana,” adding that he “Just copped a Catalina Whale.” His tweet included an image of a non-fungible token (NFT) from the Catalina Whale Mixer collection. Iron Mike also has his own NFT collection on Opensea, which was launched in August last year in collaboration with artist Cory Van Lew. “The Mike Tyson NFT Collection is a limited-edition series of NFTs that celebrates the iconic life and legacy of the Baddest Man on the Planet, Mike Tyson,” according to the description of the collection. Tyson further tweeted about NFTs last week: “Ever since I got into NFTs I have been looking for crypto partnerships and DREAM really stood out. It’s the first of its kind that can only be traded during US stock market hours. Could revolutionize the space and help the mental health of the crypto community.” Before getting into solana, Iron Mike asked his fans on Twitter which cryptocurrency they recommended. In June last year, he was weighing between bitcoin and ether. He tweeted, “Which do you prefer, BTC or ETH?” He then tried to choose between solana and ether. In September, he tweeted, “Solana or Ethereum?” Solana is currently the fifth-largest cryptocurrency with a market capitalization of about $47 billion based on data from Bitcoin.com Markets. The coin is trading at $149.84. The cryptocurrency gained 4,495% over the past year but is down more than 15% over the past month. Last week, Bank of America published a bullish report on solana, asserting that SOL could take market share from ethereum and become the Visa of the digital asset ecosystem. What do you think about Mike Tyson’s solana comments? Let us know in the comments section below.","pubDate":"2022-01-17 02:30:40","full_description":"Boxing Legend Mike Tyson Says He's 'All in' on Solana Crypto — Asks Fans How High SOL Will Go Boxing legend Mike Tyson, aka “Iron Mike,” says he is “all in on solana.” He is now asking his Twitter followers how high the price of the cryptocurrency SOL will go. Mike Tyson Asks How High the Price of Solana Will Go Mike Tyson, one of the greatest heavyweight boxers of all time, has been active in the crypto space. After announcing last week that he is “all in” on the cryptocurrency solana (SOL), he is now asking his 5.7 million Twitter followers how high they think the price of the crypto will go. He tweeted Saturday, “How high do you think Sol will go?” While his tweet has received 2.4K comments at the time of writing, no one gave him a serious price analysis for solana. Tyson is nicknamed “Iron Mike” and “Kid Dynamite” in his early career, and later known as “The Baddest Man on the Planet.” Last week, he tweeted that he was “All in on Solana,” adding that he “Just copped a Catalina Whale.” His tweet included an image of a non-fungible token (NFT) from the Catalina Whale Mixer collection. Iron Mike also has his own NFT collection on Opensea, which was launched in August last year in collaboration with artist Cory Van Lew. “The Mike Tyson NFT Collection is a limited-edition series of NFTs that celebrates the iconic life and legacy of the Baddest Man on the Planet, Mike Tyson,” according to the description of the collection. Tyson further tweeted about NFTs last week: “Ever since I got into NFTs I have been looking for crypto partnerships and DREAM really stood out. It’s the first of its kind that can only be traded during US stock market hours. Could revolutionize the space and help the mental health of the crypto community.” Before getting into solana, Iron Mike asked his fans on Twitter which cryptocurrency they recommended. In June last year, he was weighing between bitcoin and ether. He tweeted , “Which do you prefer, BTC or ETH ?” He then tried to choose between solana and ether. In September, he tweeted, “Solana or Ethereum?” Solana is currently the fifth-largest cryptocurrency with a market capitalization of about $47 billion based on data from Bitcoin.com Markets. The coin is trading at $149.84. The cryptocurrency gained 4,495% over the past year but is down more than 15% over the past month. Last week, Bank of America published a bullish report on solana, asserting that SOL could take market share from ethereum and become the Visa of the digital asset ecosystem. Tags in this story bitcoin vs solana , ethereum vs solana , Mike Tyson , Mike Tyson Bitcoin , Mike Tyson crypto , Mike Tyson crypto investment , Mike Tyson cryptocurrency , Mike Tyson investing in sol , Mike Tyson investments , Mike Tyson sol , Mike Tyson solana , SOL , Solana What do you think about Mike Tyson’s solana comments? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. Vitalik Buterin Asks Twitter Followers Which Crypto They Prefer to Overtake Ethereum — Cardano, Tron Favorites ALTCOINS | 1 day ago Bank of America Says Solana Could Take Market Share From Ethereum, Become the Visa of the Crypto Ecosystem ALTCOINS | 1 day ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Robinhood on Listing More Cryptocurrencies: ‘It’s Important That We Get a Bit More Clarity From Regulators’ Show comments More Popular News In Case You Missed It Revolut Launches Banking Services in Spain Featuring Deposit Insurance Revolut, a leading fintech platform and neobank, has received a special banking license to operate in Spain. User deposits are now insured up to €100K, with the coverage being provided by Deposit and Investment Insurance, a Lithuanian state company. The ... read more. NYCB and Group of Banks Join to Launch USDF Stablecoin Swiss National Bank Trials CBDC in Transactions With Five Banks Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament","image_url":null,"source_id":"bitcoin"},"1":{"title":"Robinhood on Listing More Cryptocurrencies: ‘It’s Important That We Get a Bit More Clarity From Regulators’","link":"https:\/\/news.bitcoin.com\/robinhood-listing-cryptocurrencies-important-clarity-from-regulators\/","keywords":["Regulation","Robinhood","Robinhood Cryptocurrency","Robinhood Cryptocurrency listings","Robinhood Cryptocurrency Regulations","Robinhood digital assets","robinhood shib","robinhood shiba inu","robinhood trading platform"],"creator":["Kevin Helms"],"video_url":null,"description":"Robinhood’s chief financial officer has revealed the popular trading platform’s crypto priority and the potential of listing more cryptocurrencies. “We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators,” he emphasized. Robinhood Waiting for Regulatory Clarity The chief financial officer (CFO) […]","content":"Robinhood’s chief financial officer has revealed the popular trading platform’s crypto priority and the potential of listing more cryptocurrencies. “We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators,” he emphasized. Robinhood Waiting for Regulatory Clarity The chief financial officer (CFO) of Robinhood, Jason Warnick, talked about cryptocurrency during The Wall Street Journal’s virtual CFO Network Summit last week. Commenting on retail investors’ high demand for Robinhood to list more cryptocurrencies, particularly the meme crypto shiba inu (SHIB), Warnick emphasized, “It’s not lost on us that our customers and others would like to see us add more coins.” However, the Robinhood executive stressed: We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators. Compliance is a top priority at Robinhood. In December last year, the company partnered with blockchain data platform Chainalysis to meet compliance requirements. Supporters of the shiba inu cryptocurrency have been petitioning on Change.org for Robinhood to list SHIB. At the time of writing, 555,811 people have signed the petition. Christine Brown, Robinhood Crypto’s chief operating officer and VP of Product Operations, said in November that the platform is in no hurry to list any additional cryptocurrencies. Her statement was in response to a question about when SHIB will be listed. Robinhood Crypto currently supports the buying, selling, and real-time market data for bitcoin (BTC), bitcoin cash (BCH), bitcoin sv (BSV), dogecoin (DOGE), ethereum (ETH), ethereum classic (ETC), and litecoin (LTC). Warnick also clarified at the summit that Robinhood will not be buying cryptocurrency for its corporate treasury like some companies have done, such as Microstrategy and Tesla. He explained: There aren’t compelling reasons strategically for our business to put any meaningful amount of our corporate cash into cryptocurrencies. In December last year, Robinhood launched a cryptocurrency gift program. The company also announced the upcoming beta launch of its cryptocurrency wallets, which has a waitlist of 1.6 million people. What do you think about the Robinhood executive’s comments? Let us know in the comments section below.","pubDate":"2022-01-17 00:30:50","full_description":"Robinhood on Listing More Cryptocurrencies: 'It's Important That We Get a Bit More Clarity From Regulators' Robinhood’s chief financial officer has revealed the popular trading platform’s crypto priority and the potential of listing more cryptocurrencies. “We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators,” he emphasized. Robinhood Waiting for Regulatory Clarity The chief financial officer (CFO) of Robinhood, Jason Warnick, talked about cryptocurrency during The Wall Street Journal’s virtual CFO Network Summit last week. Commenting on retail investors’ high demand for Robinhood to list more cryptocurrencies, particularly the meme crypto shiba inu (SHIB), Warnick emphasized, “It’s not lost on us that our customers and others would like to see us add more coins.” However, the Robinhood executive stressed: We’re a highly regulated company in a highly regulated industry, and we think it’s important that we get a bit more clarity from regulators. Compliance is a top priority at Robinhood. In December last year, the company partnered with blockchain data platform Chainalysis to meet compliance requirements. Supporters of the shiba inu cryptocurrency have been petitioning on Change.org for Robinhood to list SHIB. At the time of writing, 555,811 people have signed the petition. Christine Brown, Robinhood Crypto’s chief operating officer and VP of Product Operations, said in November that the platform is in no hurry to list any additional cryptocurrencies. Her statement was in response to a question about when SHIB will be listed. Robinhood Crypto currently supports the buying, selling, and real-time market data for bitcoin ( BTC ), bitcoin cash ( BCH ), bitcoin sv ( BSV ), dogecoin (DOGE), ethereum ( ETH ), ethereum classic ( ETC ), and litecoin ( LTC ). Warnick also clarified at the summit that Robinhood will not be buying cryptocurrency for its corporate treasury like some companies have done, such as Microstrategy and Tesla. He explained: There aren’t compelling reasons strategically for our business to put any meaningful amount of our corporate cash into cryptocurrencies. In December last year, Robinhood launched a cryptocurrency gift program . The company also announced the upcoming beta launch of its cryptocurrency wallets , which has a waitlist of 1.6 million people. Tags in this story Robinhood , Robinhood Cryptocurrency , Robinhood Cryptocurrency listings , Robinhood Cryptocurrency Regulations , Robinhood digital assets , robinhood shib , robinhood shiba inu , robinhood trading platform What do you think about the Robinhood executive’s comments? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. Pakistan Seeks to Block Websites Dealing in Cryptocurrency: Report REGULATION | 10 hours ago MTI Mastermind Arrest: Lawyer Points to Agreement Relating to Johann Steynberg's Extradition to South Africa REGULATION | 18 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Jack Dorsey’s Payments Company Is ‘Officially Building an Open Bitcoin Mining System’ Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Russia’s Tinkoff Bank Enters Crypto Space Through Swiss Company Acquisition The Russian neobank Tinkoff is joining the world of cryptocurrencies with the purchase of a stake in Aximetria, a Swiss-registered and licensed company which provides clients around the world with services and solutions for digital financial assets. Tinkoff Bank Buys ... read more. Revolut Launches Banking Services in Spain Featuring Deposit Insurance Swiss National Bank Trials CBDC in Transactions With Five Banks Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption","image_url":null,"source_id":"bitcoin"},"2":{"title":"‘AWS for Web3’ Pocket Network Shakes Up Infrastructure of the Internet","link":"https:\/\/news.bitcoin.com\/aws-for-web3-pocket-network-shakes-up-infrastructure-of-the-internet\/","keywords":["Press release","Pocket Network"],"creator":["Bitcoin.com Media"],"video_url":null,"description":"PRESS RELEASE. Tampa Bay, Florida, U.S.A – 16th January 2022 – Pocket Network – an infrastructure middleware protocol which facilitates decentralized cloud computing and abundant bandwidth on full nodes interoperable with DApps across all 21+ blockchains surpasses milestone 20,000 full nodes, answering a real and conceptual question around decentralization viability. Pocket Network incentivizes a global […]","content":"PRESS RELEASE. Tampa Bay, Florida, U.S.A – 16th January 2022 – Pocket Network – an infrastructure middleware protocol which facilitates decentralized cloud computing and abundant bandwidth on full nodes interoperable with DApps across all 21+ blockchains surpasses milestone 20,000 full nodes, answering a real and conceptual question around decentralization viability. Pocket Network incentivizes a global community of independent node operators and service providers running 21,000+ full nodes adding to the network’s resilience. Pocket Network is secured by over $320M worth of network infrastructure distributed globally across 23 countries and reduces the risk of service downtime to near zero for any layer 1 or industry DApps as work is distributed evenly across thousands of full nodes, which also protects end users’ privacy. Pocket Network, who last week closed a strategic round led by Republic Capital, RockTree Capital, Arrington Capital, is undergoing exponential growth as demand for its network measured in API calls or relays jumped to 5.78 Billion relays in December, up 44% From November 2021. “Pocket is the First Mover, changing the game as core infrastructure for the Web3 revolution” said Omer Ozden, CEO of RockTree Capital “For those that are seeking the next high growth first mover like AWS or Ethereum, you can see transparently on-chain the parabolic growth of actual usage and of actual revenues of the Pocket Network. The metrics have been super impressive and we look forward to the scaling 2022 will bring.” Pocket Network has generated $56m revenue in December up from $29m in November and currently supports over 2000+ DApps run across its network which is integrated with Solana along with Ethereum, Polygon, Avalanche, Binance, Harmony, Gnosis (formerly xDai), Fuse and many more. “There is increased investment in public, open-source infrastructure through crypto networks that continues to chip away at the dominance of today’s providers, reducing them to commodities,” said Michael O’Rourke, CEO at Pocket Network “Our attractive economic flywheel model for our network is simple and naturally drives growth – attractive node running incentives adds more nodes which in turn creates more redundancy and better DApp service experience, more DApp usage then generates more node revenue.” Pocket meaningfully encourages and incentivizes niche cloud providers which commercially have been less viable over the last decade with massively well known incumbents dominating the traditional market, and aims to provide Web3 with a much more compatible infrastructure network. About Pocket Network Pocket Network, a blockchain data ecosystem for Web3 applications, is a platform built for applications that uses cost-efficient economics to coordinate and distribute data at scale. It enables seamless and secure interactions between blockchains and across applications. With Pocket, the use of blockchains can be simply integrated into web..sites, mobile apps, IoT and more, giving developers the freedom to put blockchain enabled applications into the “pocket” of every mainstream consumer. For more information, visit https:\/\/pokt.network. RockTree Capital, a merchant bank and fund based in China focused on blockchain projects and mobile e-commerce companies, with offices in Beijing, Shanghai, New York and Toronto. RockTree Capital invests into top-tier blockchain projects and accelerates their growth in Asia. https:\/\/rocktreecapital.com\/   This is a press release. Readers should do their own due diligence before taking any actions related to the promoted company or any of its affiliates or services. Bitcoin.com is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in the press release.","pubDate":"2022-01-16 22:00:47","full_description":"‘AWS for Web3’ Pocket Network Shakes Up Infrastructure of the Internet press release PRESS RELEASE. Tampa Bay, Florida, U.S.A – 16th January 2022 – Pocket Network – an infrastructure middleware protocol which facilitates decentralized cloud computing and abundant bandwidth on full nodes interoperable with DApps across all 21+ blockchains surpasses milestone 20,000 full nodes, answering a real and conceptual question around decentralization viability. Pocket Network incentivizes a global community of independent node operators and service providers running 21,000+ full nodes adding to the network’s resilience. Pocket Network is secured by over $320M worth of network infrastructure distributed globally across 23 countries and reduces the risk of service downtime to near zero for any layer 1 or industry DApps as work is distributed evenly across thousands of full nodes, which also protects end users’ privacy. Pocket Network, who last week closed a strategic round led by Republic Capital, RockTree Capital, Arrington Capital, is undergoing exponential growth as demand for its network measured in API calls or relays jumped to 5.78 Billion relays in December, up 44% From November 2021. “Pocket is the First Mover, changing the game as core infrastructure for the Web3 revolution” said Omer Ozden, CEO of RockTree Capital “For those that are seeking the next high growth first mover like AWS or Ethereum, you can see transparently on-chain the parabolic growth of actual usage and of actual revenues of the Pocket Network. The metrics have been super impressive and we look forward to the scaling 2022 will bring.” Pocket Network has generated $56m revenue in December up from $29m in November and currently supports over 2000+ DApps run across its network which is integrated with Solana along with Ethereum , Polygon , Avalanche , Binance , Harmony, Gnosis (formerly xDai ), Fuse and many more. “There is increased investment in public, open-source infrastructure through crypto networks that continues to chip away at the dominance of today’s providers, reducing them to commodities,” said Michael O’Rourke, CEO at Pocket Network “Our attractive economic flywheel model for our network is simple and naturally drives growth – attractive node running incentives adds more nodes which in turn creates more redundancy and better DApp service experience, more DApp usage then generates more node revenue.” Pocket meaningfully encourages and incentivizes niche cloud providers which commercially have been less viable over the last decade with massively well known incumbents dominating the traditional market, and aims to provide Web3 with a much more compatible infrastructure network. About Pocket Network Pocket Network , a blockchain data ecosystem for Web3 applications, is a platform built for applications that uses cost-efficient economics to coordinate and distribute data at scale. It enables seamless and secure interactions between blockchains and across applications. With Pocket, the use of blockchains can be simply integrated into web..sites, mobile apps, IoT and more, giving developers the freedom to put blockchain enabled applications into the “pocket” of every mainstream consumer. For more information, visit https:\/\/pokt.network . RockTree Capital, a merchant bank and fund based in China focused on blockchain projects and mobile e-commerce companies, with offices in Beijing, Shanghai, New York and Toronto. RockTree Capital invests into top-tier blockchain projects and accelerates their growth in Asia. https:\/\/rocktreecapital.com\/ Tags in this story Pocket Network This is a press release. Readers should do their own due diligence before taking any actions related to the promoted company or any of its affiliates or services. Bitcoin.com is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in the press release. Bitcoin.com Media Bitcoin.com is the premier source for everything crypto-related. Contact ads@bitcoin.com to talk about press releases, sponsored posts, podcasts and other options. Euro Inflation Hits Record Highs, ECB Not in Rush to Raise Interest Rates ECONOMICS | 2 hours ago Foam Shoe Giant Crocs Files NFT and Digital Collectibles Trademark Application NEWS | 4 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Euro Inflation Hits Record Highs, ECB Not in Rush to Raise Interest Rates More Popular News In Case You Missed It NYCB and Group of Banks Join to Launch USDF Stablecoin A group of U.S.-based banks is launching their own stablecoin, USDF. The stablecoin will be issued by the USDF Consortium, which will allow its members (financial and banking institutions) to issue USDF. The proposed stablecoin will be the first currency ... read more. Swiss National Bank Trials CBDC in Transactions With Five Banks Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin","image_url":null,"source_id":"bitcoin"},"3":{"title":"$2.5 Billion in NFT Sales This Week, Volume Climbs 161%, Meebits NFT Sales Surge","link":"https:\/\/news.bitcoin.com\/2-5-billion-in-nft-sales-this-week-volume-climbs-161-meebits-nft-sales-surge\/","keywords":["Markets and Prices","blockchains","Cryptophunks V2","cryptoslam.io","ETH sales","Ethereum","Flow sales","looksrare","LOOT","Meebit #13824","Meebit #9711","Meebits collection","NBA Top Shot","nft","NFT buyers","NFT sales","NFT sellers","NFTs","Non-fungible Token","Opensea","ronin","Solana","ten blockchains","Theta","Wax Blockchain"],"creator":["Jamie Redman"],"video_url":null,"description":"During the last seven days, there’s been $2.53 billion non-fungible token (NFT) sales, up 161% over the past week. Ethereum’s blockchain recorded the most NFT sales with $2.45 billion of the aggregate while the Solana network saw around $31.9 million in NFT sales this week. Across 258,536 NFT buyers this week, the NFT collection Meebits […]","content":"During the last seven days, there’s been $2.53 billion non-fungible token (NFT) sales, up 161% over the past week. Ethereum’s blockchain recorded the most NFT sales with $2.45 billion of the aggregate while the Solana network saw around $31.9 million in NFT sales this week. Across 258,536 NFT buyers this week, the NFT collection Meebits captured $1.23 billion in NFT sales. With $2.5 Billion in NFT Sales Across 10 Chains, Ethereum NFT Sales Dominate by More Than 96% A great number of non-fungible token sales continue, as the recorded sales across the top 10 blockchains with NFT compatibility amounted to $2.53 billion in NFT sales. The metric is up 161% during the course of the week, but Ethereum’s NFT sales represent the lion’s share. NFTs stemming from Ethereum captured $2.45 billion and sales on the Ethereum blockchain are up 184% according to cryptoslam.io’s data on Sunday. Out of this week’s top ten blockchain networks, Theta saw an increase in seven-day sales by 490.39%. Sales on the Wax blockchain increased by 17.10% and Flow blockchain sales jumped by 1.04% this past week. The biggest sale this week, in terms of the most expensive NFT sold in seven days, was Meebit #13824 when it sold for 15,000 ETH or $50.61 million four days ago. Meebit #9711 sold for a touch less than #13824 at 14,730 ether or $49.25 million at the time of settlement. Meebits has seen a 31,948.20% seven-day increase in sales and the collection is the top NFT compilation in terms of this week’s sales. The Meebits collection saw 574 buyers amid 2,199 transactions spend $1.23 billion in sales. The week’s second most sold collection is the NFT project Loot as it has seen $281 million in weekly sales according to cryptoslam.io metrics. Loot is followed by Cryptophunks V2 as that NFT project saw $142 million in sales. While Opensea Nears $15 Billion, Axie Infinity Nears $4 Billion in All-Time NFT Sales Volume As Bitcoin.com News reported earlier this week, there’s been an influx of traders leveraging the new NFT marketplace Looksrare. The Looksrare NFT market has outpaced Opensea’s seven-day sales statistics with $444.55 million. Opensea has seen $120.55 million in sales this week, down 32.58% from the week prior. Solana’s Magic Eden was the third-largest marketplace this week with $7.68 million in sales, according to dappradar.com stats. Meanwhile, two NFT projects are about to reach new milestones in terms of all-time NFT sales volume. The NFT marketplace Opensea, which supports Ethereum and Polygon blockchains, is nearing $15 billion in total sales with $14.68 billion today. Axie Infinity is getting close to topping $4 billion in total sales, as the NFT project has accrued $3.94 billion so far. Furthermore, Flow’s NBA Top Shot is getting close to $1 billion in volume with $776.49 million total and Solana’s Magic Eden is also nearing the $1 billion mark with $615.05 million in all-time sales. What do you think about this week’s non-fungible token sales and statistics? Let us know what you think about this subject in the comments section below.","pubDate":"2022-01-16 16:30:41","full_description":"$2.5 Billion in NFT Sales This Week, Volume Climbs 161%, Meebits NFT Sales Surge During the last seven days, there’s been $2.53 billion non-fungible token (NFT) sales, up 161% over the past week. Ethereum’s blockchain recorded the most NFT sales with $2.45 billion of the aggregate while the Solana network saw around $31.9 million in NFT sales this week. Across 258,536 NFT buyers this week, the NFT collection Meebits captured $1.23 billion in NFT sales. With $2.5 Billion in NFT Sales Across 10 Chains, Ethereum NFT Sales Dominate by More Than 96% A great number of non-fungible token sales continue, as the recorded sales across the top 10 blockchains with NFT compatibility amounted to $2.53 billion in NFT sales. Over the last seven days up until January 16, 2022, there’s been $2.53 billion non-fungible token (NFT) sales, up 161% over the past week. The metric is up 161% during the course of the week, but Ethereum’s NFT sales represent the lion’s share. NFTs stemming from Ethereum captured $2.45 billion and sales on the Ethereum blockchain are up 184% according to cryptoslam.io’s data on Sunday. NFT sales on Ethereum jumped 184% this past week. Out of this week’s top ten blockchain networks, Theta saw an increase in seven-day sales by 490.39%. Sales on the Wax blockchain increased by 17.10% and Flow blockchain sales jumped by 1.04% this past week. The biggest sale this week, in terms of the most expensive NFT sold in seven days, was Meebit #13824 when it sold for 15,000 ETH or $50.61 million four days ago. Meebit #9711 sold for a touch less than #13824 at 14,730 ether or $49.25 million at the time of settlement. Top ten NFT collections in terms of this week’s sales. Meebits has seen a 31,948.20% seven-day increase in sales and the collection is the top NFT compilation in terms of this week’s sales. The Meebits collection saw 574 buyers amid 2,199 transactions spend $1.23 billion in sales. The week’s second most sold collection is the NFT project Loot as it has seen $281 million in weekly sales according to cryptoslam.io metrics. Loot is followed by Cryptophunks V2 as that NFT project saw $142 million in sales. While Opensea Nears $15 Billion, Axie Infinity Nears $4 Billion in All-Time NFT Sales Volume As Bitcoin.com News reported earlier this week, there’s been an influx of traders leveraging the new NFT marketplace Looksrare. The Looksrare NFT market has outpaced Opensea’s seven-day sales statistics with $444.55 million. Opensea has seen $120.55 million in sales this week, down 32.58% from the week prior. Solana’s Magic Eden was the third-largest marketplace this week with $7.68 million in sales, according to dappradar.com stats . Opensea and Axie Infinity all-time sales volume. Meanwhile, two NFT projects are about to reach new milestones in terms of all-time NFT sales volume. The NFT marketplace Opensea , which supports Ethereum and Polygon blockchains, is nearing $15 billion in total sales with $14.68 billion today. Axie Infinity is getting close to topping $4 billion in total sales, as the NFT project has accrued $3.94 billion so far. Furthermore, Flow’s NBA Top Shot is getting close to $1 billion in volume with $776.49 million total and Solana’s Magic Eden is also nearing the $1 billion mark with $615.05 million in all-time sales. Tags in this story blockchains , Cryptophunks V2 , cryptoslam.io , ETH sales , Ethereum , Flow sales , looksrare , LOOT , Meebit #13824 , Meebit #9711 , Meebits collection , NBA Top Shot , nft , NFT buyers , NFT sales , NFT sellers , NFTs , Non-fungible Token , Opensea , ronin , Solana , ten blockchains , Theta , Wax Blockchain What do you think about this week’s non-fungible token sales and statistics? Let us know what you think about this subject in the comments section below. Jamie Redman Jamie Redman is the News Lead at Bitcoin.com News and a financial tech journalist living in Florida. Redman has been an active member of the cryptocurrency community since 2011. He has a passion for Bitcoin, open-source code, and decentralized applications. Since September 2015, Redman has written more than 5,000 articles for Bitcoin.com News about the disruptive protocols emerging today. Meme Coin Markets Gain Close to 5% in 24 Hours, Dogecoin's Value Jumps, 3 Meme Tokens See Triple Digit Gains MARKETS AND PRICES | 18 hours ago Swiss Bank Seba Predicts Bitcoin Could Hit $75K This Year Boosted by Institutional Investors MARKETS AND PRICES | 4 days ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Pakistan Seeks to Block Websites Dealing in Cryptocurrency: Report Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Near Foundation Raises $150 Million to Bolster Web3 Adoption On Thursday, the Near Foundation announced the project has raised $150 million from strategic investors such as Three-Arrows Capital, a16z, Mechanism Capital, Dragonfly Capital, and Circle Ventures. Following the announcement, the Near protocol’s native crypto asset jumped more than 7% ... read more. Russia’s Tinkoff Bank Enters Crypto Space Through Swiss Company Acquisition Swiss National Bank Trials CBDC in Transactions With Five Banks Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin","image_url":null,"source_id":"bitcoin"},"4":{"title":"Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin","link":"https:\/\/news.bitcoin.com\/survey-proportion-of-south-african-crypto-holders-grows-to-11-3-56-of-crypto-owners-hold-bitcoin\/","keywords":["Emerging Markets","crypto holders","cryptocurrency ownership","dogecoin","Solana","south africa crypto","XRP"],"creator":["Terence Zimwara"],"video_url":null,"description":"The number of surveyed South Africans that own crypto grew marginally from 10.3% in October 2021, to 11.3% in December 2021. With this rate of ownership, South Africa is now ranked number 21 out of the 27 countries whose internet users participated in the survey. South African Ownership Rate Below Global Average According to the […]","content":"The number of surveyed South Africans that own crypto grew marginally from 10.3% in October 2021, to 11.3% in December 2021. With this rate of ownership, South Africa is now ranked number 21 out of the 27 countries whose internet users participated in the survey. South African Ownership Rate Below Global Average According to the findings of the latest Finder survey, out of the 2,003 South African internet users that were surveyed, 11.3% said they own cryptocurrency. This cryptocurrency ownership rate is said to be marginally higher than that of the United States (10.5%) and Sweden (9.8%). Still, as the survey findings show, South Africa’s latest cryptocurrency ownership rate is yet below the global average, which jumped from 11.2% in October to 15.5% in December 2021. From the total of 27 countries that were surveyed, South Africa is now positioned in 21st place. In terms of the popularity of different cryptocurrencies, the survey findings indicate that 56% of the crypto owners in South Africa own bitcoin. With this proportion of internet users that own BTC, South Africa is the second-highest ranked out of the 27 countries. However, the findings also appear to suggest that other cryptocurrencies are gaining ground. “Between now and the last survey, the number of crypto owners surveyed who said they held BTC has fallen from the 73.5% of respondents who said they own Bitcoin in October to 56% in December,” explains the Finder survey report. Altcoin Popularity Growing According to the findings, ethereum is the second most popular cryptocurrency with a share of 31.5%. This ownership rate, which is 7.1% higher than the global average of 24.4%, sees South Africa rank as the country with the eighth-highest proportion of internet users that own ethereum. In third place is XRP which is owned by 25.8% of the surveyed users while dogecoin and solana are in the fourth and fifth positions respectively. Meanwhile, the survey also found that out of those that said they own crypto, 62% are men and 38% are women. According to the survey report, this means South African “men are roughly 1.6 times as likely to own crypto than women.” On the other hand, the survey found that 48.7% of South Africans aged 18 to 34 are crypto holders. This figure is 16 percentage points higher than that of South African holders between the ages of 35 and 54. What are your thoughts concerning the findings of the latest Finder survey? Tell us what you think in the comments section below.","pubDate":"2022-01-16 12:30:55","full_description":"Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin The number of surveyed South Africans that own crypto grew marginally from 10.3% in October 2021, to 11.3% in December 2021. With this rate of ownership, South Africa is now ranked number 21 out of the 27 countries whose internet users participated in the survey. South African Ownership Rate Below Global Average According to the findings of the latest Finder survey, out of the 2,003 South African internet users that were surveyed, 11.3% said they own cryptocurrency. This cryptocurrency ownership rate is said to be marginally higher than that of the United States (10.5%) and Sweden (9.8%). Still, as the survey findings show, South Africa’s latest cryptocurrency ownership rate is yet below the global average, which jumped from 11.2% in October to 15.5% in December 2021. From the total of 27 countries that were surveyed, South Africa is now positioned in 21st place. In terms of the popularity of different cryptocurrencies, the survey findings indicate that 56% of the crypto owners in South Africa own bitcoin. With this proportion of internet users that own BTC , South Africa is the second-highest ranked out of the 27 countries. However, the findings also appear to suggest that other cryptocurrencies are gaining ground. “Between now and the last survey, the number of crypto owners surveyed who said they held BTC has fallen from the 73.5% of respondents who said they own Bitcoin in October to 56% in December,” explains the Finder survey report. Altcoin Popularity Growing According to the findings, ethereum is the second most popular cryptocurrency with a share of 31.5%. This ownership rate, which is 7.1% higher than the global average of 24.4%, sees South Africa rank as the country with the eighth-highest proportion of internet users that own ethereum. In third place is XRP which is owned by 25.8% of the surveyed users while dogecoin and solana are in the fourth and fifth positions respectively. Meanwhile, the survey also found that out of those that said they own crypto, 62% are men and 38% are women. According to the survey report, this means South African “men are roughly 1.6 times as likely to own crypto than women.” On the other hand, the survey found that 48.7% of South Africans aged 18 to 34 are crypto holders. This figure is 16 percentage points higher than that of South African holders between the ages of 35 and 54. Tags in this story crypto holders , cryptocurrency ownership , dogecoin , Solana , south africa crypto , XRP What are your thoughts concerning the findings of the latest Finder survey? Tell us what you think in the comments section below. Terence Zimwara Terence Zimwara is a Zimbabwe award-winning journalist, author and writer. He has written extensively about the economic troubles of some African countries as well as how digital currencies can provide Africans with an escape route. First Cryptocurrency ATM Reportedly Installed in Uruguay EMERGING MARKETS | 1 day ago Report: Kenya Set to Scale Up Adoption of Cryptocurrencies in 2022 EMERGING MARKETS | 6 days ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Gift to Pope Francis Sold as NFT Raises $80,000 for Afghanistan Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Near Foundation Raises $150 Million to Bolster Web3 Adoption On Thursday, the Near Foundation announced the project has raised $150 million from strategic investors such as Three-Arrows Capital, a16z, Mechanism Capital, Dragonfly Capital, and Circle Ventures. Following the announcement, the Near protocol’s native crypto asset jumped more than 7% ... read more. Russia’s Tinkoff Bank Enters Crypto Space Through Swiss Company Acquisition Revolut Launches Banking Services in Spain Featuring Deposit Insurance Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament Survey: Proportion of South African Crypto Holders Grows to 11.3%, 56% of Crypto Owners Hold Bitcoin","image_url":null,"source_id":"bitcoin"},"5":{"title":"Vitalik Buterin Asks Twitter Followers Which Crypto They Prefer to Overtake Ethereum — Cardano, Tron Favorites","link":"https:\/\/news.bitcoin.com\/vitalik-buterin-crypto-twitter-currency-prefer-overtake-ethereum-cardano-tron\/","keywords":["Altcoins","Bitcoin","Cardano","crypto replace ethereum","crypto replacing ethereum","tron","Vitalik Buterin","Vitalik Buterin poll","Vitalik Buterin poll cryptocurrency poll"],"creator":["Kevin Helms"],"video_url":null,"description":"Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter asking his followers if 80% of all transactions and savings in the year 2035 are in one currency and it is not ether, which currency they would prefer it to be. He asked them to choose from a number of cryptocurrencies including bitcoin, […]","content":"Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter asking his followers if 80% of all transactions and savings in the year 2035 are in one currency and it is not ether, which currency they would prefer it to be. He asked them to choose from a number of cryptocurrencies including bitcoin, cardano, solana, tron, and Binance coin. Vitalik Buterin’s Cryptocurrency Twitter Polls Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter Thursday for the Ethereum community. “You wake up in 2035 and 80% of all transactions and savings in the world are in one currency that is not ETH. Which would you prefer it to be?” He wrote. In his first tweet, Buterin asked his followers to choose from BTC, USD, SOL, and ADA. The second tweet lets them choose from TRON, BNB, CNY, and NEO. After 24 hours, the first poll ended with 600,697 votes and the second with 358,743 votes. Cardano (ADA) tops the results of the first poll, followed by bitcoin (BTC) and solana (SOL). Tron (TRON) tops the results of the second poll, followed by Binance coin (BNB) and neo (NEO). Buterin’s first poll includes the top cryptocurrencies by market cap, excluding stablecoins. At the time of writing, bitcoin, the largest cryptocurrency, has a market cap of $821 billion based on data from Bitcoin.com Markets. Solana, the fifth-largest crypto, has a market cap of $47 billion while cardano, the seventh-largest coin, has a market cap of $42 billion. Buterin’s second poll includes the third-largest cryptocurrency, Binance coin, which has a market cap of $83 billion. Tron’s market cap is $7 billion whereas neo’s is less than $2 billion. While the Ethereum co-founder’s polls appear fun and have attracted many comments and likes on social media, people questioned Buterin’s motives for posting such polls, the choice of cryptocurrencies he included, whether votes were made by bots, and the likelihood that 80% of transactions will be in one currency. Bitcoin trader Tone Vays commented, “Is Vitalik looking for a new job?” The CEO of cryptocurrency exchange FTX, Sam Bankman-Fried, opined: These results are….. wild. Other cryptocurrencies that have been recommended by Vitalik’s Twitter followers in response to the polls include XRP, dogecoin (DOGE), shiba inu (SHIB), and polkadot (DOT). Meanwhile, several people pointed out that the outcome of Buterin’s polls only reflects the popularity of certain cryptocurrencies among his followers and Twitter users, emphasizing that they have no bearing on the popularity of a particular cryptocurrency in the real world. Bank of America, however, believes that Solana could take market share away from Ethereum. What do you think about Vitalik Buterin’s polls? Which cryptocurrency would you prefer? Let us know in the comments section below.","pubDate":"2022-01-16 02:30:23","full_description":"Vitalik Buterin Asks Twitter Followers Which Crypto They Prefer to Overtake Ethereum — Cardano, Tron Favorites Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter asking his followers if 80% of all transactions and savings in the year 2035 are in one currency and it is not ether, which currency they would prefer it to be. He asked them to choose from a number of cryptocurrencies including bitcoin, cardano, solana, tron, and Binance coin. Vitalik Buterin’s Cryptocurrency Twitter Polls Ethereum co-founder Vitalik Buterin set up a pair of polls on Twitter Thursday for the Ethereum community. “You wake up in 2035 and 80% of all transactions and savings in the world are in one currency that is not ETH . Which would you prefer it to be?” He wrote. In his first tweet, Buterin asked his followers to choose from BTC , USD, SOL, and ADA . The second tweet lets them choose from TRON, BNB , CNY, and NEO . After 24 hours, the first poll ended with 600,697 votes and the second with 358,743 votes. Cardano ( ADA ) tops the results of the first poll, followed by bitcoin ( BTC ) and solana (SOL). Tron (TRON) tops the results of the second poll, followed by Binance coin ( BNB ) and neo ( NEO ). Buterin’s first poll includes the top cryptocurrencies by market cap, excluding stablecoins. At the time of writing, bitcoin, the largest cryptocurrency, has a market cap of $821 billion based on data from Bitcoin.com Markets. Solana, the fifth-largest crypto, has a market cap of $47 billion while cardano, the seventh-largest coin, has a market cap of $42 billion. Top cryptocurrencies by market capitalization. Source: Bitcoin.com Markets. Buterin’s second poll includes the third-largest cryptocurrency, Binance coin, which has a market cap of $83 billion. Tron’s market cap is $7 billion whereas neo’s is less than $2 billion. While the Ethereum co-founder’s polls appear fun and have attracted many comments and likes on social media, people questioned Buterin’s motives for posting such polls, the choice of cryptocurrencies he included, whether votes were made by bots, and the likelihood that 80% of transactions will be in one currency. Bitcoin trader Tone Vays commented, “Is Vitalik looking for a new job?” The CEO of cryptocurrency exchange FTX, Sam Bankman-Fried, opined: These results are….. wild. Other cryptocurrencies that have been recommended by Vitalik’s Twitter followers in response to the polls include XRP , dogecoin (DOGE), shiba inu (SHIB), and polkadot (DOT). Meanwhile, several people pointed out that the outcome of Buterin’s polls only reflects the popularity of certain cryptocurrencies among his followers and Twitter users, emphasizing that they have no bearing on the popularity of a particular cryptocurrency in the real world. Bank of America, however, believes that Solana could take market share away from Ethereum. Tags in this story Bitcoin , Cardano , crypto replace ethereum , crypto replacing ethereum , tron , Vitalik Buterin , Vitalik Buterin poll , Vitalik Buterin poll cryptocurrency poll What do you think about Vitalik Buterin’s polls? Which cryptocurrency would you prefer? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. Bank of America Says Solana Could Take Market Share From Ethereum, Become the Visa of the Crypto Ecosystem ALTCOINS | 2 hours ago Stablecoin USDC's ERC20 Issuance Surpasses USDT's Total Supply on Ethereum ALTCOINS | 10 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Bank of America Says Solana Could Take Market Share From Ethereum, Become the Visa of the Crypto Ecosystem Show comments More Popular News In Case You Missed It Revolut Launches Banking Services in Spain Featuring Deposit Insurance Revolut, a leading fintech platform and neobank, has received a special banking license to operate in Spain. User deposits are now insured up to €100K, with the coverage being provided by Deposit and Investment Insurance, a Lithuanian state company. The ... read more. NYCB and Group of Banks Join to Launch USDF Stablecoin Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption","image_url":null,"source_id":"bitcoin"},"6":{"title":"Bank of America Says Solana Could Take Market Share From Ethereum, Become the Visa of the Crypto Ecosystem","link":"https:\/\/news.bitcoin.com\/bank-of-america-solana-take-market-share-from-ethereum-visa-of-digital-asset-ecosystem\/","keywords":["Altcoins","Bank of America","bank of america analyst","bank of america ethereum","bank of america solana","Bofa","BOFA analyst","ethereum market share","solana taking ethereum","solana visa of crypto","solana vs ethereum"],"creator":["Kevin Helms"],"video_url":null,"description":"Bank of America’s analyst says that Solana could take market share away from Ethereum. Noting that Solana is optimized for micropayments, gaming, and non-fungible tokens (NFTs), the analyst expects “Solana could become the Visa of the digital asset ecosystem.” Bank of America on Crypto, Ethereum, and Solana Bank of America (BOFA) analyst Alkesh Shah published […]","content":"Bank of America’s analyst says that Solana could take market share away from Ethereum. Noting that Solana is optimized for micropayments, gaming, and non-fungible tokens (NFTs), the analyst expects “Solana could become the Visa of the digital asset ecosystem.” Bank of America on Crypto, Ethereum, and Solana Bank of America (BOFA) analyst Alkesh Shah published a research note on cryptocurrency this week arguing that Solana could take market share away from Ethereum. The Bank of America analyst described that Solana “produces a blockchain optimized for consumer use cases by prioritizing scalability, low transaction fees and ease of use,” citing Solana Foundation member Lily Liu. Its ease of use and low cost make the crypto optimized for micropayments, gaming, and non-fungible token (NFTs). With more than 50 billion transactions settled since its March 2020 launch, and $10 billion in total value locked, Shah said: Solana could become the Visa of the digital asset ecosystem. Solana is the fifth-largest cryptocurrency with a market capitalization of about $46 billion. Ethereum is the second-largest crypto with a market cap of almost $400 billion at the time of writing based on data from Bitcoin.com Markets. Noting that Solana’s differentiation from Ethereum is “proving successful,” Shah noted that the valuation gap provides an opportunity for Solana. Its Proof of History blockchain helps improve the performance of its Proof of Stake consensus mechanism, the Bank of America analyst opined, noting: These innovations allow for the processing of an industry-leading ~65,000 transactions per second with average transaction fees of $0.00025, while remaining relatively decentralized and secure. Meanwhile, the Ethereum blockchain prioritizes decentralization and security, at the expense of scalability, Shah described, adding that Ethereum’s scalability issue has led to periods of network congestion and ultra-high transaction fees. Emphasizing that other scalable blockchains could chip away at Ethereum’s market share, Shah explained: Ethereum’s prioritization could optimize it for high-value transactions and identity, storage and supply chain use cases. Crypto exchange Coinbase recently predicted that “ETH scalability will improve.” However, “As we welcome the next hundred million users to crypto and Web3, scalability challenges for ETH are likely to grow.” Last week, a JPMorgan analyst explained that Ethereum’s Merge and Layer 2.0 introduction will speed up transactions and could significantly cut energy consumption. However, another JPMorgan analyst noted that Ethereum might lose its decentralized finance (defi) dominance due to scaling issues. Meanwhile, Solana is not without its problems. Last week, Bitcoin.com News reported that the Solana network experienced “degraded performance due to an increase in high compute transactions … This is leading to increased loading and transaction processing times, and some failed transactions.” Do you agree with Bank of America that Solano will take market share from Ethereum and become the Visa of crypto? Let us know in the comments section below.","pubDate":"2022-01-16 00:30:17","full_description":"Bank of America Says Solana Could Take Market Share From Ethereum, Become the 'Visa of the Digital Asset Ecosystem' Bank of America’s analyst says that Solana could take market share away from Ethereum. Noting that Solana is optimized for micropayments, gaming, and non-fungible tokens (NFTs), the analyst expects “Solana could become the Visa of the digital asset ecosystem.” Bank of America on Crypto, Ethereum, and Solana Bank of America (BOFA) analyst Alkesh Shah published a research note on cryptocurrency this week arguing that Solana could take market share away from Ethereum. The Bank of America analyst described that Solana “produces a blockchain optimized for consumer use cases by prioritizing scalability, low transaction fees and ease of use,” citing Solana Foundation member Lily Liu. Its ease of use and low cost make the crypto optimized for micropayments, gaming, and non-fungible token (NFTs). With more than 50 billion transactions settled since its March 2020 launch, and $10 billion in total value locked, Shah said: Solana could become the Visa of the digital asset ecosystem. Solana is the fifth-largest cryptocurrency with a market capitalization of about $46 billion. Ethereum is the second-largest crypto with a market cap of almost $400 billion at the time of writing based on data from Bitcoin.com Markets. Noting that Solana’s differentiation from Ethereum is “proving successful,” Shah noted that the valuation gap provides an opportunity for Solana. Its Proof of History blockchain helps improve the performance of its Proof of Stake consensus mechanism, the Bank of America analyst opined, noting: These innovations allow for the processing of an industry-leading ~65,000 transactions per second with average transaction fees of $0.00025, while remaining relatively decentralized and secure. Meanwhile, the Ethereum blockchain prioritizes decentralization and security, at the expense of scalability, Shah described, adding that Ethereum’s scalability issue has led to periods of network congestion and ultra-high transaction fees. Emphasizing that other scalable blockchains could chip away at Ethereum’s market share, Shah explained: Ethereum’s prioritization could optimize it for high-value transactions and identity, storage and supply chain use cases. Crypto exchange Coinbase recently predicted that “ ETH scalability will improve.” However, “As we welcome the next hundred million users to crypto and Web3, scalability challenges for ETH are likely to grow.” Last week, a JPMorgan analyst explained that Ethereum’s Merge and Layer 2.0 introduction will speed up transactions and could significantly cut energy consumption. However, another JPMorgan analyst noted that Ethereum might lose its decentralized finance (defi) dominance due to scaling issues. Meanwhile, Solana is not without its problems. Last week, Bitcoin.com News reported that the Solana network experienced “degraded performance due to an increase in high compute transactions … This is leading to increased loading and transaction processing times, and some failed transactions.” Tags in this story Bank of America , bank of america analyst , bank of america ethereum , bank of america solana , Bofa , BOFA analyst , ethereum market share , solana taking ethereum , solana visa of crypto , solana vs ethereum Do you agree with Bank of America that Solano will take market share from Ethereum and become the Visa of crypto? Let us know in the comments section below. Kevin Helms A student of Austrian Economics, Kevin found Bitcoin in 2011 and has been an evangelist ever since. His interests lie in Bitcoin security, open-source systems, network effects and the intersection between economics and cryptography. Stablecoin USDC's ERC20 Issuance Surpasses USDT's Total Supply on Ethereum ALTCOINS | 8 hours ago Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE ALTCOINS | 1 day ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Meme Coin Markets Gain Close to 5% in 24 Hours, Dogecoin’s Value Jumps, 3 Meme Tokens See Triple Digit Gains Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Swiss National Bank Trials CBDC in Transactions With Five Banks The Swiss National Bank has successfully employed a wholesale CBDC to settle transactions with five commercial banks, the monetary authority announced. The tests are part of an experiment carried out together with the Bank for International Settlements and Switzerland’s financial ... read more. Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption British Lawmakers Say a CBDC Is Likely to Hurt Financial Stability — Digital Pound Benefits Overstated","image_url":null,"source_id":"bitcoin"},"7":{"title":"Value Locked in Defi Jumps 2.3% in 7 Days, Ethereum NFT Sales Dominate, Fantom TVL Jumps 26%","link":"https:\/\/news.bitcoin.com\/value-locked-in-defi-jumps-2-3-in-7-days-ethereum-nft-sales-dominate-fantom-tvl-jumps-26\/","keywords":["News","Aave","Arbitrum","Avalanche","Binance Smart Chain","BSC","Cardano","Convex","Cross-chain Bridges","Curve","decentralized finance","DeFi","Defi protocols","Elrond","ETH","ether","Ethereum","Fantom","Harmony","Heco","Instadapp","makerdao","NEAR","nft","NFTs","Optimism","osmosis","Polkadot","Polygon","ronin","Smartbch","Solana","Terra","total value locked","TVL","WAVES","WBTC"],"creator":["Jamie Redman"],"video_url":null,"description":"On Saturday, January 15, 2022, the value locked in decentralized finance (defi) protocols across a number of blockchains has increased from $233.95 billion since January 8, to $239.44 billion. Curve’s total value locked (TVL) dominance today is 9.76% with its $23.38 billion TVL. Meanwhile, native assets for the top nine smart contract platforms have seen […]","content":"On Saturday, January 15, 2022, the value locked in decentralized finance (defi) protocols across a number of blockchains has increased from $233.95 billion since January 8, to $239.44 billion. Curve’s total value locked (TVL) dominance today is 9.76% with its $23.38 billion TVL. Meanwhile, native assets for the top nine smart contract platforms have seen seven-day gains improving from the week prior’s price slump. Defi TVL Jumps 2.3% Higher This Week Today’s top smart contract platform tokens are up in value against the U.S. dollar according to weekly statistics. The top three tokens, ethereum (ETH) jumped 5.1% this past week, binance coin (BNB) spiked 11.4%, and solana (SOL) increased 8.7%. Out of the top nine, the biggest gainers like near (NEAR) increased 31.3% and terra (LUNA) jumped 23.5% this week. Polygon (MATIC) made an impressionable 15.5% jump and polkadot (DOT) increased by 10.3% against the U.S. dollar. On January 15, the TVL in defi today is 2.34% higher than it was on January 8, when the TVL metric was $233.95 billion. Today, there’s $239.44 billion and $146.54 billion is held on the Ethereum blockchain. Ethereum’s defi dominance, in terms of TVL, is 62.63% of the total value locked in decentralized finance on Saturday. The second-largest TVL belongs to Terra as the network commands $19.01 billion, but that’s only 8.12% of the aggregate TVL in defi. While Terra’s TVL in defi jumped 22.03% this week, it is followed by Binance Smart Chain (BSC) with $15.21 billion. Meanwhile, Fantom’s TVL jumped higher than Terra’s this past week increasing 26.33% to $7.12 billion. Osmosis (OSMO) increased 18.60% this week rising to a $1.36 billion TVL in its defi protocols. A number of defi chains saw TVL increases this week except for Ethereum, BSC, and HECO. Defi chains that saw TVL increases include Terra, Avalanche, Solana, Fantom, Polygon, Tron, Arbitrum, Cronos, Osmosis, Klaytn, Waves, and Harmony. Ethereum NFT Sales Dominate, Cross-Chain Bridge TVL Increases 4.6% in 30 Days In terms of non-fungible token (NFT) sales across the myriad of blockchain networks, Ethereum is the most dominant chain. Ethereum’s NFT sales are followed by NFT sales on networks like Solana, Ronin, Flow, and Wax. Ethereum’s NFT sales saw a 51.29% increase during the last 24 hours while Tezos NFT sales jumped by 33.16% during the last day. Moreover, the Looksrare NFT marketplace is still seeing a lot more daily volume than Opensea’s 24-hour NFT volume. During the last day, Looksrare’s volume was $504.37 million while Opensea’s recorded 24-hour volume was $166.09 million. The total value locked (TVL) in cross-chain bridges is $25.03 billion on Saturday which is up 4.6% over the last 30 days. The top five largest TVLs in cross-chain bridges include Polygon ($6.3B), Avalanche ($5.5B), Ronin ($4.9B), Arbitrum ($3.2B), and Fantom ($1.9B). What do you think about the recent defi action this past week? Let us know what you think about this subject in the comments section below.","pubDate":"2022-01-15 18:30:26","full_description":"Value Locked in Defi Jumps 2.3% in 7 Days, Ethereum NFT Sales Dominate, Fantom TVL Jumps 26% On Saturday, January 15, 2022, the value locked in decentralized finance (defi) protocols across a number of blockchains has increased from $233.95 billion since January 8, to $239.44 billion. Curve’s total value locked (TVL) dominance today is 9.76% with its $23.38 billion TVL. Meanwhile, native assets for the top nine smart contract platforms have seen seven-day gains improving from the week prior’s price slump. Defi TVL Jumps 2.3% Higher This Week Today’s top smart contract platform tokens are up in value against the U.S. dollar according to weekly statistics. The top three tokens, ethereum ( ETH ) jumped 5.1% this past week, binance coin ( BNB ) spiked 11.4%, and solana (SOL) increased 8.7%. Top ten smart contract platforms in terms of market valuation on January 15, 2022. Out of the top nine, the biggest gainers like near (NEAR) increased 31.3% and terra (LUNA) jumped 23.5% this week. Polygon (MATIC) made an impressionable 15.5% jump and polkadot (DOT) increased by 10.3% against the U.S. dollar. On January 15, the TVL in defi today is 2.34% higher than it was on January 8, when the TVL metric was $233.95 billion. Today, there’s $239.44 billion and $146.54 billion is held on the Ethereum blockchain. Ethereum’s defi dominance , in terms of TVL, is 62.63% of the total value locked in decentralized finance on Saturday. The total value locked in decentralized finance on January 15, 2022. The second-largest TVL belongs to Terra as the network commands $19.01 billion, but that’s only 8.12% of the aggregate TVL in defi. While Terra’s TVL in defi jumped 22.03% this week, it is followed by Binance Smart Chain (BSC) with $15.21 billion. Meanwhile, Fantom’s TVL jumped higher than Terra’s this past week increasing 26.33% to $7.12 billion. Osmosis (OSMO) increased 18.60% this week rising to a $1.36 billion TVL in its defi protocols. A number of defi chains saw TVL increases this week except for Ethereum, BSC, and HECO. Defi chains that saw TVL increases include Terra, Avalanche, Solana, Fantom, Polygon, Tron, Arbitrum, Cronos, Osmosis, Klaytn, Waves, and Harmony. Ethereum NFT Sales Dominate, Cross-Chain Bridge TVL Increases 4.6% in 30 Days In terms of non-fungible token (NFT) sales across the myriad of blockchain networks, Ethereum is the most dominant chain. Ethereum’s NFT sales are followed by NFT sales on networks like Solana, Ronin, Flow, and Wax. NFT sales volumes by blockchain on January 15, 2022. Ethereum’s NFT sales saw a 51.29% increase during the last 24 hours while Tezos NFT sales jumped by 33.16% during the last day. Moreover, the Looksrare NFT marketplace is still seeing a lot more daily volume than Opensea’s 24-hour NFT volume. During the last day, Looksrare’s volume was $504.37 million while Opensea’s recorded 24-hour volume was $166.09 million. The total value locked (TVL) in cross-chain bridges is $25.03 billion on Saturday which is up 4.6% over the last 30 days. The top five largest TVLs in cross-chain bridges include Polygon ($6.3B), Avalanche ($5.5B), Ronin ($4.9B), Arbitrum ($3.2B), and Fantom ($1.9B). Tags in this story Aave , Arbitrum , Avalanche , Binance Smart Chain , BSC , Cardano , Convex , Cross-chain Bridges , Curve , decentralized finance , DeFi , Defi protocols , Elrond , ETH , ether , Ethereum , Fantom , Harmony , Heco , Instadapp , makerdao , NEAR , nft , NFTs , Optimism , osmosis , Polkadot , Polygon , ronin , Smartbch , Solana , Terra , total value locked , TVL , WAVES , WBTC What do you think about the recent defi action this past week? Let us know what you think about this subject in the comments section below. Jamie Redman Jamie Redman is the News Lead at Bitcoin.com News and a financial tech journalist living in Florida. Redman has been an active member of the cryptocurrency community since 2011. He has a passion for Bitcoin, open-source code, and decentralized applications. Since September 2015, Redman has written more than 5,000 articles for Bitcoin.com News about the disruptive protocols emerging today. North Korean Hackers Stole $400 Million in Cryptocurrency Last Year — Ether Accounts for 58% of Stolen Funds NEWS | 14 hours ago Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament NEWS | 1 day ago Image Credits : Shutterstock, Pixabay, Wiki Commons, defillama.com, coingecko.com, cryptoslam.io, Previous article Stablecoin USDC’s ERC20 Issuance Surpasses USDT’s Total Supply on Ethereum Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE Tesla now accepts dogecoin for some merchandise on its website. CEO Elon Musk delivered on the promise he made in December that his electric car company will accept DOGE. Meanwhile, Tesla still has not resumed accepting bitcoin. Dogecoin Now Accepted ... read more. Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption British Lawmakers Say a CBDC Is Likely to Hurt Financial Stability — Digital Pound Benefits Overstated","image_url":null,"source_id":"bitcoin"},"8":{"title":"Stablecoin USDC’s ERC20 Issuance Surpasses USDT’s Total Supply on Ethereum","link":"https:\/\/news.bitcoin.com\/stablecoin-usdcs-erc20-issuance-surpasses-usdts-total-supply-on-ethereum\/","keywords":["Altcoins","Centralized stablecoins","crypto economy","ERC20","ERC20 USDC","ERC20 USDT","ether","Ethereum","Ethereum (ETH)","FRAX","MIM","Stablecoin Economy","Stablecoin giants","Stablecoins","usd coin","USDC","USDC issuance","USDT","USDT issuance","UST"],"creator":["Jamie Redman"],"video_url":null,"description":"On Saturday, January 15, 2022, the market capitalization of all the stablecoins in existence is $173 billion, which represents 7.93% of the $2.18 trillion crypto-economy. The market valuations of stablecoins tether and usd coin represent 71.84% of the entire stablecoin economy’s value. This week, the current total supply of usd coin surpassed tether, in terms […]","content":"On Saturday, January 15, 2022, the market capitalization of all the stablecoins in existence is $173 billion, which represents 7.93% of the $2.18 trillion crypto-economy. The market valuations of stablecoins tether and usd coin represent 71.84% of the entire stablecoin economy’s value. This week, the current total supply of usd coin surpassed tether, in terms of tokens issued on the Ethereum blockchain, as usd coin has a 0.568% larger fully diluted market capitalization on the smart contract network. USDC Issuance on Ethereum Surpasses Tether’s ERC20 Supply The current total supply of the stablecoin usd coin (USDC) on the Ethereum blockchain is over 40 billion units, which is higher than the number of tether (USDT) on the chain. At the time of writing, according to etherscan statistics, the current supply of USDT is 39.8 billion units. While there’s only 0.568% more USDC tokens than the number of tethers in circulation, it’s the first time USDC has overtaken USDT in terms of Ethereum issuance. While tether has seen 136,448,792 transfers total on the ETH chain, USDC has only seen 33,104,877. Essentially, ERC20 tethers have been transacted with 312.17% more than USDC tokens have been transferred. Tether also has a lot more USDT tokens across multiple blockchain networks with a current total supply of 79 billion tethers. USDC is also on a few different blockchains, but the majority of USDC resides on Ethereum. USDC has a current total supply of 45.3 billion, which means 5.3 billion USDCs are used on alternative blockchains. Stablecoin Giants Eclipse Decentralized, Algorithmic Competitors Despite Double-Digit Monthly Growth Both of these stablecoins are giants in comparison to the rest of the stablecoins in existence as they dominate 71.84% of today’s stablecoin economy. During the last 24 hours, across the entire crypto-economy, there’s been $78 billion in total trade volume. However, stablecoin trades represent $47.5 billion of today’s trade volume or more than 60% of the aggregate. Statistics from coingecko.com’s top stablecoin by market capitalization indicate that tether has increased its supply by 1.8% during the last 30 days. USDC’s supply over the last month has increased by 8.9%. Decentralized and algorithmic stablecoin supplies have seen much larger increases during the last 30 days as UST, MIM, and FRAX increased by double-digit percentages. Terra’s UST increased 22%, MIM jumped 17%, and FRAX increased by 46.4% over the last month. What do you think about the current total supply of USDC surpassing tether’s current supply on the Ethereum blockchain? Let us know what you think about this subject in the comments section below.","pubDate":"2022-01-15 16:30:34","full_description":"Stablecoin USDC's ERC20 Issuance Surpasses USDT's Total Supply on Ethereum On Saturday, January 15, 2022, the market capitalization of all the stablecoins in existence is $173 billion, which represents 7.93% of the $2.18 trillion crypto-economy. The market valuations of stablecoins tether and usd coin represent 71.84% of the entire stablecoin economy’s value. This week, the current total supply of usd coin surpassed tether, in terms of tokens issued on the Ethereum blockchain, as usd coin has a 0.568% larger fully diluted market capitalization on the smart contract network. USDC Issuance on Ethereum Surpasses Tether’s ERC20 Supply The current total supply of the stablecoin usd coin (USDC) on the Ethereum blockchain is over 40 billion units , which is higher than the number of tether ( USDT ) on the chain. At the time of writing, according to etherscan statistics , the current supply of USDT is 39.8 billion units. While there’s only 0.568% more USDC tokens than the number of tethers in circulation, it’s the first time USDC has overtaken USDT in terms of Ethereum issuance. Total supply of USDC on January 15, 2022, according to etherscan.io metrics. While tether has seen 136,448,792 transfers total on the ETH chain, USDC has only seen 33,104,877. Essentially, ERC20 tethers have been transacted with 312.17% more than USDC tokens have been transferred. Tether also has a lot more USDT tokens across multiple blockchain networks with a current total supply of 79 billion tethers. Total supply of USDT on January 15, 2022, according to etherscan.io metrics. USDC is also on a few different blockchains, but the majority of USDC resides on Ethereum. USDC has a current total supply of 45.3 billion, which means 5.3 billion USDCs are used on alternative blockchains. Stablecoin Giants Eclipse Decentralized, Algorithmic Competitors Despite Double-Digit Monthly Growth Both of these stablecoins are giants in comparison to the rest of the stablecoins in existence as they dominate 71.84% of today’s stablecoin economy. During the last 24 hours, across the entire crypto-economy, there’s been $78 billion in total trade volume. However, stablecoin trades represent $47.5 billion of today’s trade volume or more than 60% of the aggregate. Statistics from coingecko.com’s top stablecoin by market capitalization indicate that tether has increased its supply by 1.8% during the last 30 days. USDC’s supply over the last month has increased by 8.9%. Decentralized and algorithmic stablecoin supplies have seen much larger increases during the last 30 days as UST, MIM, and FRAX increased by double-digit percentages. Terra’s UST increased 22%, MIM jumped 17%, and FRAX increased by 46.4% over the last month. Tags in this story Altcoins , Centralized stablecoins , crypto economy , ERC20 , ERC20 USDC , ERC20 USDT , ether , Ethereum , Ethereum (ETH) , FRAX , MIM , Stablecoin Economy , Stablecoin giants , Stablecoins , usd coin , USDC , USDC issuance , USDT , USDT issuance , UST What do you think about the current total supply of USDC surpassing tether’s current supply on the Ethereum blockchain? Let us know what you think about this subject in the comments section below. Jamie Redman Jamie Redman is the News Lead at Bitcoin.com News and a financial tech journalist living in Florida. Redman has been an active member of the cryptocurrency community since 2011. He has a passion for Bitcoin, open-source code, and decentralized applications. Since September 2015, Redman has written more than 5,000 articles for Bitcoin.com News about the disruptive protocols emerging today. Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE ALTCOINS | 1 day ago Near Foundation Raises $150 Million to Bolster Web3 Adoption ALTCOINS | 1 day ago Image Credits : Shutterstock, Pixabay, Wiki Commons, etherscan.io, Previous article Bitcoin’s Hashrate Taps New Lifetime High, BTC Price 20% Above Production Cost, Difficulty Nears ATH Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Swiss National Bank Trials CBDC in Transactions With Five Banks The Swiss National Bank has successfully employed a wholesale CBDC to settle transactions with five commercial banks, the monetary authority announced. The tests are part of an experiment carried out together with the Bank for International Settlements and Switzerland’s financial ... read more. Tesla Begins Accepting Dogecoin Payments — Some Merchandise Can Only Be Purchased With DOGE Kingdom of Tonga May Adopt Bitcoin as Legal Tender, Says Former Member of Parliament FTX Launches $2 Billion Venture Capital Fund Focused on Bolstering Blockchain, Web3 Adoption","image_url":null,"source_id":"bitcoin"}},"nextPage":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null}}